{
  "https://www.consumeraffairs.com/medical-alert-systems/unaliwear-kanega-watch.html_UnaliWear Kanega Watch Reviews": {
    "company": "Unaliwear",
    "title": "UnaliWear Kanega Watch Reviews",
    "url": "https://www.consumeraffairs.com/medical-alert-systems/unaliwear-kanega-watch.html",
    "source": "ConsumerAffairs",
    "body": "If any issues come up, UnaliWear will replace the watch for free. The company also covers replacement and shipping at no cost the first time you break the watch. Be aware that UnaliWear does not ...",
    "date": "2025-03-24",
    "full_content": "Our Buyers Guide Top Picks\n\nThe UnaliWear Kanega Watch is a more discreet alternative to traditional medical alert devices. The watch weighs 49 grams (about 1.7 ounces). It’s 1.6 inches in diameter and 0.5 inches thick. It comes with a patented quick-swap battery, so you never have to take it off to charge.\n\nThe UnaliWear Kanega Watch is a stand-alone personal emergency response device, so you don’t need a landline or cellphone to make it work. Instead, it relies on Verizon’s nationwide cellular network. The watch connects to your home Wi-Fi but automatically switches to Verizon’s network when you leave your home.\n\nYou can call for help in multiple ways. If you press and hold the button on the right side of the watch (called the crown button) for a couple of seconds, you’ll be connected to the monitoring center. These trained professionals have your contact information and the names of your caregivers and know exactly whom to notify and where to dispatch help.\n\nYou can also use voice commands through the watch’s built-in microphone. Finally, if you fall, the watch automatically detects the unusual movement and notifies the monitors.\n\nUnaliWear offers two different pricing structures for the Kanega Watch. You can make an upfront payment for the whole year, or you can pay monthly from the start. No matter how you pay, you have a one-time setup fee.\n\nAs of publishing, if you choose to pay monthly from the start, your one-time setup fee is $299. Then, you’ll pay $69.95 a month for monitoring services.\n\nThere’s no contract with either payment structure, so you can cancel the service anytime. But note that the watch and the accessories aren’t yours to keep. You have to return everything in good condition if you cancel the monitoring service.\n\nDesigned with an older user in mind, the UnaliWear Kanega Watch has many features to help improve independence, including:\n\nCompare UnaliWear with othermedical alert companies.\n\nThe company name comes from the Cherokee words “Unalii,” which means friend, and “Kanega,” which means speak. When you put them together, you have a friend who speaks to you.\n\nUnaliWear covers defects in materials and workmanship for as long as you have it, as long as you are current on your service payments. If any issues come up, UnaliWear will replace the watch for free.\n\nThe company also covers replacement and shipping at no cost the first time you break the watch. Be aware that UnaliWear does not cover replacement of a watch in all circumstances.\n\nAfter 30 days, you can cancel the service at any time as long as you return all equipment. You’ll get a refund (minus a $75 restocking fee) if all equipment is returned in good condition. Annual plans will be issued a prorated refund based on the nondiscounted monthly rate of $69.95.\n\nTo cancel your monitoring service through UnaliWear, you need to call the company’s customer support team. As a part of the cancellation, you must send the equipment back in good condition. A lost or damaged watch results in a fee of up to $650.\n\nThe company’s headquarters is in Austin, Texas.\n\nUnaliWear helps vulnerable people enjoy more independence through its medical alert technology. The stylish Kanega Watch includes 24/7 U.S.-based monitoring, fall detection, medication reminders and a 30-day money-back guarantee. Since the watch uses Wi-Fi and LTE technologies, wearers don’t need a landline to access help. In addition, UnaliWear doesn’t require a long-term contract.\n\nShop with confidence\n\nCompare with top companies\n\nFilter by Rating\n\nPopular Mentions\n\nA link has directed you to this review. Its location on this page may change next time you visit.\n\nReviewed Sept. 17, 2024\n\nThe Kanega Watch has been a lifesaver for my grandma (and mom!). My grandma lives independently and is able to continue to do so because the Kanega provides round the clock coverage in the case of an emergency. And even better, my mom can rest easy, knowing she's safe. We chose the Kanega because the 24/7 monitoring service already knows who she is when an alert comes from the watch. After doing so much research online, we found that the Kanega's coverage and service was far superior to others on the market. Totally worth the price!\n\nReviewed March 12, 2024\n\nI bought this watch for my mother in December 2023. Two months later the screen went blank and it was not usable. I made several calls and wrote emails to the company's customer service department. The calls repeatedly were answered by the \"overflow\" service department, which was not qualified to actually troubleshoot problems. After a week of no response on how to fix the watch, I returned it. If you want a watch that detects falls and will notify emergency services, I would suggest an Apple Watch. The Apple Watch does everything the Kanega does and more, and it costs less.\n\nThanks for subscribing.\n\nYou have successfully subscribed to our newsletter! Enjoy reading our tips and recommendations.\n\nReviewed Feb. 17, 2024\n\nThe watch band was too large even though the wrist measured within the range for small. And the watch was heavy, too heavy for a small person to sleep when wearing. This may work better for larger folks, but if you're small, I would not recommend it. The $75 return fee is very steep and you need to go through customer service, which tries and tries to change your mind, to return it.\n\nReviewed Nov. 15, 2023\n\nWe got the Kanega Watch for my father several years ago. He loves it and he wears it all the time, which is the total point. The fall detection has worked as advertised, and he enjoys asking his watch for the time and date. Tremendous peace of mind for him and our whole family. I highly recommend!\n\nReviewed Oct. 22, 2023\n\nI purchased the watch on 9/6/2023, I received it around 9/11/2023. I lost a battery out of it on 10/2/2023, I had no idea how I lost it. Now on 10/22/2023 the watch band has broken where it attaches with the battery to watch. Very unhappy with the construction as I bought a battery for about $36 plus shipping about 3 weeks after purchase and now about 6 weeks later it is broken. I am emailing the company today to see what they will do about this situation. I paid $918.40. I would expect a better quality.\n\nReviewed Sept. 16, 2023\n\nThe service is great. There is very little set up and it is very easy to do. Once we received the watch there were 3 very short videos to watch and then you call the center and they do a test call with you. My Aunt loves the device because it isn't a pendant that gets in the way, flops around or looks out of place when she dresses up and goes out. She also likes the fact that she never has to take it off and can wear it in the shower.\n\nOur only complaint is that after only 3 months the first watch band broke where the battery goes in. We didn't realize it cracked and one battery was lost and then the band broke all together. I believe that a more rubberized battery chamber would be a better housing for the battery. The other disappointment was we had to pay $50 for shipping for a new watch. This seems a bit steep. We haven't found anything better at this time but the shipping cost did cause the luster of this product to dull somewhat.\n\nCheck out our buyers guide top picks\n\nOur Buyers Guide Top Picks:",
    "extraction_status": "success"
  },
  "https://finance.yahoo.com/news/fort-health-partners-colleva-train-130000158.html_Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care": {
    "company": "Fort Health",
    "title": "Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care",
    "url": "https://finance.yahoo.com/news/fort-health-partners-colleva-train-130000158.html",
    "source": "Yahoo Finance",
    "body": "How it Works Using Fort Health's agentic AI training platform - which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers ...",
    "date": "2025-03-18",
    "full_content": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\n\nAgentic AI Custom Training Scenarios Result in 83% of Clinicians Feeling More Prepared and 95% Able to Apply What They Have Learned\n\nNEW YORK,March 18, 2025/PRNewswire/ -- The high stakes nature of youth mental health therapy requires thorough preparation and applied evidence-based skills. Today,Fort Health, a specialty outpatient pediatric mental health provider, announced that it has partnered withCollevato train its therapists with AI avatar-led, face-to-face simulations. By providing highly relevant and engaging customized scenarios, Fort Health is able to rapidly upskill its therapists using evidence-based therapeutic protocols, ultimately leading to improved client care and operational efficiency. The initial series of custom training scenarios resulted in 83% of clinicians feeling more prepared and 95% able to apply what they have learned.\n\nAbody of researchfrom the National Institute of Medicine shows that current efforts to train clinicians in empirically-based treatments (EBTs) face significant challenges, as they typically provide only didactic training with no examination of applied skills, follow-up support, or implementation feedback. Studies emphasize the importance of role-play skill practice and ongoing expert guidance to ensure clinicians maintain high fidelity to EBT protocols and deliver effective interventions to patients. Compounded by thebehavioral health care workforce shortage,these limitations underscore the need for innovative training approaches to address challenges in a cost-effective and scalable manner.\n\n\"AI-powered avatar simulations are revolutionizing therapist training by enabling immersive, risk-free practice of critical decision-making and patient interactions,\" saidNatalie Schneider, founding CEO of Fort Health. \"Colleva's AI coaching platform empowers us to design tailored, dynamic scenarios that mirror real-world challenges, providing therapists with hands-on experience in applying evidence-based treatment protocols. By leveraging AI patient avatars, we are transforming mental health training—making it more proactive, personalized, and scalable to meet the growing demand for high-quality care.\"\n\nHow it Works\n\nUsing Fort Health's agentic AI training platform – which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers – therapists conduct realistic role plays with custom avatars and receive personalized feedback to identify areas for improvement and highlight strengths. The series of interactive scenarios are a safe space to practice and develop therapeutic techniques. To help therapists build and demonstrate their proficiency, there are three scenarios representative of the patient population that Fort Health treats. Each of the scenario's avatars have six personalities to choose from, allowing for more realistic and varied practice. Each custom simulation uses generative AI to analyze both content and delivery. Personalized feedback is based on specific EBT objectives and CBT competency frameworks. Therapists are also provided instant feedback on soft skill competencies important to successful therapy outcomes.\n\n\"We are harnessing AI not to replace human therapists, but to make them more effective,\" saidMichael Palys, co-founder and president of Colleva. \"It's been wonderful working in partnership with the Fort Health team as they share our collective vision of using AI role plays and simulations to enhance human skills in areas like mental health where these skills are so critically important to successful patient outcomes. The ability to offer personalized 1:1 feedback at scale is a game changer. My father's own career in psychiatry has made this particular project very special to me, and it's been wonderful to see the excitement among practitioners.\"\n\n\"As a therapist, I know how challenging it can be to translate the professional training we receive into real life interactions with children and families. I also know how uncomfortable and anxiety provoking it can be for a therapist to participate in role plays or live observations. Having a private, safe space to fumble and trip as you sharpen your skill set is a game changer for most therapists,\" saidLindsay Henderson, PsyD, founding clinical director, Fort Health. \"Utilizing AI simulations as a training platform to increase therapist's ability to deliver EBT at a higher fidelity will be key to solving for our nation's youth mental health needs.\"\n\n\"What a unique training opportunity! It allows me to practice and improve my clinical skills in a way I've never before experienced. I love getting immediate feedback which I can implement in real time,\" said Licensed Professional Counselor Catherine Murray.\n\nAbout Fort Health\n\nFounded in 2022, Fort Health is a specialty outpatient pediatric mental health provider. Fort Health transforms how children and adolescents, ages 4-24, receive mental health care by seamlessly partnering with pediatricians to provide evidence-based therapy, psychiatry, and parent coaching – all covered by insurance. Fort Health was built in partnership with the Child Mind Institute, an independent non-profit dedicated to transforming the lives of children and families struggling with mental health, mental illness and learning disorders. The company operates inNew Jersey,New York,Pennsylvania, andTexasandIllinois. VisitFort Healthon our website and onLinkedIn.\n\nAbout Colleva\n\nFounded in 2023, Colleva is an AI-powered enterprise talent platform that can help professionals enhance both hard and soft skills through personalized, scalable 1:1 feedback. Using AI avatars to provide AI roleplay and simulation-based training, Colleva provides immersive practice environments where professionals master critical interactions with immediate feedback. Colleva offers solutions across talent acquisition, onboarding, learning & development, performance management, and employee insights for organizations within healthcare, financial services, as well as other sectors. Headquartered inGreenwich, Connecticut, Colleva is transforming workforces through innovative AI solutions. Visit Colleva on our website and on LinkedIn.\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role-playing-practice-and-scalable-client-care-302402020.html\n\nSOURCE Fort Health",
    "extraction_status": "success"
  },
  "https://pharmaphorum.com/news/healthee-heads-latest-crop-digital-health-financings_Healthee heads latest crop of digital health financings": {
    "company": "BrainCheck",
    "title": "Healthee heads latest crop of digital health financings",
    "url": "https://pharmaphorum.com/news/healthee-heads-latest-crop-digital-health-financings",
    "source": "pharmaphorum",
    "body": "BrainCheck has raised $15 million that will ... according to the Austin, Texas-based company, which said it would help accelerate the rollout of the new version. Finally, analytics company Redi ...",
    "date": "2025-03-26",
    "full_content": "Our latest round-up of funding rounds in the digital health category features updates from Healthee, Aktiia, Moxe Health, Eleanor Health, Tava Health, BrainCheck, and Redi Health.\n\nHealtheehas raised $32 million in a Series A that will be used to scale up its operations, which are focused on a platform that provides a digital conduit between employees and their health plans. It answers questions about coverage, treatment, and benefits, provides advice on preventative care, and helps employers with the enrolment process.\n\nThe round was co-led by Fin Capital, Glilot Capital Partners, and Group11, with strategic partner TriNet also taking part. It will also be used for product development, according to the Israeli company, which was formed in 2018.\n\nSwitzerland’sAktiiahas raised CHF 27 million ($30 million) from investors including Redalpine and Khosla Ventures for the rollout and development of its wearable wristband device, which uses photoplethysmography technology to provide continuous blood pressure monitoring over a 24-hour period by detecting blood volume changes in small blood vessels.\n\nThe device is already approved in 44 countries and available in Switzerland, Germany, France, Austria, Italy, the UK, and the Republic of Ireland, and have been used in more than 60,000 patients. Aktiia will use the new funding in part to fund an expansion into the US market.\n\nHealthcare data exchange specialistMoxe Healthhas raised $25 million from investor Trinity Capital to support the development of its technology platform, used for the secure exchange of clinical and other sensitive data between healthcare payers and providers.\n\nIt is designed to provide a solution to the current problem of health data being in different formats and silos, with the aim of reducing administrative waste, relieving pressure on healthcare staff, eliminating duplicative efforts, and ultimately lowering costs. The latest cash infusion follows a $30 million second round in 2022 and a $5.5 million Series A for the Madison, Wisconsin-based company.\n\nEleanor Health, a company providing digital and face-to-face support for people struggling with substance use disorders (SUDs) and their families, has raised $22 million in an equity raise, according to a filing with the Securities and Exchange Commission (SEC).\n\nThe Massachusetts-based start-up – which recently saw founding CEO Corbin Petro step down and be replaced by William McKinney – offers personalised addiction treatment either virtually or in person through a series of clinics in six US states. The latest round comes after it raised $50 million in Series C funding in 2022 and takes the total raised to date above the $100 million mark.\n\nNew York-basedTava Healthhas closed a $20 million Series B led by Catalyst Investors and featuring existing investors Peterson Partners, Toba Capital, and SpringTide, along with new backer Blue Heron Capital.\n\nThe company provides a telemedicine platform focused on mental health, connecting patients to therapists and supporting healthcare providers with practice management software, electronic medical records, and interactions with employers and health insurance companies. It said the new money would be used for product development, expansion of its provider network, and fostering new agreements with payers.\n\nBrainCheckhas raised $15 million that will be used to fuel the expansion and take-up of a recently launched update to its BrainCheck Screen digital cognitive assessment and care planning software for people with dementia. The app allows testing to be carried out on any internet-connect device and delivers an initial assessment in three minutes.\n\nThe financing round was led by Next Coast Ventures, S3 Ventures, and UPMC Enterprises, according to the Austin, Texas-based company, which said it would help accelerate the rollout of the new version.\n\nFinally, analytics companyRedi Healthhas closed a $14 million second round led by Blue Heron Capital that will be used to develop and expand its digital patient support programme (PSP) for people suffering from chronic health conditions.\n\nThe Columbus, Ohio start-up provides a number of services to its customers, including an app that tracks medications, symptoms, diet, and weight, and allows them to communicate and share progress with healthcare providers and link to other pertinent organisations, like drugmakers, pharmacies, and payers. It was founded in 2022, raising just under $4 million in a first round in 2022.",
    "extraction_status": "success"
  },
  "https://www.victoriaadvocate.com/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role/article_1aabcc2c-daf6-58b1-a558-b960053187f5.html_Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care": {
    "company": "Fort Health",
    "title": "Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care",
    "url": "https://www.victoriaadvocate.com/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role/article_1aabcc2c-daf6-58b1-a558-b960053187f5.html",
    "source": "The Victoria Advocate",
    "body": "Using Fort Health's agentic AI training platform - which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers - therapists ...",
    "date": "2025-03-18",
    "full_content": "Opening more paths to better care for more families and their children (PRNewsfoto/Fort Health)\n\nAgentic AI Custom Training Scenarios Result in 83% of Clinicians Feeling More Prepared and 95% Able to Apply What They Have Learned\n\nNEW YORK,March 18, 2025/PRNewswire/ -- The high stakes nature of youth mental health therapy requires thorough preparation and applied evidence-based skills. Today,Fort Health, a specialty outpatient pediatric mental health provider, announced that it has partnered withCollevato train its therapists with AI avatar-led, face-to-face simulations. By providing highly relevant and engaging customized scenarios, Fort Health is able to rapidly upskill its therapists using evidence-based therapeutic protocols, ultimately leading to improved client care and operational efficiency. The initial series of custom training scenarios resulted in 83% of clinicians feeling more prepared and 95% able to apply what they have learned.\n\nAbody of researchfrom the National Institute of Medicine shows that current efforts to train clinicians in empirically-based treatments (EBTs) face significant challenges, as they typically provide only didactic training with no examination of applied skills, follow-up support, or implementation feedback. Studies emphasize the importance of role-play skill practice and ongoing expert guidance to ensure clinicians maintain high fidelity to EBT protocols and deliver effective interventions to patients. Compounded by thebehavioral health care workforce shortage,these limitations underscore the need for innovative training approaches to address challenges in a cost-effective and scalable manner.\n\n\"AI-powered avatar simulations are revolutionizing therapist training by enabling immersive, risk-free practice of critical decision-making and patient interactions,\" saidNatalie Schneider, founding CEO of Fort Health. \"Colleva's AI coaching platform empowers us to design tailored, dynamic scenarios that mirror real-world challenges, providing therapists with hands-on experience in applying evidence-based treatment protocols. By leveraging AI patient avatars, we are transforming mental health training—making it more proactive, personalized, and scalable to meet the growing demand for high-quality care.\"\n\nHow it Works\n\nUsing Fort Health's agentic AI training platform – which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers – therapists conduct realistic role plays with custom avatars and receive personalized feedback to identify areas for improvement and highlight strengths. The series of interactive scenarios are a safe space to practice and develop therapeutic techniques. To help therapists build and demonstrate their proficiency, there are three scenarios representative of the patient population that Fort Health treats. Each of the scenario's avatars have six personalities to choose from, allowing for more realistic and varied practice. Each custom simulation uses generative AI to analyze both content and delivery. Personalized feedback is based on specific EBT objectives and CBT competency frameworks. Therapists are also provided instant feedback on soft skill competencies important to successful therapy outcomes.\n\n\"We are harnessing AI not to replace human therapists, but to make them more effective,\" saidMichael Palys, co-founder and president of Colleva. \"It's been wonderful working in partnership with the Fort Health team as they share our collective vision of using AI role plays and simulations to enhance human skills in areas like mental health where these skills are so critically important to successful patient outcomes. The ability to offer personalized 1:1 feedback at scale is a game changer. My father's own career in psychiatry has made this particular project very special to me, and it's been wonderful to see the excitement among practitioners.\"\n\n\"As a therapist, I know how challenging it can be to translate the professional training we receive into real life interactions with children and families. I also know how uncomfortable and anxiety provoking it can be for a therapist to participate in role plays or live observations. Having a private, safe space to fumble and trip as you sharpen your skill set is a game changer for most therapists,\" saidLindsay Henderson, PsyD, founding clinical director, Fort Health. \"Utilizing AI simulations as a training platform to increase therapist's ability to deliver EBT at a higher fidelity will be key to solving for our nation's youth mental health needs.\"\n\n\"What a unique training opportunity! It allows me to practice and improve my clinical skills in a way I've never before experienced. I love getting immediate feedback which I can implement in real time,\" said Licensed Professional Counselor Catherine Murray.\n\nAbout Fort Health\n\nFounded in 2022, Fort Health is a specialty outpatient pediatric mental health provider. Fort Health transforms how children and adolescents, ages 4-24, receive mental health care by seamlessly partnering with pediatricians to provide evidence-based therapy, psychiatry, and parent coaching – all covered by insurance. Fort Health was built in partnership with the Child Mind Institute, an independent non-profit dedicated to transforming the lives of children and families struggling with mental health, mental illness and learning disorders. The company operates inNew Jersey,New York,Pennsylvania, andTexasandIllinois. VisitFort Healthon our website and onLinkedIn.\n\nAbout Colleva\n\nFounded in 2023, Colleva is an AI-powered enterprise talent platform that can help professionals enhance both hard and soft skills through personalized, scalable 1:1 feedback. Using AI avatars to provide AI roleplay and simulation-based training, Colleva provides immersive practice environments where professionals master critical interactions with immediate feedback. Colleva offers solutions across talent acquisition, onboarding, learning & development, performance management, and employee insights for organizations within healthcare, financial services, as well as other sectors. Headquartered inGreenwich, Connecticut, Colleva is transforming workforces through innovative AI solutions. Visit Colleva on our website and on LinkedIn.\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role-playing-practice-and-scalable-client-care-302402020.html\n\nSOURCE Fort Health\n\nOriginally published on theBLOX Digital Content Exchange.",
    "extraction_status": "success"
  },
  "https://www.businessinsider.com/artificial-intelligence-technology-sustainable-textile-recycling-solutions-2024-6_'What are your clothes made of?' is a deceptively difficult question. AI can help answer it.": {
    "company": "Refiberd",
    "title": "'What are your clothes made of?' is a deceptively difficult question. AI can help answer it.",
    "url": "https://www.businessinsider.com/artificial-intelligence-technology-sustainable-textile-recycling-solutions-2024-6",
    "source": "Business Insider",
    "body": "AI can help enhance garment-sorting accuracy in the fashion industry. The company Refiberd uses AI and sensors to identify recyclable textiles that can be repurposed. This article is part of ...",
    "date": "2024-06-03",
    "full_content": "For decades, thefashion industry has had an unlimited-growth mindset, fueled by cheap production and opacity. Even a seemingly simple question like \"What are your clothes made of?\" can flummox brands because fashion supply chains are so lengthy and far-flung.\n\nIt doesn't have to be this way, and AI could become a major force for a more sustainable industry.\n\nIn the past few years, brands have been accused of mislabeling their garments'fabric compositionandcountry of origin. A study conducted in the Netherlands involving about 7,000 garments found that41% of the garmentshad been mislabeled. Mislabeling poses an issue not just for curious consumers but for textile recyclers, who need to know exactly which fabrics they're dealing with in order to process them effectively.\n\nRecycling technologieshave improved over the past few decades, but vast piles of clothes need to be sorted first. This can be hard for workers to do accurately, and errors can be costly.\n\nWith their backgrounds intextile engineeringand AI, Sarika Bajaj and Tushita Gupta, the cofounders of Refiberd, spotted this accuracy problem in the late 2010s and understood that AI could help solve it.\n\nTo identify textiles, Refiberd uses AI and a sensor called a hyperspectral camera. \"It's almost like a video camera which pulls out near-infrared data,\" Bajaj told Business Insider. \"Light gets reflected onto our sensor, and that tells us what materials we're dealing with. What you end up with are spectra, graphs that tell you there's an extra 1% here of elastane or an extra 2% there of cotton.\"\n\nRefiberd tech uses a regression-based model, which estimates fabric composition and is more precise than a classification model that sorts materials into broad categories.\n\nBajaj said the regression-based model works with the help of a materials library made up of \"thousands upon thousands of samples,\" allowing Refiberd to \"detect textile material composition within 2% of the actual material composition.\"\n\nTo understand how we got here, it's worth breaking down exactly how fast fashion — the leading cause of the industry'stextile-waste problem— is made. Bajaj described the bulk of consumer-bought clothes as a \"notorious mix of blends and contaminants\" often manufactured in various factories worldwide.\n\n\"What we have found is that there's variability at every stage of the process,\" she said.\n\n\"We might see a garment made of organic cotton and think, 'Organic, amazing,'\" Bajaj added. \"Yet the process of dying organic, virgin cotton at a certain level just makes it a plastic.\"\n\nSynthetic dyesin garments require enormous amounts of water and contain contaminants. \"At what point do we still call this pure?\" Bajaj said. \"Then that garment might be sent off to a different factory for cut and sew, but those workers added polyester thread everywhere, and none of that has been accounted for on the label.\"\n\nA lack of regulation in the fashion industry meanscreative solutions are neededto tackle the problem. Leading in this field is the Hong Kong Research Institute of Textiles and Apparel, or HKRITA, known for its sustainability-focused tech.\n\nIn addition to asmart garment-sorting system— which also uses hyperspectral cameras — HKRITA has several innovations designed to address what its CEO, Edwin Keh, sees as a deeper-rooted issue in the fashion industry: a refusal to consider product lifespan.\n\n\"There's a lack of thoughtfulness about reuse and second use,\" Keh said.\n\nHe said that whilealuminum beverage cans' high recycling ratescould be attributed partly to their use of a single material, the fashion industry's reliance on material blending to cut costs had complicated recycling. \"We use all sorts of blends and coatings,\" Keh said, \"because we just didn't think about second use.\"\n\nKeh described garment sorting as the \"big bottleneck,\" given how manual it is. But there are other remedies. HKRITA's projects include an AI-powered mechanical recycling system designed to identify reusable indigo-dyed warp yarns in denim and separate them from nonrecyclable synthetic yarns.\n\nBoth Refiberd and HKRITA have received cash awards from the H&M Foundation, a nonprofit funded by the founders of the H&M Group. The foundation, which says it aims to create a more \"socially inclusive and planet positive textile industry,\" has partnered with HKRITA on a program calledPlanet First.\n\nThe novelty of such innovations means securing investment can be a challenge. \"As a philanthropic organization, we can support these ideas when they're at a very critical stage and need funding to further develop, but they're too early for many investors,\" Anna Gedda, the global manager of the H&M Foundation, told BI. \"We can absorb that risk and support them to develop and scale.\"\n\nThe necessity of these solutions can't be underestimated.Tons of unwanted clothesare sent to landfills daily, and tons more are sold to traders who sort through clothes to find items of value and discard the rest. Rejected items aredumped out of sight, often in countries like Ghana, whose secondhand-clothes dealers havetaken a stand against this practice, or in remote locations like Chile's Atacama Desert, recently dubbedfast fashion's great garbage patch.",
    "extraction_status": "success"
  },
  "https://www.wbbjtv.com/2025/04/30/inventor-author-and-entrepreneur-dr-cori-lathan-visits-ut-martin/_Inventor, author, and entrepreneur Dr. Cori Lathan visits UT Martin": {
    "company": "De Oro Devices",
    "title": "Inventor, author, and entrepreneur Dr. Cori Lathan visits UT Martin",
    "url": "https://www.wbbjtv.com/2025/04/30/inventor-author-and-entrepreneur-dr-cori-lathan-visits-ut-martin/",
    "source": "WBBJ-TV",
    "body": "Dr. Cori Lathan, the chief executive officer of De Oro Devices and co-founder of AnthroTronix Inc., was the guest speaker at a College of Engineering and Natural Sciences STEMinar held April 22.",
    "date": "2025-04-30",
    "full_content": "MARTIN, Tenn. – Dr. Cori Lathan, the chief executive officer of De Oro Devices and co-founder of AnthroTronix Inc., was the guest speaker at a College of Engineering and Natural Sciences STEMinar held April 22.\n\nLathan has a Ph.D. in neuroscience from the Massachusetts Institute of Technology, along with degrees in aeronautics, astronautics, biopsychology and mathematics.\n\nHer work has been featured in Forbes, Time, The New Yorker and TEDx. She has been named Maryland’s Top Innovator of the Year, one of MIT Technology Review’s “Top 100 World Innovators.” The STEMinar featured a Q&amp;A session with Lathan that included students of Dr. Ashley Owens, assistant professor of engineering, and Women in STEM students and faculty.\n\nLathan also spent the morning touring the campus and its science facilities, laboratories and classrooms.\n\nThe term “STEM” – short for “Science, Technology, Engineering and Mathematics” – encompasses a broad range of academic disciplines and career pathways in those fields.\n\nIn introducing Lathan to the audience, UT Martin Provost and Senior Vice Chancellor for Academic Affairs Dr. Philip Cavalier – who attended Swarthmore College with Lathan – told students that she is not focused in just one area.\n\n“I think that’s important,” he said. “I know all of you are learning specific areas of your major, and that’s important and fantastic. But, to get to the point where you’re an innovator and the CEO of a company and a faculty member and highly recognized, a big part of that is because Cori is interested in a wide range of things, curious about the world.”\n\nLathan founded a research and development company, AnthroTronix, which she ran for 20 years and still serves as a board member.\n\n“Biomedical engineering didn’t exist as a degree going through college,” she said. “That’s probably what I would have majored in now, but instead, I took lots of math and neuroscience and psychology and aerospace engineering.”\n\nLathan’s work has ranged from developing robots that assist children with disabilities to creating virtual reality environments for astronauts aboard the space station.\n\nLathan has also contributed to the development of wearable sensor technology and mobile medical applications for military personnel and clinicians.\n\nHer latest book, “Inventing the Future: Stories from a Techno-Optimist,” chronicles her decades- long journey in leveraging technology to improve the world.\n\nDr. Lily Pharris, assistant professor of computer science, was among the UT Martin faculty members to host Lathan on her visit to campus.\n\n“Having Dr. Cori Lathan visit UT Martin was an inspiring experience, especially for students pursuing careers in STEM fields,” she said. “Not too long ago, Dr. Lathan was sitting in a seat just like theirs — full of ambition, ideas and a desire to make a difference. Today, she stands as a powerful example of where following your passions, dreams and heart can lead.\n\n“Through her work as an inventor, entrepreneur and advocate for inclusive technology, Dr. Lathan showed our students that innovation isn’t just about building the future; it’s about shaping it with empathy, creativity and perseverance. I hope her story leaves a lasting impression, inspiring students to see themselves as the next generation ready to take up the torch and lead us toward an optimistic future.”\n\nMore information about Dr. Cori Lathan can be found at her website, inventthefuture.tech.\n\nFor more local news,click here.",
    "extraction_status": "success"
  },
  "https://markets.businessinsider.com/news/stocks/ebay-invests-300-000-into-refiberd-1034567148_eBay invests $300,000 into Refiberd": {
    "company": "Refiberd",
    "title": "eBay invests $300,000 into Refiberd",
    "url": "https://markets.businessinsider.com/news/stocks/ebay-invests-300-000-into-refiberd-1034567148",
    "source": "Business Insider",
    "body": "eBay (EBAY) investing $300,000 into Refiberd in its ongoing efforts to support fashion startups to scale circular solutions through its global Circular Fashion Fund program. This funding is aimed ...",
    "date": "2025-04-09",
    "full_content": "eBay (EBAY) investing $300,000 into Refiberd in its ongoing efforts to support fashion startups to scale circular solutions through its global Circular Fashion Fund program. This funding is aimed to scale the impact of Refiberd’s cutting-edgeAIsystem that can discern exactly what different fabrics are made of, allowing them to be accurately sorted and recycled. Their technology can be integrated into existing recycling infrastructures to sort materials and ensure they’re processed using the right methods-helping recyclers turn textile waste into new, usable fibers. By enabling more efficient recycling, Refiberd aims to tackle the industry’s waste-sorting dilemma and drive true circularity in fashion.\n\nPublished first onTheFly– the ultimate source for real-time, market-moving breaking financial news.Try Now>>\n\nSee the top stocks recommended by analysts >>\n\nRead More on EBAY:\n\nDisclaimer & DisclosureReport an Issue",
    "extraction_status": "success"
  },
  "https://www.undercurrentnews.com/2025/05/01/mikel-durham-out-as-interim-ceo-as-us-kelp-farmer-atlantic-sea-farms-downsizes/_Mikel Durham out as interim CEO as US kelp farmer Atlantic Sea Farms downsizes": {
    "company": "Atlantic Sea Farms",
    "title": "Mikel Durham out as interim CEO as US kelp farmer Atlantic Sea Farms downsizes",
    "url": "https://www.undercurrentnews.com/2025/05/01/mikel-durham-out-as-interim-ceo-as-us-kelp-farmer-atlantic-sea-farms-downsizes/",
    "source": "Undercurrent News",
    "body": "Kiera Foti, a brand manager with Atlantic Sea Farms, announced on LinkedIn that she was laid off as the Maine-based kelp producer is 'scaling back and restructuring'",
    "date": "2025-05-01",
    "full_content": "Kiera Foti, a brand manager with Atlantic Sea Farms, announced on LinkedIn that she was laid off as the Maine-based kelp producer is 'scaling back and restructuring'\n\nMikel Durham, a board member of US kelp producer Atlantic Sea Farms and its recently appointed interim CEO, is no longer with the company as it undergoes downsizing [...]\n\nSign up for a trial to have access to our articles!\n\nWe’ve sent a link toto change your password.\n\nPlease check your inbox to reset your password securely and easily.\n\nContact the author[email protected]\n\nGet recommendations, data, editor’s picks, and the latest news from around the seafood world straight to your inbox.\n\nWill be used in accordance with ourPrivacy Policy",
    "extraction_status": "success"
  },
  "https://www.yahoo.com/lifestyle/ebay-circular-fashion-fund-crowns-142425945.html_EBay's Circular Fashion Fund Crowns Refiberd Its First Circular Fashion Innovator of the Year": {
    "company": "Refiberd",
    "title": "EBay's Circular Fashion Fund Crowns Refiberd Its First Circular Fashion Innovator of the Year",
    "url": "https://www.yahoo.com/lifestyle/ebay-circular-fashion-fund-crowns-142425945.html",
    "source": "Yahoo",
    "body": "EBay's Circular Fashion Fund has officially announced Refiberd as its Circular Fashion Innovator of the Year awarding the company with an investment of $300,000. The company's discerning AI ...",
    "date": "2025-04-09",
    "full_content": "EBay’s Circular Fashion Fund has officially announced Refiberd as its Circular Fashion Innovator of the Year awarding the company with an investment of $300,000. The company’s discerning AI solution aims to tackle the fashion industry’s waste problem head-on by making it easier than ever to reuse fibers.\n\nWhile Refiberd represents the first to win the award, the program stems from a larger mission to invest in tools andtechnologythat fuel the circular economy and help drive the fashion industry to a more sustainable future. As a leader in the secondary marketplace, eBay partnered with the British Fashion Council, Council of Fashion Designers of America, Fashion Council Germany and Australia Fashion Council to recognize the innovators driving this sustainable change to provide not only capital but access and visibility to propel growth.\n\nMore from WWD\n\nFaherty Expands 'Second Wave' Resale Program With Mail-in Option\n\nHow Tapestry Drives Adaptable Digital Journeys With Technology\n\nEXCLUSIVE: Salma Hayek Pinault Is Merz Aesthetics' First Global Ambassador for Ultrasound Treatment Ultherapy Prime\n\n“As the pioneering secondary marketplace,eBayhas been driving circularity in fashion since its inception 30 years ago,” saidAlexis Hoopes, vice president, and global head of fashion at eBay. “It’s a critical time for the fashion industry, and eBay’s Circular Fashion Fund — and the eBay platform at large — are propelling the industry forward, enabling innovative ideas to help shape brand and consumer behaviors.”\n\nDesigned to support start-ups to scale circular solutions from production to end of life, the Circular Fashion Fund’s search for Innovator of the Year looked across the U.K., U.S., Germany and Australia, shortlisting 12 companies that were recognized as pioneers in circular fashion. These finalists were chosen by a judging panel of industry experts within the fields of fashion, academia andsustainability.\n\nAs this year’s winner, Refiberd will use the funding to scale the impact of its intelligent sorting solution for textile-to-textile recycling AI system. The company’s mission tackles the industry’s waste-sorting problem to drive true circularity in fashion.\n\nAccording to the company, the technology “can be integrated into existing recycling infrastructures to sort materials and ensure they’re processed using the right methods.” In practice, this will help recyclers turn textile waste into new, usable fibers.\n\n“The investment from eBay Ventures will help us close a significant round of fundraising for the business, allowing us to expand our technology to new recycling partners, strengthen our AI capabilities and move faster toward our mission of enabling true textile-to-textile recycling,” said Sarika Bajaj, cofounder and chief executive officer of Refiberd. “The journey for a startup is tough, so having the mentorship and access to eBay and the CFDA’s networks has already proven invaluable. With this added support we can accelerate our impact and help build a future where circular fashion is the norm — not the exception.”\n\nEBay continues to champion re-commerce through its Circular Fashion Fund and champion the increased appetite for circular fashion. Notably, the company’s research revealed that 66 percent of Gen Z say that purchasing pre-loved fashion has grown in personal importance.\n\nSince its launch in 2022, the fund has supported 27 businesses and provided more than 200 hours of mentoring and upskilling from industry experts with a total investment of $1.2 million.\n\nBest of WWD\n\nThe Definitive Timeline for Sean 'Diddy' Combs' Sean John Fashion Brand: Lawsuits, Runway Shows and Who Owns It Now\n\nWhat the Highest-paid CEOs at U.S. Fashion and Retail Companies Make\n\nConfidence Holds Up, But How Much Can Consumers Take?\n\nSign up forWWD's Newsletter. For the latest news, follow us onFacebook,Twitter, andInstagram.",
    "extraction_status": "success"
  },
  "https://specialtyfabricsreview.com/2025/05/13/refiberd/_eBay invests $300k in Refiberd to drive circular fashion solutions": {
    "company": "Refiberd",
    "title": "eBay invests $300k in Refiberd to drive circular fashion solutions",
    "url": "https://specialtyfabricsreview.com/2025/05/13/refiberd/",
    "source": "Specialty Fabrics Review",
    "body": "Bay is investing $300,000 into Refiberd in its ongoing efforts to support fashion startups through its global Circular Fashion Fund program.",
    "date": "2025-05-13",
    "full_content": "Company News,News| May 13, 2025 | By:ATA\n\neBay announced that the company is investing $300,000 intoRefiberdin its ongoing efforts to support fashion startups to scale circular solutions through its global Circular Fashion Fund program.\n\nRefiberd was announced the winner of eBay’s Circular Fashion Innovator of the Year Award, which saw 12 shortlisted businesses across the U.K., U.S., Germany and Australia rewarded for their work in pioneering a more circular fashion industry.\n\nThis funding is aimed to scale the impact of Refiberd’s cutting-edge artificial intelligence (AI) system that can discern exactly what different fabrics are made of, allowing them to be accurately sorted and recycled. Their technology can be integrated into existing recycling infrastructures to sort materials and ensure they’re processed using the right methods, helping recyclers turn textile waste into new, usable fibers.\n\nSince the Circular Fashion Fund’s launch in 2022, it has supported 27 businesses and by the end of 2025 will have invested a total of $1.2 million alongside over 200 hours of mentoring from industry experts. In partnership with the fashion industry’s foremost councils—BFC, CFDA, FCG and AFC—eBay gives recipients access and visibility into the industry.\n\n“We’re honored to win eBay’s first Circular Fashion Innovator of the Year Award. The investment from eBay Ventures will help us close a significant round of fundraising for the business, allowing us to expand our technology to new recycling partners, strengthen our AI capabilities, and move faster toward our mission of enabling true textile-to-textile recycling. The journey for a startup is tough, so having the mentorship and access to eBay and the CFDA’s networks has already proven invaluable. With this added support we can accelerate our impact and help build a future where circular fashion is the norm—not the exception,” says Sarika Bajaj, co-founder and CEO of Refiberd.\n\n“As the pioneering secondary marketplace, eBay has been driving circularity in fashion since its inception 30 years ago,” says Alexis Hoopes, vice president and global head of fashion at eBay.“It’s a critical time for the fashion industry, and eBay’s Circular Fashion Fund—and the eBay platform at large—are propelling the industry forward, enabling innovative ideas to help shape brand and consumer behaviors.”\n\nCountry finalists includedSOJOin the U.K., which makes repairs easy with door-to-door service to keep clothes in use longer;MOOT(Made Out of Trash) in Germany, which offers a comprehensive upcycling plug-in to enable brands to seamlessly integrate scalable upcycling solutions; andShopfrontin Australia, which uses AI to streamline the fashion resale process across multiple marketplaces simplifying the clothing resale process. Finalists each received grants starting at $50,000 in their respective local currencies.\n\nThe winners were chosen by a judging panel of industry experts across fashion, academia and sustainability.\n\nEach of the four country finalists went on to a judging process with eBay’s venture capital arm, eBay Ventures, which saw Refiberd crowned as the overall Circular Fashion Innovator of the Year, winning the $300,000 investment prize.\n\nShare this Story\n\nEPA extends reporting period for PFAS manufacturers\n\nU.S. and U.K. announce trade deal, modifying tariffs\n\nU.S. and China agree to lower tariffs on imports for 90 days\n\nOEKO-TEX® MADE IN GREEN marks a decade as a global sustainability label\n\nKBR partners with Samsara Eco to design new enzymatic recycling plant\n\nKimberly-Clark investing $200 million, adding 150+ jobs in S.C. expansion",
    "extraction_status": "success"
  },
  "https://markets.businessinsider.com/news/stocks/braincheck-raises-another-1-5-million-to-bring-artificial-intelligence-to-dementia-care-1027831188_Braincheck Raises Another $1.5 Million to Bring Artificial Intelligence to Dementia Care": {
    "company": "BrainCheck",
    "title": "Braincheck Raises Another $1.5 Million to Bring Artificial Intelligence to Dementia Care",
    "url": "https://markets.businessinsider.com/news/stocks/braincheck-raises-another-1-5-million-to-bring-artificial-intelligence-to-dementia-care-1027831188",
    "source": "Business Insider",
    "body": "HOUSTON, Jan. 03, 2019 /PRNewswire-PRWeb/ -- BrainCheck, a Texas-based digital neurocognitive testing platform, has raised $1.5 million in additional capital to bring AI and personalized medicine ...",
    "date": "2018-12-24",
    "full_content": "HOUSTON,Jan. 03, 2019/PRNewswire-PRWeb/ --BrainCheck, aTexas-based digital neurocognitive testing platform, has raised$1.5 millionin additional capital to bring AI and personalized medicine to dementia care through its cognitive care management technology, BrainCheck Care, which launched inJuly 2018. Funding, led byTrue Wealth Ventures, with participation fromTensility Venture Partners,XFactor Ventures,S3 Venturesand angel investors, brings the total funding to$6 millionto date.\n\nBorn at the Eagleman Neuroscience Laboratory atBaylor College of Medicine(now atStanford), BrainCheck enables physicians to rapidly and accurately assess cognitive function and deliver cognitive care at scale. The platform is currently used by hundreds of clinical practices and over 40,000 individuals and is growing rapidly. As first to market with an end-to-end cognitive health solution, BrainCheck is well-positioned to change millions of lives by providing a much-needed and promising solution to the \"silver tsunami.\"\n\nThere are5.7 million people suffering with dementiain the U.S. today, according to the Alzheimer's Association. The cost to healthcare organizations is 50 percent greater than cancer or heart disease. But new research from The Lancet Commission shows that one-third of dementia is preventable, and disease progression can be slowed through effective detection and addressing modifiable risk factors. As digital medicine continues to transform patient care, BrainCheck occupies a unique position to meet the needs of the dementia market.\n\nThrough a combination of assessments, screeners, workflows and clinical decision support algorithms, BrainCheck Care enables physicians to provide a detailed, personalized care plan to the patient and caregiver at the point of care.\n\n\"BrainCheck's rich and robust dataset on cognitive health, paired with other health and biometric data, enable us to personalize dementia care at scale,\" saidDr.Yael Katz, co-founder and CEO of BrainCheck. \"For the first time, clinicians and caregivers can observe whether interventions are working by tracing cognitive change to a patient's medications, chronic diseases, or lifestyle, and iterate on these interventions to optimize outcomes.\"\n\nChicago-based Tensility Venture Partners focuses its investments on enterprise AI companies. \"We saw a great opportunity with BrainCheck,\" saidArmando Pauker, managing director and co-founder at Tensility Venture Partners. \"They're sitting on a treasure trove of difficult-to-obtain data and are addressing a large market opportunity. They bring the power and benefits of AI into clinical care to make cognitive testing easily available to all.\"\n\n\"The research is clear and it has now been clinically proven that patients can delay the onset of dementia,\" saidCharlie Plauche, partner at S3 Ventures. \"By helping physicians detect this debilitating disease early, BrainCheck's platform technology will improve the lives of millions in the coming years.\"\n\nHeadquartered at the Texas Medical Center Innovation Institute, TMCx, BrainCheck has recently opened a second office inAustin, Texas. The funding will be used to expand the company's R&D and enhance its offering that is truly moving the needle in the dementia space. The company is also investing in sales and marketing talent to accelerate deployment in clinical practice.\n\nAbout BrainCheckBrainCheck provides rapid, mobile cognitive assessment and decision support technology to physicians, empowering them to deliver high-quality, personalized cognitive health care to patients everywhere and get reimbursed. This helps patients live better and safer lives at home, decreases caregiver frustration, and saves health systems trillions. Founded in 2015 by neuroscientists and technologistsDr.David Eagleman(Baylor College of Medicine/Stanford) andDr.Yael Katz, BrainCheck helps lessen the human and economic toll of cognitive impairment and dementia through its interactive cognitive assessment and care management technology. BrainCheck is used around the world to detect cognitive changes early and enable patients, caregivers, and clinicians to work together to implement personalized recommendations to preserve brain health and functional independence. BrainCheck enables physicians to get paid for cognitive care management (via Medicare reimbursement) and simultaneously reduces healthcare costs by keeping patients healthy, safe, and out of the hospital.\n\nTo learn more, please visithttp://www.braincheck.com.\n\nSOURCE  BrainCheck",
    "extraction_status": "success"
  },
  "https://techcrunch.com/2021/11/03/braincheck-brings-in-another-10m-to-detect-manage-cognitive-impairment/_BrainCheck brings in another $10M to detect, manage cognitive impairment": {
    "company": "BrainCheck",
    "title": "BrainCheck brings in another $10M to detect, manage cognitive impairment",
    "url": "https://techcrunch.com/2021/11/03/braincheck-brings-in-another-10m-to-detect-manage-cognitive-impairment/",
    "source": "TechCrunch",
    "body": "BrainCheck, a Houston- and Austin-based company developing cognitive healthcare software to aid physicians in detecting and managing this type of care, raised $10 million in Series B funding to ...",
    "date": "2021-11-03",
    "full_content": "As the world’s population ages, more is being learned about brain health as startups leverage technology to find a way to slow down cognitive impairment.\n\nBrainCheck, a Houston- and Austin-based company developing cognitive healthcare software to aid physicians in detecting and managing this type of care, raised $10 million in Series B funding to expand its R&D and go-to-market capabilities as it works on new digital therapeutics for Alzheimer’s and related dementias.\n\nThe round was led by Next Coast Ventures and S3 Ventures, which were joined by Nueterra Capital, Tensility Ventures and True Wealth Ventures. In addition, UPMC Enterprises and SelectQuote came on as strategic investors. The latest funding gives the company roughly $21 million in total funding raised to date, which includes a$3 million seed roundin 2016 and$8 million in Series A fundingfrom 2019.\n\nThis startup just raised $8 million to help busy doctors assess the cognitive health of 50 million seniors\n\nBrainCheck’s technology acts as a bridge between patients and the limited number of neurologists, about 12,000, in the U.S. Through 10- to 15-minute tests, performed in-person or remote (via a smartphone, tablet or computer), cognitive function can be detected early and more accurately.\n\nBased on the test, patients are assigned a Cognitive Quotient (CQ) score, which is then used to produce a personalized cognitive care plan within minutes. Over 400 neurology, primary care and geriatrics practices use the technology currently, including Mount Sinai clinicians, which are using it to track and manage cognitive impairment resulting from COVID-19.\n\nThe pandemic has changed everything across the healthcare ecosystem, Yael Katz, PhD, co-founder and CEO of BrainCheck, told TechCrunch via email.\n\nThe company always had it in mind to raise another round two years after its Series A, but Katz said the global pandemic gave them pause to see how it would impact that decision. However, due to COVID shining a light on how people perceive healthcare and became more comfortable with remote care, they saw an opportunity to continue.\n\nThe new funding will enable the company to continue to grow its team and invest in R&D. It already has several new initiatives in the works to close the loop with the patient journey that will be brought to market soon, she added.\n\nOver the last year, BrainCheck experienced year over year revenue growth increase three times, and Katz expects the same trajectory for next year. With the Series B, the goal remains the same as it was two years ago — double down on growth.\n\n“From the shift to remote work and an increased prioritization of mental health, to investing in preventive medicine and supporting the aging population, all of these factors have come together to make the case that what we’re doing matters, and will continue to matter,” she said. “It’s never been more important for physicians to invest in a tool like BrainCheck and improve treatment across the patient journey.”\n\nThe next healthcare revolution will have AI at its center\n\nTopics\n\nSenior Reporter\n\nChristine Hall wrote about enterprise/B2B, e-commerce, and foodtech for TechCrunch, and venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an undergraduate journalism degree from Murray State University and a graduate degree from The Ohio State University.\n\nLIMITED TIME: Save $300+ on your ticket, plus an additional 50% on a second for a full immersive day of AI! Hear from AI pioneers from Google DeepMind, OpenAI, Anthropic, and more on the main stage and in breakouts, and network like never before.\n\nAnthropic launches a voice mode for Claude\n\nOpenAI may soon let you ‘sign in with ChatGPT’ for other apps\n\nRead-it-later app Pocket is shutting down — here are the best alternatives\n\nTexas signs into law online safety bill reportedly opposed by Apple’s Tim Cook\n\nRivr’s dog-like robots join Veho vans to solve ‘last-100-yards’ parcel delivery in Austin\n\nMeta reportedly splits its AI team to build products faster\n\nAI may already be shrinking entry-level jobs in tech, new research suggests",
    "extraction_status": "success"
  },
  "https://markets.businessinsider.com/news/stocks/dermala-a-consumer-dermatology-company-announces-several-additions-to-a-successful-acne-product-range-1030858579_DERMALA, A Consumer Dermatology Company, Announces Several Additions to a Successful Acne Product Range": {
    "company": "Dermala",
    "title": "DERMALA, A Consumer Dermatology Company, Announces Several Additions to a Successful Acne Product Range",
    "url": "https://markets.businessinsider.com/news/stocks/dermala-a-consumer-dermatology-company-announces-several-additions-to-a-successful-acne-product-range-1030858579",
    "source": "Business Insider",
    "body": "SAN DIEGO, Oct. 12, 2021 /PRNewswire/ -- DERMALA, the only personalized, clinically proven treatment for acne powered by the human microbiome extends its product line-up with the addition of six ...",
    "date": "2021-10-12",
    "full_content": "SAN DIEGO,Oct. 12, 2021/PRNewswire/ -- DERMALA, the only personalized, clinically proven treatment for acne powered by the human microbiome extends its product line-up with the addition of six new products. The line extension includes Best CLEANSE Forever™Hydrating Cleanser for Sensitive/Normal Skin, SUPPLEMEANT to Be®Daily Pre + Probiotic Skin Mix, SUPPLEMEANT to Be®Daily Vitamin Skin Mix, and PATCH Me (If You Can)®Targeted Pimple Patches in small (S), medium (M), and extra-large (XL) sizes.\n\nEach new product is an extension of the core line, targeting consumers' specific needs. The Best CLEANSE Forever is an expansion on the original CLEANSE with Benefits AM/PM Cleanser for Normal/Combination Skin. It balances the skin's microbiome and fights acne-causing bacteria without overdrying the skin. The Best CLEANSE Forever is formulated with powerful, patented SE Microbiome®and SE Sugar™Complexes, hyaluronic acid, niacinamide, ceramides, Aloe vera, and botanical extracts that hydrate, soothe and protect blemish-prone, sensitive skin.\n\nThe brand's best-selling SUPPLEMEANT to Be®Daily Pre + Probiotic + Vitamin Skin Mix is now available in two new formulations, based on strong customer demand for solutions that support skin health from the inside out. SUPPLEMEANT to Be®Daily Pre + Probiotic Skin Mix is formulated with unique, blemish-fighting probiotics and prebiotics with a boost from a spinach leaf-based blend of antioxidants, vitamins, and minerals. SUPPLEMEANT to Be®Daily Vitamin Skin Mix enhances skin health with a unique blend of zinc, chromium, vitamins, hyaluronic acid, and green tea & spinach leaf extracts that support a balanced microbiome and glowing skin.\n\nThe product extensions are completed by the launch of 40% thinner PATCH Me (If You Can)®Targeted Pimple Patches in three sizes and a variety of formats –S/M, XL, andS/M/XL variety pack. Similar to the original PATCH ME (If You Can)®, the hydrocolloid pimple patches reduce the size and severity of acne lesions, speed up healing, protect the skin from the spread of acne-causing bacteria, and prevent dark spots and scars.\n\n\"We are dedicated to producing innovative, science-based acne-fighting treatments and products that work from the inside out and outside in,\" said Lada Rasochova, PhD MBA, Founder & CEO of DERMALA. \"Our team is actively developing new products that combine human microbiome science with skincare and data analytics. We are very confident in the results our customers will see with our new product launches.\"\n\nAll DERMALA products are based on cutting-edge human microbiome science. They are formulated with patented microbiome-derived prebiotics, probiotics, and postbiotics that improve skin health naturally by balancing both the skin and gut microbiome. Visitwww.dermala.comto learn more.\n\nAbout DERMALADERMALA, Inc. is aSan Diego-based consumer dermatology company leveraging a scientific understanding of the human microbiome and data analytics to develop novel solutions for acne and other skin conditions. DERMALA delivers a microbiome-powered solution by combining patented topical acne treatments, oral supplements, and the DERMALA Acne Tracker App.\n\nPress Contact:Erica@LazarusPR.com\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/dermala-a-consumer-dermatology-company-announces-several-additions-to-a-successful-acne-product-range-301397098.html\n\nSOURCE  DERMALA",
    "extraction_status": "success"
  },
  "https://ktla.com/business/press-releases/cision/20220607FL79869/dermala-a-consumer-dermatology-company-launches-at-home-personalized-skin-tests/_DERMALA, A CONSUMER DERMATOLOGY COMPANY, LAUNCHES AT-HOME, PERSONALIZED SKIN TESTS": {
    "company": "Dermala",
    "title": "DERMALA, A CONSUMER DERMATOLOGY COMPANY, LAUNCHES AT-HOME, PERSONALIZED SKIN TESTS",
    "url": "https://ktla.com/business/press-releases/cision/20220607FL79869/dermala-a-consumer-dermatology-company-launches-at-home-personalized-skin-tests/",
    "source": "KTLA",
    "body": "June 7, 2022 /PRNewswire/ -- DERMALA, a consumer dermatology company leveraging a scientific understanding of the human microbiome to develop the next generation of products for chronic skin ...",
    "date": "2022-06-07",
    "full_content": "News provided by\n\nJun 07, 2022, 7:00 AM\t\t\t\t\t\tET\n\n,June 7, 2022/PRNewswire/ -- DERMALA, a consumer dermatology company leveraging a scientific understanding of the human microbiome to develop the next generation of products for chronic skin conditions, introduces DERMALA Skin Tests, an at-home, personalized skin testing kit. DERMALA Skin Tests measure the oil level and pH of the skin to track how the customer's skin and microbiome change while using DERMALA's acne treatment.\n\nThe DERMALA Skin Test Kit contains two tests, a Skin Oiliness Test and a Skin pH Test. The Skin Oiliness Test measures levels of sebum (oil) production, which can be associated with clogged pores, overgrowth ofC. acnes, the acne-causing bacteria, and acne breakouts. The Skin pH Test measures the pH of the skin, which corresponds to skin barrier health and microbiome health. DERMALA recommends that tests are taken once a month to accurately track skin changes during acne treatment.\n\nThe launch of the at-home Skin Test Kit is an additional component of the personalization and monthly treatment optimization that the DERMALA brand is known for. As customers take the tests, a QR code is available to access a personalized Digital Skin Report Card that allows customers to monitor their skin health during the treatment, get their product formulation and assortment optimized based on results, and make skincare regimen adjustments as needed.\n\n\"It can be hard to understand whether or not your acne products are improving your overall skin health during your treatment journey,\" said Lada Rasochova, Ph.D. MBA, Founder & CEO of DERMALA. \"Good acne treatments will help reduce skin oiliness and improve the skin barrier and microbiome health. The DERMALA Skin Tests will help our customers track the improvements of their skin health throughout their treatment journey.\"\n\nThe DERMALA Skin Tests are available atwww.dermala.com. All DERMALA products are based on cutting-edge human microbiome science. They are formulated with patented, natural microbiome-derived prebiotics, probiotics, and postbiotics that balance the skin and gut microbiomes and improve skin health naturally.\n\nAbout DERMALADERMALA, Inc. is aSan Diego-based consumer dermatology company leveraging a scientific understanding of the human microbiome and data analytics to develop the next generation of personalized, microbiome-powered solutions for chronic skin conditions including acne and eczema, and skin wellness. Visitwww.dermala.comto learn more.\n\nPress Contact:Erica@LazarusPR.com\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/dermala-a-consumer-dermatology-company-launches-at-home-personalized-skin-tests-301562098.html\n\nSOURCE  DERMALA\n\nNOTE: This content is not written by or endorsed by \"KTLA\", its advertisers, or Nexstar Media Inc.",
    "extraction_status": "success"
  },
  "https://gigazine.net/gsc_news/en/20210702-flowly_'Flowly' that scientifically reduces pain and anxiety with VR and smartphones": {
    "company": "Flowly",
    "title": "'Flowly' that scientifically reduces pain and anxiety with VR and smartphones",
    "url": "https://gigazine.net/gsc_news/en/20210702-flowly",
    "source": "GIGAZINE",
    "body": "Flowly ' is a VR system that can distract you from pain and anxiety by medical methods. Flowly was created with the ease of use at home and scientific backing in mind, and at the time of ...",
    "date": "2021-07-02",
    "full_content": "'Flowly' is a VR system that can distract you from pain and anxiety by medical methods. Flowly was created with the ease of use at home and scientific backing in mind, and at the time of announcement, developers are working to make it covered by insurance.Flowly: your app for pain and anxiety\n\nIt is also possible to stay on the shore of a lake where flowers are in full bloom.\n\nVital signs such as heart rate and respiration rate during use can be aggregated using a smartphone or a dedicated biosensor to measure efficacy. Please note that headsets are limited to VR headsets that are compatible with iOS apps.\n\nAccording to Celine Tien, who developed Flowly, he witnessed that the physical pain caused by serious illnesses such as cancer affects not only the physical body but also the psychology and society, so pain is painful without relying on drugs. He said he wanted to invent a device that could reduce the amount of pain. In each Flowly session, by controlling the nervous system that is greatly involved in pain, you can learn how to shift from a state where sympathetic nerves are activated such as\n\nIn addition, progress data analysis is possible.\n\nJul 02, 2021  23:00:00inSoftware,Hardware,  Posted by darkhorse_log",
    "extraction_status": "success"
  },
  "https://www.bollywoodhungama.com/news/features/sunny-leone-makes-statement-strapless-flowly-gown-kerala/_Sunny Leone makes a statement in strapless flowly gown in Kerala": {
    "company": "Flowly",
    "title": "Sunny Leone makes a statement in strapless flowly gown in Kerala",
    "url": "https://www.bollywoodhungama.com/news/features/sunny-leone-makes-statement-strapless-flowly-gown-kerala/",
    "source": "Bollywood Hungama",
    "body": "The actress looked ethereal in a beige and gold gown. The beige chiffon gown with a golden sparkly corset with a tube sweetheart neckline. She kept her makeup dewy and fresh with her hair in a ...",
    "date": "2021-03-23",
    "full_content": "Sunny Leone, who is currently in Kerala for the shooting schedule of MTV Splitsvilla 13, lit up Instagram on Monday.\n\nThe actress looked ethereal in a beige and gold gown. The beige chiffon gown with a golden sparkly corset with a tube sweetheart neckline. She kept her makeup dewy and fresh with her hair in a high baby doll ponytail. She kept her accessories simple with pearly heart earrings. She looked right out of a barbie doll movie!\n\nIn May last year, Sunny Leone and Daniel Weber moved to Los Angeles from Mumbai for the safety of their kids amid the coronavirus pandemic. She turned to India after a few months.\n\nSunny Leone currently appears as a co-host on MTV Splitsvilla, which she has been hosting since season 7. The show is currently in its 13th season now.\n\nA post shared by Sunny Leone (@sunnyleone)\n\nAlso Read:Sunny Leone looks alluring in tube-neck gown for Splitsvilla 13\n\nCatch us for latestBollywood News,New Bollywood Moviesupdate,Box office collection,New Movies Release,Bollywood News Hindi,Entertainment News,Bollywood Live News Today&Upcoming Movies 2025and stay updated with latest hindi movies only on Bollywood Hungama.",
    "extraction_status": "success"
  },
  "https://kfor.com/business/press-releases/globenewswire/9156554/levlane-advertising-and-rosy-wellness-release-womens-health-white-paper-the-women-are-not-alright/_LevLane Advertising and Rosy Wellness Release Women's Health White Paper: \"The Women Are Not Alright\"": {
    "company": "Rosy Wellness",
    "title": "LevLane Advertising and Rosy Wellness Release Women's Health White Paper: \"The Women Are Not Alright\"",
    "url": "https://kfor.com/business/press-releases/globenewswire/9156554/levlane-advertising-and-rosy-wellness-release-womens-health-white-paper-the-women-are-not-alright/",
    "source": "Oklahoma's News",
    "body": "PHILADELPHIA, June 20, 2024 (GLOBE NEWSWIRE) -- LevLane Advertising, one of Philadelphia's oldest independent, full-service advertising agencies, and Rosy Wellness, the Webby Award-winning app ...",
    "date": "2024-06-20",
    "full_content": "News provided by\n\nJun 20, 2024, 10:00 AM\t\t\t\t\t\tET\n\nPHILADELPHIA, June  20, 2024  (GLOBE NEWSWIRE) -- LevLane Advertising, one of Philadelphia's oldest independent, full-service advertising agencies, and Rosy Wellness, the Webby Award-winning app-based platform that addresses common health concerns for women throughout their lifespans, have jointly released a white paper titled \"The Women Are Not Alright,\" which addresses critical issues in women's health.\n\nIn the white paper, the teams uncover a crucial link between mental and sexual health and the barriers to comprehensive care that women face. The report highlights significant healthcare disparities in women’s health, and the urgent need for better solutions, and provides actionable recommendations to improve women's health outcomes.\n\n\"We're excited to share this white paper, which dives into the real challenges women face with their mental and sexual health,\" said Liz Weir, Chief Marketing Officer of LevLane and co-author of the study. \"As an agency, our mission is to uncover insights that spark meaningful conversations and positive changes. We hope this research not only highlights these critical issues but also inspires better ideas and solutions for our clients and the wider market to truly support women's well-being.\"\n\nData from the research reveals that women experiencing sexual problems are 30% more likely to have poor health and 15% more likely to report low sex satisfaction.\n\nAdditionally, nearly 50% of women cite some type of mental health concern as their top health priority, with issues like depression and anxiety significantly impacting sexual well-being.\n\nLyndsey Harper, MD, CEO of Rosy Wellness, and co-author of the white paper, said, \"This research is incredibly important when it comes to understanding how critical the need for comprehensive and expert-led solutions in women’s health is. We must change the way we talk about and treat women’s health issues to ensure we can provide patients with evidence-based answers and the empowerment they need to improve their overall quality of life.”\n\nThe authors argue that fostering more robust and accessible educational programs, incentivizing holistic care through payer commitments, calling for renewed action from the investment community on focused funding for women’s health, and advancing research on the connection between mental health and sexual wellness can lead to practical solutions and destigmatization.\n\n\"We are advocating for a more comprehensive approach to addressing the needs of women, ensuring that both mental and sexual health are given equal priority and attention,\" said co-author Karla Loken, DO; OBGYN; FACOG; Vice President of Medical Affairs and Clinical Operations, HerMD; and Strategic Advisor, FEMSelect.\n\nIn conjunction with the release of the white paper, its findings and recommendations were discussed duringKisaco Research'sJune Women's Health Innovation Seriestitled \"Empowering Women Through Collaboration: Bridging the Gap Between Mental and Sexual Health.\"\n\nSpeakers from the webinar included:\n\nTo download a copy of the white paper, visit:https://go.levlane.com/the-women-are-not-alright_2024\n\nAbout LevLaneLevLane Advertising is a full-service independent advertising agency headquartered in Philadelphia that has been building brands people love for nearly 40 years. The award-winning agency integrates traditional creative expertise with cutting-edge digital capabilities in its menu of services, including search engine optimization (SEO), search engine marketing (SEM), programmatic media, strategy, creative and branding, media and analytics, social media, content marketing, and public relations.\n\nFor more information about LevLane and its capabilities, connect with us onLinkedIn,Instagram, andFacebook.\n\nAbout RosyRosy is a first-of-its-kind platform that offers personalized and holistic solutions for women's wellness. Originally focused on sexual health, the app has expanded into other underserved aspects of women's health, including endometriosis, fibroids, menopause, migraine, and more. Offerings include customized Wellness Plans, individual and group health coaching, audio and written erotica, educational videos, supportive online community, and much more. Rosy is the first physician-founded platform supporting women throughout their lifetime.\n\nIn 2022, Rosy won the UCSF Digital Health Rising Star Award in the Consumer Wellness Category, as well as the Webby Award for Best Visual Design - Aesthetic in the Apps and Software Category, and in 2023, Lyndsey Harper, MD, and Rosy were awarded the Women's Health Innovation Summit (WHIS) Judge's Choice Award.\n\nWebsite:https://meetrosy.com/Instagram:@meet_rosyLinkedIn:https://www.linkedin.com/company/meet_rosy/The Rosy App:https://meetrosy.app.link/h1yxnl3eknb\n\nMedia Contact:Lauren StraloPR Directorlstralo@levlane.com484-747-0172\n\nA photo accompanying this announcement is available at:https://www.globenewswire.com/NewsRoom/AttachmentNg/2a31cc8e-cc6e-42f2-8a93-d42efafb98f7\n\nNOTE: This content is not written by or endorsed by \"KFOR\", its advertisers, or Nexstar Media Inc.",
    "extraction_status": "success"
  },
  "https://finance.yahoo.com/news/oro-devices-names-cori-lathan-220500791.html_De Oro Devices Names Cori Lathan, PhD, as New CEO": {
    "company": "De Oro Devices",
    "title": "De Oro Devices Names Cori Lathan, PhD, as New CEO",
    "url": "https://finance.yahoo.com/news/oro-devices-names-cori-lathan-220500791.html",
    "source": "Yahoo Finance",
    "body": "Dr. Lathan joins De Oro Devices from her previous role as CEO at AnthroTronix, where she successfully invented, developed, and commercialized medical technology for over 20 years before leading ...",
    "date": "2024-01-18",
    "full_content": "Dr. Lathan brings two decades of medical technology with her to drive the health tech startup forward\n\nSAN LUIS OBISPO, CA / ACCESSWIRE / January 18, 2024 /De Oro Devices, a leading innovator in medical technology for the aging and mobility-impaired population, is pleased to announce the appointment of Dr. Cori Lathan as its new Chief Executive Officer (CEO). In her new role, Lathan will focus on continuing the rapid growth De Oro Devices has seen by exploring new partnerships across the healthcare industry and working to advance its innovative technology.\n\nDr. Lathan joins De Oro Devices from her previous role as CEO at AnthroTronix, where she successfully invented, developed, and commercialized medical technology for over 20 years before leading the company through a successful exit. She has been recognized by the World Economic Forum as a Technology Pioneer and Young Global Leader and is the founding co-chair of their Global Futures Council on Human Augmentation and Longevity. Her expertise in brain health and age tech as well as mobility products positions her as a visionary leader capable of driving De Oro Devices to new heights.\n\n\"We are thrilled to welcome Dr. Cori Lathan as our new CEO,\" said Sidney Collin, Board Member, Co-founder, President and CTO at De Oro Devices. \"Her exceptional leadership, deep industry knowledge, and commitment to innovation align perfectly with our mission. As we continue to improve the lives of the mobility-impaired, I know Dr. Lathan is the right leader to take De Oro Devices forward.\"\n\n\"I am honored and excited to lead De Oro Devices into its next chapter of growth and innovation,\" said Dr. Cori Lathan. \"The team's dedication to changing lives through developing transformational medical technologies is inspiring, and I look forward to building on the company's successes to make a meaningful impact on technology for the aging population globally.\"\n\nDe Oro Devices is at the forefront of medical technology, known for creating the first non-invasive cueing technology that can be used with any mobility aid to improve mobility and decrease falls for people with mobility impairments. Learn more at www.getnexstride.com.\n\nAbout De Oro Devices\n\nDe Oro Devices is an award-winning tech startup that's restoring mobility, independence, and a higher quality of life to individuals with mobility challenges and/or heightened fall risk. De Oro's flagship product, NexStride, is a small, unobtrusive device that can attach to any assisted walking tool (i.e., cane, walker, or rollator), which leverages visual and auditory cueing technology to reduce fall risk and improve mobility. Learn more atwww.getnexstride.com.\n\nContact Information\n\nWilliam Thompsonpr@deorodevices.com\n\nSOURCE:De Oro Devices\n\nView the originalpress releaseon newswire.com.",
    "extraction_status": "success"
  },
  "https://abc30.com/parkinsons-disease-nexstride-device-de-oro-devices-clovis-veteran-able-to-walk/12728394/_New device helps Clovis veteran with Parkinson's walk again": {
    "company": "De Oro Devices",
    "title": "New device helps Clovis veteran with Parkinson's walk again",
    "url": "https://abc30.com/parkinsons-disease-nexstride-device-de-oro-devices-clovis-veteran-able-to-walk/12728394/",
    "source": "ABC30 Action News",
    "body": "CLOVIS, Calif. (KFSN) -- The simple act of walking can be challenging for those living with Parkinson's disease, which affects movement. However, a Clovis veteran is now on the move with the help ...",
    "date": "2023-01-25",
    "full_content": "The device essentially uses the same visual and auditory signals or cues used in physical therapy.\n\nCLOVIS, Calif. (KFSN) --The simple act of walking can be challenging for those living with Parkinson's disease, which affects movement.\n\nHowever, a Clovis veteran is now on the move with the help of a newly-invented device.\n\n\"It feels like your feet are stuck in cement,\" explained Patrick Hallmark. \"A lot of people who have Parkinson's, you'd be going through a doorway or whatever, and your feet -- you just cannot move your feet.\"\n\nThe 63-year-old has a condition called \"Freezing of Gait,\" which can come with Parkinson's.\n\nIt can lead to falls and hospitalizations.\n\nFor Hallmark, it also came with a loss of independence.\n\n\"If I didn't have my wife or daughter with me, I would really have a hard time out going to stores and everything,\" he said.\n\nThat's all changed with a device as small as his palm.\n\n\"This has done wonders,\" Hallmark said, as he shows his NexStride device.\n\nThrough a Parkinson's support group, Hallmark learned about NexStride and immediately bought the device.\n\nNow he's walking, despite his condition.\n\nSidney Collin, CEO of De Oro Devices, explained why walking can be hard for people with Freezing of Gait.\n\n\"There's a disconnect between the brain and the body, and it makes it so that when the brain is sending that signal to initiate movement, it doesn't get to the motor neurons that are activating the muscles,\" she said.\n\nCollin, a biomedical engineer, created NexStride for a veteran while she was in college.\n\nThe device essentially uses the same visual and auditory signals or cues used in physical therapy.\n\n\"The visual cue that we use is a green laser line projected onto the floor in front of you. The auditory cue is a metronome,\" she explained. \"So you visualize yourself stepping over that green laser line, stepping to the beat of the metronome. Just by changing the intention behind the movement, by setting that goal, we're changing the part of the brain that's been activated, that allows someone to be able to restore mobility.\"\n\nCollin is happy to see NexStride restoring mobility for people like Hallmark.\n\n\"I am able to walk or take my dog for walks,\" Hallmark said. \"I'm able to get out and go shopping, grocery shopping for my wife -- just do different things like that.\"\n\nThe device is $499 and it's 100% covered for veterans through Veterans Affairs, as well as the Parkinson's Wellness Fund organization.",
    "extraction_status": "success"
  },
  "https://www.eurekalert.org/news-releases/1051592_Automated appointment scheduling and reminder messages may improve post-partum health and well-being for those with chronic health conditions": {
    "company": "Partum Health",
    "title": "Automated appointment scheduling and reminder messages may improve post-partum health and well-being for those with chronic health conditions",
    "url": "https://www.eurekalert.org/news-releases/1051592",
    "source": "EurekAlert!",
    "body": "A new study in JAMA Network Open found that an intervention involving automated appointment scheduling and reminder messages may improve post-partum health and well-being for these individuals.",
    "date": "2024-07-16",
    "full_content": "Key Takeaways\n\nMany pregnant people have chronic medical conditions, and although they are usually closely monitored during pregnancy, they often face barriers when transitioning to primary care following delivery.\n\nA new study inJAMA Network Openfound that an intervention involving automated appointment scheduling and reminder messages may improve post-partum health and well-being for these individuals.\n\nThe research was led by investigators at Massachusetts General Hospital, a founding member of the Mass General Brigham healthcare.\n\n“Individuals with chronic and mental health conditions typically have frequent contact with obstetrical care providers while pregnant but often are largely left to navigate ongoing care needs on their own after delivery—referred to as the ‘postpartum cliff’,” explained lead authorMark Clapp, MD, MPH, a maternal-fetal medicine specialist in the Department of Obstetrics and Gynecology at Massachusetts General Hospital and an assistant professor of Obstetrics, Gynecology, and Reproductive Biology at Harvard Medical School. “Among other factors, this ‘cliff’ is caused by administrative burdens, such as appointment scheduling and navigating insurance, which make it difficult for individuals to seek care.”\n\nTo address this problem, Clapp and his colleagues evaluated the potential of auto scheduling appointments, along with tailored messages and nudge reminders, to improve primary care engagement within four months after delivery for postpartum individuals with diabetes, hypertension, mental illness, or obesity.\n\nIn the randomized clinical trial of 360 patients, those who received the intervention were more likely to have a primary care visit than those who did not, highlighting the potential of this low-cost intervention to transition ongoing care needs after pregnancy to primary care clinicians.\n\nSpecifically, the intervention increased postpartum primary care visits by 19 percentage points. It also resulted in more individuals receiving important screening tests and services, including blood pressure screening (42.8% versus 28.3%), weight assessment (42.8% versus 27.7%), and depression screening (32.8% versus 16.8%).\n\n“Our findings indicate that a multifaceted and relatively low-resource behavioral economic intervention may improve postpartum health and well-being,” said Clapp.\"As a primary care physician, I have frequently observed how care is improved for individual patients by a careful transition between obstetrics and primary care,\" saysAlaka Ray, MD, a Mass General primary care physician and an author of the study. \"It is wonderful that this study has now demonstrated the importance of that connection in the form of significant benefits for postpartum patients with high-risk conditions.\"\"I would also note that this study population is comprised of patients who already had an established primary care physician. We all know, however, that many others cannot find a primary care physician,\" says Ray. \"It is my hope that this study will add further urgency to the call to address our worsening primary care shortage so that evidence-based interventions like this can be broadly implemented for all of our patients.\"\n\nAuthorship:Mark A. Clapp, Alaka Ray, Pichliya Liang, Kaitlyn E. James, Ishani Ganguli, and Jessica L. Cohen.\n\nDisclosures:Disclosure forms provided by the authors are available with the full text of this article.\n\nFunding:This work was supported by the National Institute on Aging and the National Academy of Medicine.\n\nAbout Massachusetts General Hospital\n\nMassachusetts General Hospital, founded in 1811, is the original and largest teaching hospital of Harvard Medical School. The Mass General Research Institute conducts the largest hospital-based research program in the nation, with annual research operations of more than $1 billion and comprises more than 9,500 researchers working across more than 30 institutes, centers and departments. MGH is a founding member of the Mass General Brigham healthcare system.\n\nJAMA Network Open\n\n10.1001/jamanetworkopen.2024.22500\n\nExperimental study\n\nPeople\n\nPostpartum Primary Care Engagement Using Default Scheduling and Tailored Messaging\n\n16-Jul-2024\n\nDisclaimer:AAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert system.",
    "extraction_status": "success"
  },
  "https://www.woodtv.com/business/press-releases/cision/20250318NY41483/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role-playing-practice-and-scalable-client-care/_Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care": {
    "company": "Fort Health",
    "title": "Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care",
    "url": "https://www.woodtv.com/business/press-releases/cision/20250318NY41483/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role-playing-practice-and-scalable-client-care/",
    "source": "WOOD-TV",
    "body": "Using Fort Health's agentic AI training platform - which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers - therapists ...",
    "date": "2025-03-18",
    "full_content": "News provided by\n\nMar 18, 2025, 9:00 AM\t\t\t\t\t\tET\n\nAgentic AI Custom Training Scenarios Result in 83% of Clinicians Feeling More Prepared and 95% Able to Apply What They Have Learned\n\nNEW YORK,March 18, 2025/PRNewswire/ -- The high stakes nature of youth mental health therapy requires thorough preparation and applied evidence-based skills. Today,Fort Health, a specialty outpatient pediatric mental health provider, announced that it has partnered withCollevato train its therapists with AI avatar-led, face-to-face simulations. By providing highly relevant and engaging customized scenarios, Fort Health is able to rapidly upskill its therapists using evidence-based therapeutic protocols, ultimately leading to improved client care and operational efficiency. The initial series of custom training scenarios resulted in 83% of clinicians feeling more prepared and 95% able to apply what they have learned.\n\nAbody of researchfrom the National Institute of Medicine shows that current efforts to train clinicians in empirically-based treatments (EBTs) face significant challenges, as they typically provide only didactic training with no examination of applied skills, follow-up support, or implementation feedback. Studies emphasize the importance of role-play skill practice and ongoing expert guidance to ensure clinicians maintain high fidelity to EBT protocols and deliver effective interventions to patients. Compounded by thebehavioral health care workforce shortage,these limitations underscore the need for innovative training approaches to address challenges in a cost-effective and scalable manner.\n\n\"AI-powered avatar simulations are revolutionizing therapist training by enabling immersive, risk-free practice of critical decision-making and patient interactions,\" saidNatalie Schneider, founding CEO of Fort Health. \"Colleva's AI coaching platform empowers us to design tailored, dynamic scenarios that mirror real-world challenges, providing therapists with hands-on experience in applying evidence-based treatment protocols. By leveraging AI patient avatars, we are transforming mental health training—making it more proactive, personalized, and scalable to meet the growing demand for high-quality care.\"\n\nHow it Works\n\nUsing Fort Health's agentic AI training platform – which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers – therapists conduct realistic role plays with custom avatars and receive personalized feedback to identify areas for improvement and highlight strengths. The series of interactive scenarios are a safe space to practice and develop therapeutic techniques. To help therapists build and demonstrate their proficiency, there are three scenarios representative of the patient population that Fort Health treats. Each of the scenario's avatars have six personalities to choose from, allowing for more realistic and varied practice. Each custom simulation uses generative AI to analyze both content and delivery. Personalized feedback is based on specific EBT objectives and CBT competency frameworks. Therapists are also provided instant feedback on soft skill competencies important to successful therapy outcomes.\n\n\"We are harnessing AI not to replace human therapists, but to make them more effective,\" saidMichael Palys, co-founder and president of Colleva. \"It's been wonderful working in partnership with the Fort Health team as they share our collective vision of using AI role plays and simulations to enhance human skills in areas like mental health where these skills are so critically important to successful patient outcomes. The ability to offer personalized 1:1 feedback at scale is a game changer. My father's own career in psychiatry has made this particular project very special to me, and it's been wonderful to see the excitement among practitioners.\"\n\n\"As a therapist, I know how challenging it can be to translate the professional training we receive into real life interactions with children and families. I also know how uncomfortable and anxiety provoking it can be for a therapist to participate in role plays or live observations. Having a private, safe space to fumble and trip as you sharpen your skill set is a game changer for most therapists,\" saidLindsay Henderson, PsyD, founding clinical director, Fort Health. \"Utilizing AI simulations as a training platform to increase therapist's ability to deliver EBT at a higher fidelity will be key to solving for our nation's youth mental health needs.\"\n\n\"What a unique training opportunity! It allows me to practice and improve my clinical skills in a way I've never before experienced. I love getting immediate feedback which I can implement in real time,\" said Licensed Professional Counselor Catherine Murray.\n\nAbout Fort Health\n\nFounded in 2022, Fort Health is a specialty outpatient pediatric mental health provider. Fort Health transforms how children and adolescents, ages 4-24, receive mental health care by seamlessly partnering with pediatricians to provide evidence-based therapy, psychiatry, and parent coaching – all covered by insurance. Fort Health was built in partnership with the Child Mind Institute, an independent non-profit dedicated to transforming the lives of children and families struggling with mental health, mental illness and learning disorders. The company operates inNew Jersey,New York,Pennsylvania, andTexasandIllinois. VisitFort Healthon our website and onLinkedIn.\n\nAbout Colleva\n\nFounded in 2023, Colleva is an AI-powered enterprise talent platform that can help professionals enhance both hard and soft skills through personalized, scalable 1:1 feedback. Using AI avatars to provide AI roleplay and simulation-based training, Colleva provides immersive practice environments where professionals master critical interactions with immediate feedback. Colleva offers solutions across talent acquisition, onboarding, learning & development, performance management, and employee insights for organizations within healthcare, financial services, as well as other sectors. Headquartered inGreenwich, Connecticut, Colleva is transforming workforces through innovative AI solutions. Visit Colleva on our website and on LinkedIn.\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role-playing-practice-and-scalable-client-care-302402020.html\n\nSOURCE  Fort Health\n\nNOTE: This content is not written by or endorsed by \"WOOD\", its advertisers, or Nexstar Media Inc.",
    "extraction_status": "success"
  },
  "https://www.mainebiz.biz/article/with-new-retail-products-atlantic-sea-farms-seeks-to-expand-kelp-market_With new retail products, Atlantic Sea Farms seeks to expand kelp market": {
    "company": "Atlantic Sea Farms",
    "title": "With new retail products, Atlantic Sea Farms seeks to expand kelp market",
    "url": "https://www.mainebiz.biz/article/with-new-retail-products-atlantic-sea-farms-seeks-to-expand-kelp-market",
    "source": "Mainebiz",
    "body": "Atlantic Sea Farms A kelp farm can produce three to seven pounds per foot of line. With up to 18,000 feet of line in the water, \"that's a lot of kelp,\" said Atlantic Sea Farms CEO Briana Warner.",
    "date": "2019-04-17",
    "full_content": "From left, Atlantic Sea Farms supply chain manager James Crimp, CEO Briana Warner and sales and marketing manager Jesse Baines.",
    "extraction_status": "success"
  },
  "https://www.pcmag.com/reviews/unaliwear-kanega-watch_UnaliWear Kanega Watch Review": {
    "company": "Unaliwear",
    "title": "UnaliWear Kanega Watch Review",
    "url": "https://www.pcmag.com/reviews/unaliwear-kanega-watch",
    "source": "PC Magazine",
    "body": "I've been working with computers for ages, starting with a multi-year stint in purchasing for a major IBM reseller in New York City before eventually landing at PCMag (back when it was still in ...",
    "date": "2022-03-31",
    "full_content": "Smartwatchesaren't just for sending texts and monitoring your fitness activities. Designed to look like a regular watch, the UnaliWear Kanega Watch (starting at $149.99 upfront, then $59.95 per month) is amedical alert devicethat connects you to an emergency response center with the touch of a button or a simple voice command. It calls for help when you fall down, and also tells you when to take your medicine. If you don't need fall detection, however, we prefer theMedical Guardian MGMovethanks to its superior caregiver tools and lower subscription pricing.\n\nAvailable with a black, champagne gold, or rose gold bezel, the Kanega Watch face measures 1.6 inches in diameter and is 0.5 inches thick. The screen is a bit larger than that of the Medical Guardian MGMove (1.25 inches in diameter), and the Kanega’s black-and-gold mesh wrist band makes the watch look and feel bulkier. It has anIP67 waterproof ratingand you get several straps in the box so you can pick the one that best fits your wrist.\n\nAnother reason for the additional heft are the two rechargeable battery packs (one on each side of the watch) that you can remove and charge via the three-port battery charger that comes in the box. You get a total of four batteries in the package, which means you can keep two of them charged at all times. The batteries are easy to swap out, and the process doesn't even require you to remove the watch. UnaliWear recommends changing the batteries daily (they last up to 36 hours) and provides free replacements when they reach the end of their charging life (approximately 18 months with regular use).\n\nThe Kanega Watch has GPS, cellular (Verizon), and Wi-Fi radios that can help pinpoint your exact location in the event of an emergency. Its screen uses white text on a black background, a departure from the full-color touch screens you get with theLifeStation Sidekick Smartand the Medical Guardian MGMove watches. According to UnaliWear, the high-contrast monochrome display is easier to read if you suffer from glaucoma or macular degeneration.\n\nThe right side of the watch houses a speaker and a microphone for two-way hands-free communication and for issuing voice commands. To communicate with the watch using voice commands, begin with the phrase “Fred Astaire,” which is the watch’s name. Once you activate the voice command option, you can ask questions such as, “Fred Astaire, what time is it?” and “Fred Astaire, what day is it?” to hear an audible response. If you say, “Fred Astaire, call the operator,” or, “Fred Astaire, get help,” the watch places a call to the 24/7 emergency response center.\n\nAlso on the right side is a crown button that you use to initiate a call to a representative and to navigate through each screen. Press the button for five seconds to connect to an agent, or press and release it quickly to display the current time, day, date, and battery level. Press it a second time to view just the day of the week and date, and then quickly press it twice to toggle to a screen that displays the time, date, battery level, and Wi-Fi signal strength. Continue to single press the crown button to toggle through the settings screens where you select a watch face (you get 12- or 24-hour format and digital or analog options), adjust the speaker volume and screen brightness, update phone settings, enable airplane mode, view a how-to tutorial, and obtain a security code to use with the web portal.\n\nOne important note: The Kanega Watch requires a subscription. You can choose between an annual or quarterly plan, but both require you to pay a one-time setup fee ($149.99 and $249.99 respectively). You pay upfront for each plan—either $719.40 per year (the equivalent of $59.95 per month) or $209.85 per quarter (the equivalent of $69.95 per month).\n\nSign up for the Lab Report newsletter to receive PCMag's latest product reviews, buying advice, and insights.\n\nBy clicking Sign Me Up, you confirm you are 16+ and agree to ourTerms of UseandPrivacy Policy.\n\nThanks for signing up!\n\nYour subscription has been confirmed. Keep an eye on your inbox!\n\nFor comparison, LifeStation's monthly plan for its Sidekick Smart watch costs $43.95 per month. The Medical Guardian MGMove watch has an upfront cost of $199.99 and requires a $39.95-per-month subscription ($36.62 per month if you pay annually), but neither it nor the Sidekick Smart offer fall detection.\n\nThe Kanega watch offers generic medicine reminders, but lacks many of the features that you get with the MGMove including a built-in pedometer, as well as a companion app that allows you to send messages to trusted contacts and set reminders for appointments and medications. The My Guardian app for the MGMove also lets people in your support circle monitor your emergency alert events and pinpoint your exact location on a map.\n\nUnaliWear offers a web portal for the Kanega Watch, but all you can do here is enter up to five daily medicine reminders and configure Wi-Fi settings.\n\nTo prepare the Kanega Watch for first use, you need to charge the batteries for approximately two hours. After you install the batteries in the watch, press the crown button to launch a voice-activated tutorial. The voice prompts tell you how to get the time by asking for it, how to use the help button, and how to test the watch. You also receive an email to schedule an onboarding call with a UnaliWear representative to go over things like how the watch and voice activation works, how emergency dispatch and fall detection features function, where the microphone is, and how to install batteries.\n\nWe test response time by clocking how long it takes for a device to connect us with a live response agent after we press the call button. The Kanega Watch took an average of 46 seconds to reach a representative in our tests. That’s a bit slower than the Medical Guardian MGMove (26 seconds) and the LifeStation Sidekick Smart (28 seconds), but that response time is still under a minute, which is good.\n\nThe GPS radio was always accurate in testing, and the emergency response agents we spoke with were friendly and professional. Two-way audio sounded clear and adequately loud, too.\n\nThe Kanega Watch is an inconspicuous medical alert device that can connect you to an emergency response agent if you need help, no matter where you are. Fall detection  and voice control are its main benefits, but you can set generic medicine reminders via a web portal, too. That said, you don't get the mobile app and caregiver tools we expect from medical alert devices, and the required subscription is quite pricey. Our Editors’ Choice winner, the Medical Guardian MGMove, is more affordable and offers a better set of features, though it doesn't detect falls.\n\nBest Watch for Fall Detection\n\nUnaliWear’s Kanega Watch detects when you fall and supports voice control, but lacks the caregiver options we expect from medical alert devices.\n\nI’ve been working with computers for ages, starting with a multi-year stint in purchasing for a major IBM reseller in New York City before eventually landing at PCMag (back when it was still in print asPC Magazine). I spent more than 14 years on staff, most recently as the director of operations for PC Labs, before hitting the freelance circuit as a contributing editor.\n\nRead John R.'s full bio",
    "extraction_status": "success"
  },
  "https://finance.yahoo.com/news/braincheck-expands-first-end-end-130000828.html_BrainCheck Expands First End-to-End Solution for Cognitive Care": {
    "company": "BrainCheck",
    "title": "BrainCheck Expands First End-to-End Solution for Cognitive Care",
    "url": "https://finance.yahoo.com/news/braincheck-expands-first-end-end-130000828.html",
    "source": "Yahoo Finance",
    "body": "Company introduces next generation of its comprehensive platform and 3-minute screening tool at Clinical Trials on Alzheimer's Disease (CTAD) conference New research supporting BrainCheck platform ...",
    "date": "2023-10-24",
    "full_content": "Content extraction failed: 404 Client Error: Not Found for url: https://finance.yahoo.com/news/braincheck-expands-first-end-end-130000828.html",
    "extraction_status": "success"
  },
  "https://markets.businessinsider.com/news/stocks/cosmopolitan-selects-dermala-s-oat-so-sweet-daily-moisturizer-as-best-moisturizer-in-2021-holy-grail-acne-awards-1031015447_Cosmopolitan Selects DERMALA's OAT So Sweet™ Daily Moisturizer as \"Best Moisturizer\" in 2021 Holy Grail Acne Awards": {
    "company": "Dermala",
    "title": "Cosmopolitan Selects DERMALA's OAT So Sweet™ Daily Moisturizer as \"Best Moisturizer\" in 2021 Holy Grail Acne Awards",
    "url": "https://markets.businessinsider.com/news/stocks/cosmopolitan-selects-dermala-s-oat-so-sweet-daily-moisturizer-as-best-moisturizer-in-2021-holy-grail-acne-awards-1031015447",
    "source": "Business Insider",
    "body": "SAN DIEGO, Dec. 1, 2021 /PRNewswire/ -- Cosmopolitan Magazine, the widest-reaching beauty publication in the world, has recognized DERMALA in the inaugural Holy Grail Acne Awards. Based on months ...",
    "date": "2021-12-01",
    "full_content": "SAN DIEGO,Dec. 1, 2021/PRNewswire/ --CosmopolitanMagazine, the widest-reaching beauty publication in the world, has recognized DERMALA in the inaugural Holy Grail Acne Awards. Based on months of rigorous comparative testing, theCosmobeauty team selected DERMALA's OAT So Sweet™, Daily Moisturizer for Blemish-Prone Skin, for the \"Best Moisturizer\" Holy Grail Acne Award.\n\nThe OAT So Sweet was recognized for its effectiveness and efficacy, with oneCosmopolitanBeauty Assistant stating, \"I like using this moisturizer to do two things: calm my complexion and rebuild my skin's microbiome. The ceramides in this formula assist in rebuilding that skin barrier and locking in moisture, so I can continue to safely use my favorite Vitamin A.\"\n\nOAT So Sweet is a soothing light moisturizer formulated with prebiotics and postbiotics to balance and restore the skin microbiome. Its unique combination of ingredients was specifically formulated to help calm, restore, and heal blemish-prone skin. OAT So Sweet is suitable for all skin types. It reduces redness while hydrating and protecting the skin.\n\n\"We are incredibly honored to be recognized by Cosmopolitan with their prestigious Holy Grail Acne Award,\" said Lada Rasochova, Ph.D. MBA, Founder & CEO of DERMALA. \"Our team is dedicated to producing innovative, patented, science-based acne-fighting products that truly work.\"\n\nWith key ingredients such as colloidal oatmeal, niacinamide, licorice root extract, ceramides, avocado oil, and green tea leaf extract, the OAT So Sweet Daily Moisturizer hydrates and plumps the skin without clogging pores. The patented SE Microbiome Complex®and SE Sugar Complex™are the true differentiators of this moisturizer, providing naturally occurring prebiotics and postbiotics that support a balanced microbiome by killingC. acnes, the acne-causing bacteria while promoting the growth ofS. epidermidis, the beneficial, acne-fighting bacteria.\n\nAll DERMALA products are based on cutting-edge human microbiome science. They are formulated with patented microbiome-derived prebiotics, probiotics, and postbiotics that improve skin health naturally.\n\nAbout DERMALADERMALA, Inc. is a consumer dermatology company leveraging a scientific understanding of the human microbiome and data analytics to develop novel solutions for a variety of skin conditions such as acne, eczema, and skin aging. The company markets human microbiome-powered topical skincare products and oral supplements including the #FOBO®(Fear of Breaking Out) microbiome-based treatment system for acne. For more information, visitwww.dermala.com.\n\nContact:Erica LazarusPhone: 917.257.5481Email: Erica@LazarusPR.com\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/cosmopolitan-selects-dermalas-oat-so-sweet-daily-moisturizer-as-best-moisturizer-in-2021-holy-grail-acne-awards-301434659.html\n\nSOURCE  DERMALA",
    "extraction_status": "success"
  },
  "https://www.businesswire.com/news/home/20200609005289/en/Flowly-Offers-Relief-to-100-Million-Americans-Living-with-Chronic-Pain-and-Anxiety_Flowly Offers Relief to 100 Million Americans Living with Chronic Pain and Anxiety": {
    "company": "Flowly",
    "title": "Flowly Offers Relief to 100 Million Americans Living with Chronic Pain and Anxiety",
    "url": "https://www.businesswire.com/news/home/20200609005289/en/Flowly-Offers-Relief-to-100-Million-Americans-Living-with-Chronic-Pain-and-Anxiety",
    "source": "Business Wire",
    "body": "LOS ANGELES--(BUSINESS WIRE)--Flowly today officially launched its interactive mobile app to address chronic pain and anxiety. The platform offers immersive experiences in beautiful and peaceful ...",
    "date": "2020-06-09",
    "full_content": "Flowly Offers Relief to 100 Million Americans Living with Chronic Pain and Anxiety\n\nMobile app manages symptoms through virtual reality and relaxation training anytime, anywhere\n\nFlowly Mobile app manages symptoms through virtual reality and relaxation training anytime, anywhere (Photo: Business Wire)\n\nLOS ANGELES--(BUSINESS WIRE)--Flowlytoday officially launched its interactive mobile app to address chronic pain and anxiety. The platform offers immersive experiences in beautiful and peaceful virtual reality and 360° worlds that engage users in biofeedback for relaxation training. Flowly allows users to access the virtual worlds anytime, anywhere on their phones or with VR headsets to monitor and adjust how they breathe, focus, and learn how to better regulate their own nervous systems. For a look into Flowly’s virtual worlds and to see the app in action, watchthis video.\n\nFlowly has also created a special session that specifically targets Coronavirus-related anxiety, and makes a monetary donation towards COVID-19 relief efforts upon completion. Additionally, in light of recent tragic events that have amplified the Black Lives Matter movement, Flowly is standing with the Black community and offering afree month’s subscription to POCwho have anxiety, sleep deprivation and/or other symptoms as a result of race-based triggers. Flowly is available for download in theApp Storeand atwww.flowly.world.\n\n“100 million Americans of all ages suffer from chronic pain and anxiety,” said Celine Tien, co-founder & CEO, Flowly. “Flowly is the first interactive platform to make pain management accessible, and address all parts of pain: physical, psychological, and even social. Flowly is engaging, gamified and community-based.”\n\nKey features of the Flowly app include:\n\nFlowly is founded by Celine Tien, a storyteller from Yale, who aimed to create a platform that not only addressed physical pain, but also the anxiety, depression and social isolation that accompanies it. She called upon cofounder and Yale engineer, Julien Soros, to create an accessible biofeedback system and then rounded out the trio with award-winning designer and 3D artist, cofounder Narae Kim, to create the app’s virtual worlds. The team is supported by an advisory board made up of a world-class group of doctors and therapists.\n\n“Flowly has developed a pain and anxiety management platform that is not only intelligent, but thoughtful as well,” said Aman Mahajan, MD, PhD, and Chair of Perioperative Medicine at University of Pittsburgh Medical Center. “Flowly’s comprehensive approach helps manage not only the physical aspects of living with pain and anxiety, but also offers invaluable support to overcome the mental challenges that come along with it.”\n\nFlowly offers the first eight Flowly Intro sessions and #BreatheTogether experience to all users whodownload the app. Users can then access the full Flowly platform with either a Basic or Pro subscription (more information available in the app).\n\nTo learn more about Flowly and to start managing your pain and anxiety today, visitwww.flowly.world.\n\nAbout Flowly\n\nFlowly is your app for chronic pain, stress and anxiety. Founded in 2019 by two Yale classmates and an award-winning designer, Flowly’s mission is to take typically inaccessible therapies like biofeedback and virtual reality, and put it in the hands of the people who need it most. The company’s easy-to-use and accessible interactive platform guides users in relaxation training to regulate their nervous systems while immersed in beautiful and relaxing virtual environments. Flowly tracks user progress and offers an online community forum to share and support with other members. To learn more, visitwww.flowly.world.\n\nFlowlyDonna Loughlin Michaels(408) 393-5575donna@lmgpr.com\n\nFlowlyDonna Loughlin Michaels(408) 393-5575donna@lmgpr.com\n\nFlowlyDonna Loughlin Michaels(408) 393-5575donna@lmgpr.com",
    "extraction_status": "success"
  },
  "https://medcitynews.com/tag/rosy-wellness/_rosy wellness": {
    "company": "Rosy Wellness",
    "title": "rosy wellness",
    "url": "https://medcitynews.com/tag/rosy-wellness/",
    "source": "MedCity News",
    "body": "In recent years, providers have been increasingly conducting tech pilots to see which solutions can best improve their clinical and operation success. During a panel at MedCity News' INVEST ...",
    "date": "2024-09-19",
    "full_content": "In recent years, providers have been increasingly conducting tech pilots to see which solutions can best improve their clinical and operation success. During a panel at MedCity News’ INVEST Digital Health conference in Dallas, healthcare leaders shared their insight on how startups can best serve their provider partners during these pilots.",
    "extraction_status": "success"
  },
  "https://medcitynews.com/tag/fort-health/_Fort Health": {
    "company": "Fort Health",
    "title": "Fort Health",
    "url": "https://medcitynews.com/tag/fort-health/",
    "source": "MedCity News",
    "body": "Fort Health, a new startup built at Redesign Health, recently launched as a provider of mental healthcare services for children. The company has developed a telehealth-based mental health clinic ...",
    "date": "2023-02-09",
    "full_content": "Fort Health's $5.5 million in funding was led by Twelve Below and Vanterra and included participation from Redesign Health, Blue Venture Fund and True Wealth Ventures.",
    "extraction_status": "success"
  },
  "https://www.washingtonpost.com/food/2022/07/25/seaweed-maine-lobster-industry/_Seaweed helps Maine lobstermen ride the storm of climate change": {
    "company": "Atlantic Sea Farms",
    "title": "Seaweed helps Maine lobstermen ride the storm of climate change",
    "url": "https://www.washingtonpost.com/food/2022/07/25/seaweed-maine-lobster-industry/",
    "source": "The Washington Post",
    "body": "\"They're ready for harvest,\" she declares. As the CEO and president of Atlantic Sea Farms, the 38-year-old Warner is using seaweed to quietly revolutionize Maine's struggling fishing industr",
    "date": "2022-07-25",
    "full_content": "FALMOUTH, Maine — It’s harvest time on Casco Bay.\n\nBriana Warner is dressed for this late spring morning in padded rubber overalls, raincoat, rubber boots and neon yellow gloves that come up above her elbows. Just off the coast of Falmouth, she hangs off the side of a Zodiac boat and uses a gaff (hook) to hoist from the water a neon green buoy attached to a thick white rope. Warner struggles and finally gets her hands around the rope. The line drips with long, shimmering, translucent ribbons of green sugar kelp.\n\nSeaweed: An unusual snack for cows, a powerful fix for the climate\n\nWarner’s face lights up as she inspects the seaweed. “They’re ready for harvest,” she declares.\n\nAs the CEO and president ofAtlantic Sea Farms, the 38-year-old Warner is using seaweed to quietly revolutionize Maine’s struggling fishing industry.\n\nUp and down the Maine coast, thousands of lines like this have been planted by fishermen growing seaweed in partnership with her company. In the fall, the fishermen plant tiny kelp seeds on the 1,000-foot-long ropes, and by late spring, attached to each one is close to 6,000 pounds of fresh sugar kelp. The seaweed is harvested, flash frozen and used to make kelp cubes for smoothies, as well as seaweed salad, seaweed kraut and more.\n\nSeaweed is Maine’s new cash crop.\n\nFor generations, coastal Maine has been supported by a different underwater resource: the lobster. Lobstering is woven into virtually every aspect of life in coastal communities; tax revenue, jobs and the state’s identity depend on it. But as climate change causes Maine’s coastal waters to warm, underwater life, and the economy built around it, has shifted dramatically.\n\nTheGulf of Maine is warming faster than 96 percent of the world’s oceans— increasing at a rate of 0.09 degrees Fahrenheit per year. These warming temperatures have forced the lobster population to migrate north, seeking colder waters, and the impact on Maine fishermen has been profound.\n\nSeaweed is easy to grow, sustainable and nutritious. But it’ll never be kale.\n\nKeith Miller, 67, a second-generation lobsterman, has been lobstering for more than 50 years, fishing in Wheeler’s Bay between Spruce Head and Tenants Harbor. When he saw the dramatic impact of climate change on his industry, he knew he had to plan for the six months of the year — between fall and spring — when he couldn’t fish for lobster. He heard about a program in Rockland, Maine, at theIsland Institute, which helps coastal communities thrive, educating lobstermen about aquaculture.\n\n“I could choose between oyster farming, mussel farming or kelp,” Miller says in his thick Maine accent. “Water ’round here is too shallow for mussels, and oysters are a year-round job. I wanted to keep lobstering half the year, so I chose seaweed.”\n\nAt the time, Warner was the Island Institute’s first economic development officer. A former Foreign Service diplomat, she says she’s always been interested in “finding solutions rather than being part of the problem.” After serving in Libya, Guinea and several other countries, she moved to Maine with her husband, who grew up in the state, and started a family. Her goal was to apply her diplomatic skills to making a difference in the state’s coastal and food communities.\n\n“The question we asked was this: In communities where lobster is everything, how do we prepare for the future along the Maine coast and diversify to face climate change?” Warner says. “When you’re self-employed and your entire community is dependent on one industry, and you’re totally at the whim of Mother Nature, overdependence on one monoculture is very scary.”\n\nMiller is one of several dozen lobstermen accepted into the aquaculture program. He describes the past five years he’s spent farming seaweed in the “offseason” as “life changing.”\n\n“My first year kelping, I brought in 2,200 pounds,” he says. “But this year, my harvest was 170,000 pounds. I keep telling folks, ‘My ship is coming in!’”\n\nRoasted seaweed is the powerhouse ingredient in this pantry pasta\n\nIn summer 2018, Warner was offered the position of CEO at Atlantic Sea Farms. When she started, two kelp farms were yielding around 30,000 pounds total. The company now works with 27 partner farmers, and the 2022 harvest brought in just under 1 million pounds of seaweed. The company’s products are now sold in more than 2,000 stores across the country, as well as in restaurants and college cafeterias. In 2021, the company was responsible for 85 percent of the line-produced seaweed in the country.\n\nAnother farmer the company works with is Justin Papkee, 31, who fishes near Long Island in Casco Bay. “This country is way behind others in understanding how good kelp is for you and the environment,” Papkee says. “Briana is doing a great job figuring out ways to market it.”\n\nPapkee, who still lobsters year-round and farms kelp a few days a week during the harvest season, says he’s able to maintain his crew of three year-round and bring in extra income. Although he’s hesitant to talk about money, he says this year, after four seasons of kelp farming, he is “in the black.”\n\nWarner calls seaweed “a shock absorber against the volatility of the lobster industry.” When she talks about seaweed and the industry, her speech gains momentum and her passion is on display. “The best thing about kelp is that it is the most climate-friendly food you can eat!” Seaweed, she explains, is farmed without land, pesticides or fresh water.\n\nThe environmental benefits of growing seaweed go even further. “There’s so much carbon in the air, and when carbon hits the ocean surface, the ocean absorbs it and changes the pH and degrades shellfish,” Warner says. “Seaweed absorbs the carbon and nitrogen in the water. When you harvest seaweed, you are removing carbon with it and leaving behind a healthier body of water.”\n\nWarner is quick to point out that growing seaweed is not a climate change solution. “It is,” she explains, “a climate change adaptation strategy. It is better than anything else we can eat.” But seaweed, Warner says, can have a massive local climate change effect. To illustrate her point, she says that when mussels are planted on ropes underwater after a kelp harvest, the shell strength is almost twice as strong in those areas, thanks to the removal of the excess carbon.\n\nUntil recently, seaweed was always sold dried and, most often, came from Asia or was harvested from the wild in U.S. waters. Atlantic Sea Farms is one of several American companies that sells seaweed that is never dyed or dried. After it is flash frozen, it’s used to make kelp cubes, a nutritious boost to smoothies, salad dressings and sauces. In raw form, the seaweed adds crunch and a briny, umami-rich flavor to seaweed salad, Atlantic Sea Farms’ Sea-Beet Kraut and a take on kimchi called Sea-Chi.\n\nAccording to Lia Heifetz, 31, ofBarnacle Foodsin Juneau, Alaska, “seaweed is an ocean multivitamin.” It’s rich in potassium, iron, magnesium, calcium and antioxidants. Heifetz and her two partners harvest wild bull kelp seaweed, which is prolific around the shores of Juneau, as well as farmed kelp. Bull kelp is unique because it can grow a stipe (or stem) that is 30 feet long and, according to Heifetz, offers a unique texture and flavor similar to apples and fresh bell pepper. Barnacle Foods freezes the kelp and uses it to make hot sauce, salsa, pickles, Bloody Mary mixes and more. Heifetz hopes to increase the amount of kelp farming they do in coming years but says that in Alaska and many other parts of the country, obtaining permits and licenses involves lengthy hurdles.\n\n“We have a unique opportunity here in Alaska,” she says. “We have 30,000 miles of coast in the state, primarily undeveloped. Consumers are looking for a way to use their food dollars to support causes that are important to them. And seaweed checks all the boxes.”\n\nWarner has also been spreading the word about the power of seaweed. She was recently invited to the2022 Davos World Economic Forumto speak as part of a program for 20 “ecopreneurs.” She focused her talk on America’s “broken food system” and the potential for Maine’s seaweed aquaculture industry as “a model where people and the planet come first.” But mostly, she says, she tried to leave the top leaders who attended the annual summit with something positive.\n\n“What we’re doing with seaweed in Maine,” she told them, “is giving people hope and giving people an opportunity to take hold of their own future in the face of a very uncertain climate.”",
    "extraction_status": "success"
  },
  "https://www.wsj.com/science/environment/seaweed-us-food-cosmetics-atlantic-sea-farms-e34b8fb5_A Seaweed Crop Finds a Spot in Maine Waters": {
    "company": "Atlantic Sea Farms",
    "title": "A Seaweed Crop Finds a Spot in Maine Waters",
    "url": "https://www.wsj.com/science/environment/seaweed-us-food-cosmetics-atlantic-sea-farms-e34b8fb5",
    "source": "Wall Street Journal",
    "body": "Seaweed is making its way into more foods, cosmetics and even pet kibble. In the U.S., most of that seaweed is imported from Asia; in 2019, the U.S. produced just 0.01% of the world's seaweed.",
    "date": "2024-06-28",
    "full_content": "Listen to article\n\n(2 minutes)\n\nSeaweed is making its way into more foods, cosmetics and even pet kibble. In the U.S., most of that seaweed is imported from Asia; in 2019, the U.S. produced just0.01%of the world’s seaweed.\n\nExpanding seaweed aquaculture in the U.S. could provide an economic boost, particularly for fishermen whose livelihood might bethreatenedby the effects of climate change, proponents argue. As a crop, seaweed could also bring environmental benefits, like reducingocean acidificationand absorbing excess nutrients such asnitrogen and phosphorusthat can be harmful to marine life—though some scientists question whether seaweed would continue to impart these benefits if grown at large scales.\n\nCopyright ©2025Dow Jones & Company, Inc. All Rights Reserved. 87990cbe856818d5eddac44c7b1cdeb8",
    "extraction_status": "success"
  },
  "https://www.bizjournals.com/nashville/news/2018/05/29/jumpstart-foundry-announces-2018-portfolio-brings.html_Jumpstart Foundry announces 2018 portfolio, brings startups to Nashville": {
    "company": "VidaFuel",
    "title": "Jumpstart Foundry announces 2018 portfolio, brings startups to Nashville",
    "url": "https://www.bizjournals.com/nashville/news/2018/05/29/jumpstart-foundry-announces-2018-portfolio-brings.html",
    "source": "The Business Journals",
    "body": "Jumpstart Foundry brought 13 health care startups to Music City for two days of health care industry networking. Jumpstart Foundry announced its 2018 investment portfolio Tuesday, but the process ...",
    "date": "2018-05-29",
    "full_content": "Jumpstart Foundry brought 13 health care startups to Music City for two days of health care industry networking.",
    "extraction_status": "success"
  },
  "https://www.washingtonpost.com/climate-solutions/2021/09/21/pet-food-sustainable-bugs-insects/_Pets can help fight climate change with an insect-based diet. Owners just need to come around to the idea.": {
    "company": "Jiminy's",
    "title": "Pets can help fight climate change with an insect-based diet. Owners just need to come around to the idea.",
    "url": "https://www.washingtonpost.com/climate-solutions/2021/09/21/pet-food-sustainable-bugs-insects/",
    "source": "The Washington Post",
    "body": "A couple of years ago, Anne Carlson — the founder of Jiminy's, a dog food start-up — conducted a taste test with her dog, Timber. She filled half of his bowl with the meat-based food the ...",
    "date": "2021-09-21",
    "full_content": "A couple of years ago, Anne Carlson — the founder of Jiminy’s, a dog food start-up — conducted a taste test with her dog, Timber.\n\nShe filled half of his bowl with the meat-based food the Great Dane was used to eating, and she filled the other half with Jiminy’s Cricket Crave, a kibble made from cricket powder, oats, quinoa, sweet potato and other plant-based ingredients. Then she stood back as he dug in.\n\nTimber’s response was miraculous: He sniffed his options, then devoured the Cricket Crave and licked his lips contentedly, leaving the other side untouched.\n\n“It was one of those moments when you’re like, ‘Oh, this is so good,’ ” Carlson said. This summer, Petco stocked shelves in 800 stores with Jiminy’s dog food. Along with the surprise of seeing pets wolf down insects, Carlson says customers often tell her, “I didn’t even realize I could be fighting climate change with my dog.”\n\nA third of all food in the U.S. gets wasted. Fixing that could help fight climate change.\n\nMany pet owners reflexively bark “No!” when their dog or cat prepares to feast on a bug. But despite what scientists call the “yuck factor,” insects could be a sustainable secret ingredient for the booming pet food industry. About a quarter of Americans are cutting back on eating meat, many alarmed by the fact that livestock farming causes up to 15 percent of global greenhouse gas emissions. Yet for all the humans observing meatless Mondays, opting for Impossible burgers or swearing off meat entirely, 180 million furry members of U.S. households are fed beef, lamb, poultry or pork in just about every meal.\n\nResearchers at the University of California at Los Angelesestimatethat dogs and cats account for up to 30 percent of the environmental impact of U.S. meat consumption. If American pets made up their own country, they’d eat the fifth-most meat globally. And fueled by a surge of pandemic pet acquisitions, Americans now spend more than $40 billion annually on pet food and treats — with many stores offering almost exclusively traditional meat-based options.\n\nBut there are signs of a shift. Many pet food companies — including the two biggest, Mars and Nestlé — are developing insect-based alternatives for dogs and cats, and according to a Petco survey, 55 percent of customers like the idea of using sustainable alternative protein ingredients in pet food.\n\nMillennials, the fastest-growing contingent of pet owners,are keenon buying environmentally friendly products and willing to pay a premium for them, according to Francesca Mahoney, Petco’s head of sustainability.\n\n“There’s an appetite for pet parents to spend a little bit more if something resonates with their values,” Mahoney said. Petco wants half of its products to be sustainable by 2025.\n\nWould you eat insects to help save the planet? These companies are betting yes.\n\nFor now, some pet owners might balk at the higher price of these alternatives. Petco sells a 3.5-pound bag of Jiminy’s Cricket Crave for $21.95 — almost three times more than Purina’s chicken and rice dry food. But the cost of insects, driven up temporarily by nutritional testing and a supply chain with enormous room to scale, is expected to drop as the market grows.\n\nCarlson founded Jiminy’s in 2016, after reading a United Nations report identifying crickets as a sustainable source of food for humans. After all, insects are already a culinary staple in much of the world: grasshoppers fried in Thailand, worms floating in mezcal in Mexico, caterpillars boiled in the Congo. The edible insect market isprojectedto grow eightfold globally by 2030, to $8 billion.\n\nCarlson herself drinks smoothies with a dash of cricket powder. Her company sells Cricket Crave as well as Good Grub, which derives protein from black soldier fly larvae. As a pet food, “there are no compromises,” she said. “It’s humane. It’s hypoallergenic. It’s delicious.”\n\nAnd, Carlson added, insects produce something many pet owners obsessively monitor: “solid poops.” Crickets and fly larvae are similarly digestible to traditional meat and provide comparable protein, plus vital amino acids and other minerals, according to Kelly Swanson, an animal nutritional scientist at the University of Illinois.\n\nAlthough many pets eat the same menu of wet and dry food every day of their lives, Swanson says a rotational diet is often the most nutritious. When cutting back on meat, “it’s not all or nothing,” he says, adding that for his own diet, “I’ll take out one or two meat meals per week. With pets, 10 percent of protein coming from insects adds up sustainability-wise.”\n\nAn acre of land can produce about 192 pounds of beef annually, or 265 pounds of poultry, according to Carlson. The same spaceyields65,000 pounds of cricket or 130,000 pounds of black soldier fly larvae. Farming insects releases substantially less carbon and methane, and, according to Jiminy’s “carbon pawprint” calculator, switching a Golden Retriever to an insect-based diet saves 4.4 million gallons of water per year.\n\nMuch of Jiminy’s crickets come from Entomo Farms in Ontario, Canada. The company, which expects sales to increase fourfold this year, retrofitted rural chicken farms to house millions of crickets in climate-controlled “cabins.” One might think a barn full of crickets would be as deafening as a Toronto Raptors playoff game, but no: Crickets only chirp in old age, and Entomo’s crickets live 80 percent of their natural life span before being processed.\n\nMy name is Max, and I have a cicada problem: A tale of a dog who can’t stop eating the bugs\n\nIn August, the Association of American Feed Control Officials, an influential body for establishing pet nutritional standards, voted to approve black soldier fly larvae for dog food. (AAFCO has yet to issue a verdict on crickets.) Jiminy’s gets its dried fly larvae from Kentucky-based EnviroFlight, which opened the first commercial-scale U.S. fly farm in 2019. At any given time there are billions of creatures under one roof — about 5 percent flies and 95 percent larvae, living vertically up to 15 feet.\n\nFlies are raised in a “circular economy,” said EnviroFlight President Liz Koutsos, an animal nutritionist. They are fed with byproducts from local bourbon distilleries and bakeries, and the waste from larvae then goes toward animal feed. “Nothing ends up in the landfill,” Koutsos said.\n\nMany meat-based pet foods use animal byproducts humans won’t eat — mostly bones and organs like the spleen, kidney and heart — supposedly reducing their footprint. Caitlyn Dudas, executive director of the Pet Sustainability Coalition, says the pet food industry would be better off dialing back its dependence on factory livestock farming. “We are not clear of responsibility for the farming practices for our products” from animals, she said, whereas “insect protein is legitimately sustainable.”\n\nFor now, Europeans have a greater appetite to serve insects to their pets. Nestlé’s Purina line of insect-based dry dog food is sold in about 200 stores in Switzerland, and the company expects distribution to double by October. This spring, Mars — having found that 47 percent of Europeans would buy insect-based cat food — launched a black soldier fly larvae-based cat kibble, Lovebug, in the United Kingdom.\n\n“With protein sourcing, there is a symbiotic relationship between the human food supply chain and the pet supply chain,” said Deri Watkins, president of Mars Petcare’s European division. “I'd be surprised if five years from now, you're not seeing the option of insect protein on a mainstream supermarket shelf.”\n\nCan you eat cicadas? Yes, and here’s the best way to catch, cook and snack on them.\n\nCompanies are still refining how to market insects, too. When Jonathan Persofsky performed focus-group testing for his Green Gruff cricket-based dog treats, packages covered with images of bugs scored very poorly. When he explained the nutritional and environmental upside of crickets, however, 88 percent of people said they’d buy his product.\n\nMaryanne Murphy, a veterinary nutritionist at the University of Tennessee, isn’t surprised that people are turned off by the sight of bugs. The pet food industry already panders to human palettes, marketing such novelties as Memphis-style BBQ chicken for dogs and seafood paella for cats. “When I talk to [pet] owners about it, they say, ‘Would I want to eat insects?’ ” Murphy said.\n\nAlthough humans can easily cut back on mainstream meat options, many people question whether that’s true of their pets. Cats are called “obligate carnivores,” meaning they depend on the micronutrients found in meat. But “insect protein fulfills that need,” Watkins said, and at a minimum, cats and dogs appear to benefit from insects as a complementary protein source.\n\nD.C.-based Chippin also makes treats from cricket powder, plus dog foods made with spirulina or invasive carp. “It’s shocking,” CEO Haley Russell said, “that you see people walking through Whole Foods, putting plant-based foods in their reusable bags, but when you hit the pet food aisle so much of it is conventional meat protein.”\n\nAbout a year ago, Jonathan Carrion, owner of Brooklyn Tails Pet Food, began selling cricket treats. He liked that they’re high in protein, and remembered watching his cat enjoy eating insects she found outside.\n\nBut after displaying them in the front of his store, Carrion decided not to restock. “About 50 percent of customers thought crickets were disgusting,” he said, “like I told them it was made out of cockroaches.”\n\nUltimately, there’s still a major learning curve to overcome in the United States, even in the most environmentally conscientious neighborhoods. He thinks insect-based pet food companies should offer free samples or provide brochures, like CBD-based pet products do, to explain the many benefits of feeding insects to pets.\n\n“People who took samples would come right back, asking, ‘Hey, do you have any more cricket stuff?’ ” Carrion said. “Animals love it.”\n\nSign up for the latest news about climate change, energy and the environment, delivered every Thursday\n\nMore on climate change\n\nUnderstanding our climate:Global warming is a real phenomenon, and weather disasters areundeniably linked to it. As temperatures rise, heat waves are more often sweeping the globe — and parts of the world arebecoming too hot to survive.\n\nWhat can be done?The Post is tracking a variety ofclimate solutions. It can feel overwhelming facing the impacts of climate change, but there areways to cope with climate anxiety.\n\nInventive solutions:Some people have builtoff-the-grid homes from trashto stand up to a changing climate. As seas rise, others are exploringhow to harness marine energy.\n\nWhat about your role in climate change?Ourclimate coach Michael J. Corenis answering questions about environmental choices in our everyday lives.Submit yours here.You can alsosign up for our Climate Coach newsletter.",
    "extraction_status": "success"
  },
  "https://www.newsweek.com/6-best-dog-foods-small-dog-breeds-2021-1592986_The 6 Best Dog Foods for Small Dog Breeds in 2021": {
    "company": "Jiminy's",
    "title": "The 6 Best Dog Foods for Small Dog Breeds in 2021",
    "url": "https://www.newsweek.com/6-best-dog-foods-small-dog-breeds-2021-1592986",
    "source": "Newsweek",
    "body": "Among the best dog foods for small breeds are Blue Buffalo, Jiminy's and Merrick. Among the best dog foods for small breeds are Blue Buffalo, Jiminy's and Merrick. Our dogs mean everything to us ...",
    "date": "2021-05-21",
    "full_content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n\n🎙️ Voice is AI-generated. Inconsistencies may occur.\n\nOur dogs mean everything to us and, of course, we want them around forfur-ever. As pup parents, that means taking care of our little four-legged friends (ahem, children, really) the best we know how—from regular visits to the vet and groomer to feeding them healthy foods. Since nutrition and maintaining a healthy weight are particular concerns for small dog breeds, it's really important to feed your small dog the best of the best, the healthiest of the healthiest.\n\nSo, we vetted (pun intended) the top dog foods for the smallest of our furry friends. These are the six best dog foods designed for small dog breeds.\n\nThe Farmer's Dog is one of the most popular dog food subscription services to come about in recent years, with a laser focus on nutrition and using the best—meaning, the freshest—ingredients possible. Owners start by taking a quiz about their dog's health, weight, breed, etc. so that TFD can personalize food to each dog's unique needs. You can then specify how often you want to feed your dog (once or twice daily) and the proper portions based on your dog's size, breed, age and weight will show up at your doorstep. It's a meaningful option for all dogs—my dog is about 30 pounds, and this is what I personally feed her. But TFD is particularly good for small dog breeds, which may have more trouble maintaining a healthy weight, as well as picky eaters (as smaller dogs tend to be), and dogs with allergies. Speaking of allergies, if your dog has a chicken or turkey allergy, The Farmer's Dog beef recipe may be a better option.\n\nBuy at The Farmer's Dog.\n\nNom Nom is another convenient dog food subscription service that is personalized to your dog's individual nutrition needs. Formulated by board-certified veterinary nutritionist Dr. Justin Shmalberg, the Nom Nom Beef Mash recipe is fresh dog food made with fresh ingredients: ground beef, russet potatoes, eggs, carrots, peas and fish oil (for that shiny, shiny coat!). All of their ingredients are restaurant-quality and are sustainably sourced from their team of reliable U.S. growers and suppliers. Because the food is customizable to your dog's weight, age and breed, it's another awesome option for small breeds—both adults and puppies—particularly if they have trouble maintaining a healthy weight or have food allergies.\n\nBuy at Nom Nom.\n\nSmall but mighty! If that sounds like your dog, then this aptly named small breed dog food by trusted dog food brand Blue Buffalo might be the perfect fit. Real chicken is this food's first ingredient, and the formula is outfitted with omega 3 and other important fatty acids, essential vitamins and antioxidant-rich ingredients that keep your dog healthy and energized so they can keep playing catch all day long. While this dog food is better for adult doggos, it's specifically made for extra-small, small and toy breeds, so can you have peace of mind when feeding it to your pint-size pooch.\n\nBuy at Chewy.\n\nAvailable on Chewy in either a 4- or 10-pound bag, Merrick Classic Small Dog Food formula features essential vitamins, minerals and omega fatty acids for a balanced diet and, of course, real deboned chicken as its first ingredient. All of these ingredients work well together to promote healthy skin and fur, and the health of your doggy's hips and joints (which can be abig problemin some small breeds). Also free of potatoes, peas, and lentils, this food is formulated with quinoa for good digestion, making it best for small breed adult dogs.\n\nBuy at Chewy.\n\nJiminy's Good Grub Dog Food\n\nChicken, turkey, beef, salmon and even lamb—these are the most popular dog food flavors we've all heard of before. But crickets?! Meet Jiminy's, a sustainable and humane dog food brand that oven bakes their insect-based dog food and treats in the U.S. Jiminy's Good Grub Dog Food is one of our favorite options for small breeds because insect protein powder combined with oats, sweet potato, flaxseed and other plant-based ingredients makes for a nutrient-dense dog food that helps keep your pup at a healthy weight. Jiminy's Good Grub Dog Food is also significantly less processed than some other dog foods. That's because while other dog food companies prefer to extrude their food (that means baking under high pressure and in heat that cooks out the nutrients your dog needs), Jiminy's uses a small-batch baking process that's sustainable and results in a more nutritious meal for Spot. Jiminy's Good Grub kibbles are also pretty small—making them easily chewable and digestible for petite dogs (and their bellies).\n\nBuy at Petco.\n\nGrain-free and high-protein, Instinct Raw Boost Grain-Free Recipe With Real Chicken for Small Breed Dogs offers your small pup all the health benefits of araw dietbut in an accessible, non-yucky and long-lasting freeze-dried form. Cage-free chicken is the first protein-packed ingredient in this dog food specifically formulated for small dog breeds. It's meant to promote lean muscles and properly balance protein, fat and calories so that your tiny dog can maintain a healthy body weight. Made without grain, potato, corn, wheat, soy, artificial colors, by-product meal or preservatives, this small breed dog food can also help promote strong bones, teeth and joints thanks to high levels of calcium, phosphorus, glucosamine and chondroitin.\n\nBuy at Petco.\n\nNewsweek may earn a commission from links on this page, but we only recommend products we back. We participate in various affiliate marketing programs, which means we may get paid commissions on editorially chosen products purchased through our links to retailer sites.",
    "extraction_status": "success"
  },
  "https://www.forbes.com/health/medical-alert-systems/unaliwear-review/_UnaliWear Medical Alert Watch Review In 2025": {
    "company": "Unaliwear",
    "title": "UnaliWear Medical Alert Watch Review In 2025",
    "url": "https://www.forbes.com/health/medical-alert-systems/unaliwear-review/",
    "source": "Forbes",
    "body": "Our editors also may be in touch with follow-up questions. The water-resistant UnaliWear Kanega Watch is a medical alert device that provides automatic fall detection, 24/7 monitoring and ...",
    "date": "2024-02-15",
    "full_content": "The Forbes Health editorial team is independent and objective. To help support our reporting work, and to continue our ability to provide this content for free to our readers, we receive compensation from the companies that advertise on the Forbes Health site. This compensation comes from two main sources.First, we provide paid placements to advertisers to present their offers. The compensation we receive for those placements affects how and where advertisers’ offers appear on the site. This site does not include all companies or products available within the market.Second, we also include links to advertisers’ offers in some of our articles; these “affiliate links” may generate income for our site when you click on them.\n\nThe compensation we receive from advertisers does not influence the recommendations or advice our editorial team provides in our articles or otherwise impact any of the editorial content on Forbes Health. While we work hard to provide accurate and up-to-date information that we think you will find relevant, Forbes Health does not and cannot guarantee that any information provided is complete and makes no representations or warranties in connection thereto, nor to the accuracy or applicability thereof.\n\nHave a question for Eliene Augenbraun or our other editors?\n\nAsk here for a chance to be featured in a story.\n\nSend a note to\n                                                    Eliene Augenbraun,\n                                                    Carley Prendergast\n                                            and our other editors. We read every email.\n\nKeep reading Forbes Advisor for the chance to see the answer to your question in one of our upcoming stories. Our editors also may be in touch with follow-up questions.\n\nThe water-resistant UnaliWear Kanega Watch is a medical alert device that providesautomatic fall detection, 24/7 monitoring and emergency response assistance via voice activation, the press of a button or its easy-to-read screen. It also looks more like a digital watch than a medical alert device.FEATURED PARTNER OFFERWe receive compensation from our partners for Featured Partner Offer placements. While this may influence where their products or services appear on our site, it in no way affects our ratings, which are based on thorough research, solid methodologies and expert advice. Our partners cannot pay us to guarantee favorable review of their products or services.75% Off MGMiniUsing Code MEGASAVINGSMedical Guardian MGClassicStay active in and around your home with 1,300 feet of coverageConnects to your landline telephone32 hours of backup battery power for protection during power outagesTranslation services for emergency response available in 70 languagesAutomatic fall detection available for additional $10 per monthCall NowLearn MoreOn Medical Guardian's Website\n\nUnaliWear, Inc. is the manufacturer of the Kanega Watch, amedical alert watchthat offers 24/7 monitoring via a discreet wearable. “Unalii” is the Cherokee word for “friend” and “Kanega” means “speak,” so the product’s name translates to “friend that speaks to you,” according to the company’s website.\n\nThe Texas-based company was founded in April 2013 by CEO Jean Anne Booth, a serial entrepreneur and electrical engineer with 30 years of technology development experience. She retired after selling two other companies she founded, but she was inspired to rejoin the workforce to address problems faced by her mother, who was active but frail and wanted to age in place safely.\n\n“[S]ome of the best stuff I think gets created because of the need, and needs are just not being met in silver tech,” says Booth, noting that none of themedical alert systemsavailable in 2013 would have worked for her mother (theApple Watchdidn’t hit store shelves until April 2015). “Thependantis super stigmatizing. And the problem is even with a pendant, you take it off at night because of the threat of choking. Yet the number one cause of injury among older adults is falls—mostly in the bathroom and mostly at night,” explains Booth. “We realized we could build a watch that you could wear 24/7.”\n\nThe UnaliWear Kanega Watch is disguised discreetly as a digital wristwatch to avoid the potential stigma of wearing a medical alert device. It can interact with the wearer via voice, a push button and large white-on-black text on its screen. The watch is water-resistant, so users can wear it in the shower, although it’s not recommended for swimming. The watch comes with four rechargeable lithium-ion batteries, which can be swapped in and out without taking off the watch.\n\nWhen users first receive the watch, they provide UnaliWear with any relevant medical information.\n\nThe watch connects to the internet and an emergency response operator via Wi-Fi and runs exclusively on the Verizon 4G/5G cellular network nationwide. If an emergency occurs, (the user falls or calls for help), the watch’sGPScan help locate them. It also connects them to an emergency response operator in seconds.\n\nUnaliWear’s emergency response center is a U.S.-based, third-party provider that’s Five Diamond certified by TMA, the monitoring industry’s highest standard. The operators have each customer’s provided medical information on hand to help determine what kind of help should be sent when they receive a call.\n\nTo start talking to the Kanega Watch, say, “Fred Astaire,” and give it a command.\n\nSince no two people share identical falling patterns, the watch uses artificial intelligence (AI) to learn about each user’s movements. If the watch detects what might be a fall and the wearer tells the alert center that they didn’t fall, the AI learns to ignore similar movements of that user in the future.\n\nThe watch face includes a black screen with white text and comes in three accent colors: rose gold, champagne gold and black. Each watch strap is black no matter the accent color selected.\n\nUnaliWear offers two monitoring subscription options for the Kanega Watch: the annual plan and the monthly plan.\n\nFor the annual plan, users pay for device setup and 12 months of service upfront. Costs include a $199 one-time setup fee and$59.95 per month for ongoing monitoring and service. The total upfront cost is $918.40.\n\nFor the monthly plan, users pay for device setup and the first month of service upfront. Costs include a $299 one-time setup fee and$69.95 for one month of monitoring service, totaling $368.95 upfront.",
    "extraction_status": "success"
  },
  "https://www.businesswire.com/news/home/20221114005009/en/BrainCheck-Awarded-1.5M-Grant-by-US-Small-Business-Innovation-Research-SBIR-Program-to-Measure-Effectiveness-of-Digital-Cognitive-Care-Management-Platform_BrainCheck Awarded $1.5M Grant by US Small Business Innovation Research (SBIR) Program to Measure Effectiveness of Digital Cognitive Care Management Platform": {
    "company": "BrainCheck",
    "title": "BrainCheck Awarded $1.5M Grant by US Small Business Innovation Research (SBIR) Program to Measure Effectiveness of Digital Cognitive Care Management Platform",
    "url": "https://www.businesswire.com/news/home/20221114005009/en/BrainCheck-Awarded-1.5M-Grant-by-US-Small-Business-Innovation-Research-SBIR-Program-to-Measure-Effectiveness-of-Digital-Cognitive-Care-Management-Platform",
    "source": "Business Wire",
    "body": "LAS VEGAS--(BUSINESS WIRE)--BrainCheck Inc., developer of the innovative digital cognitive assessment and care management platform, today announced a $1.5M grant award from the Small Business ...",
    "date": "2022-11-14",
    "full_content": "BrainCheck Awarded $1.5M Grant by US Small Business Innovation Research (SBIR) Program to Measure Effectiveness of Digital Cognitive Care Management Platform\n\nThe award will be used to study BrainCheck CARE, the company’s end-to-end digital cognitive care management platform\n\nLAS VEGAS--(BUSINESS WIRE)--BrainCheck Inc., developer of the innovative digital cognitive assessment and care management platform, today announced a $1.5M grant award from theSmall Business Innovation Research(SBIR) program. Known as “America’s Seed Fund,\" SBIR is a U.S. government funding program for small businesses designed to advance commercialization of innovative solutions. The grant will be used to fund a new study to deploy BrainCheck® CARE™ in diverse patient populations and measure its ability to improve health outcomes and quality metrics for health systems and payors.\n\nSixty percent of people living with dementia areundiagnosed, due in large part to insufficient access to cognitive assessment. Only half of older adults have received even the most basic testing, and only 16% receive regular monitoringassessments. These numbers are remarkably low, despite growing research highlighting the importance of early intervention to slow disease progression, improve patients’ quality of life, and prolong functional independence. Studies suggest that up to forty percent of dementia can be prevented or slowed with early intervention. However, for these interventions to work, physicians must create a holistic plan, educate patients and their care partners, and monitor the results.\n\nEffective cognitive care planning as currently practiced by pencil-and-paper is time consuming, logistically challenging, and impractical for most providers. As a result, cognitive care planning is rare. BrainCheck CARE provides clinicians with an easy-to-use, digital workflow that guides patients, care partners and other providers through the collaborative process of creating and implementing a cognitive care plan. By mapping care plan recommendations to cognitive assessments, BrainCheck CARE is personalized, focusing on the areas of deficit specific to each patient. Built-in patient education and repeat assessment and monitoring mean that the care plans are continually enhanced and optimized. Cognitive care planning, and the resulting improvement in dementia care management, can meaningfully alleviate disease burden for patients and caregivers. BrainCheck CARE is substantially enhancing the efficiency, implementation, and impact of cognitive care planning, thus transforming routine dementia care.\n\n“The grant from SBIR is recognition of BrainCheck’s innovative approach to the massive unmet need for cognitive healthcare,” said Yael Katz, PhD, co-founder and CEO of BrainCheck. “BrainCheck CARE has the potential to transform the dementia assessment, diagnosis, and care management process for physicians, patients, and caregivers. This SBIR grant will enable us to formally evaluate the impact of our platform in the real world and use the results to guide improvements and new features.”\n\nBrainCheck’s new study is the next step in a series of research projects to identify and remove barriers to cognitive care and align their solution with provider needs and priorities. This study will quantify the extent to which BrainCheck CARE improves operational efficiency, usability, and provider engagement with cognitive care planning compared to a manual, ad-hoc approach. The study will also compare the short- and longer-term impacts of BrainCheck CARE on the health and well-being of patients and their caregivers.\n\n“This new study is an important next step for our team to continue examining the BrainCheck CARE platform and its ability to impact patient outcomes,” said Dr. Reza Ghomi, Neurologist, Psychiatrist and Chief Medical Officer at BrainCheck. “Post-diagnosis care planning is critical to increasing time at home, preventing hospitalization, and respecting patient’s wishes. Physicians must be empowered with the resources to provide this.”\n\nBrainCheck is being used in more than 500 clinical practices and enterprise health systems, including UPMC, Advocate Aurora, and Mercy, with over 150,000 BrainCheck assessments administered.\n\nThe BrainCheck CARE platform will be demonstrated at HLTH in Las Vegas from November 13 - 16, Booth 539 (Venetian Level 2: Exhibit Hall). To schedule a demo, contact Zach Beasley (zach@braincheck.com).\n\nAbout BrainCheck® Inc.BrainCheck® provides rapid, mobile cognitive assessment and decision support technology to physicians, empowering them to deliver high-quality, personalized cognitive health care to patients everywhere. This helps patients live better and safer lives at home, decreases caregiver frustration, and lowers the total cost of care. To schedule a demo or learn more about BrainCheck clickhere. Connect with BrainCheck onLinkedInand follow @BrainCheck onTwitter.\n\nSmall Business Innovation Research (SBIR)TheSmall Business Innovation Research(SBIR) and Small Business Technology Transfer (STTR) programs are highly competitive programs that encourage domestic small businesses to engage in Federal Research/Research and Development (R/R&D) with the potential for commercialization. By including qualified small businesses in the nation's R&D arena, high-tech innovation is stimulated, and the United States gains entrepreneurial spirit as it meets its specific research and development needs.\n\nMedia:Zach Beasleymarketing-team@braincheck.com+1 919 608 5636\n\nMedia:Zach Beasleymarketing-team@braincheck.com+1 919 608 5636\n\nMedia:Zach Beasleymarketing-team@braincheck.com+1 919 608 5636",
    "extraction_status": "success"
  },
  "https://www.fiercehealthcare.com/digital-health/relaxation-app-vr-startup-flowly-rolls-out-program-providers_Flowly, VR-enabled app to manage chronic pain and stress, rolls out program for providers": {
    "company": "Flowly",
    "title": "Flowly, VR-enabled app to manage chronic pain and stress, rolls out program for providers",
    "url": "https://www.fiercehealthcare.com/digital-health/relaxation-app-vr-startup-flowly-rolls-out-program-providers",
    "source": "Fierce Healthcare",
    "body": "Flowly, an app for autonomic nervous system regulation, has launched a program for providers, the company has shared exclusively with Fierce Healthcare. Through the program, providers will receive ...",
    "date": "2023-03-13",
    "full_content": "Flowly, an app for autonomic nervous system regulation, has launched a program for providers, the company has shared exclusively with Fierce Healthcare.\n\nThrough the program, providers will receive a virtual reality headset, a heart rate sensor, an onboarding session and access to a portal tracking patient progress.\n\nFounded in 2020, Flowly relies on the stimulating and immersive nature of VR to draw a user’s attention away from pain. By being able to visualize one’s heart rate and breathing, users can learn to regulate their nervous system. The company has gone through several clinical trials, received a grant from the National Institutes of Health and also participated in Y Combinator.\n\nDuring COVID-19, Flowly saw an influx in providers interested in its product—for use on themselves, co-founder and CEO Celine Tien told Fierce Healthcare. They were also eager to receive information about innovative ways to use pain management and anxiety therapies. “The problem with our healthcare model today is that so many providers live in their own silos,” Tien said.\n\nTo help bridge gaps in knowledge, Flowly created a founding board of physicians, with 15 active members, where they share creative ways of using Flowly in practice. Members of the board also get access to the latest research, data and features from Flowly and can offer feedback to improve the product. Some members also work with Flowly to design lectures on their domain expertise. Nearly all members of the board have used Flowly themselves, Tien said.\n\nJaimee Arnoff, Ph.D., a licensed clinical psychologist specializing in young adults, initially heard about Flowly on a podcast. As someone with chronic pain, Arnoff reached out to try the product. “As a provider, I always love to try any app,” Arnoff told Fierce Healthcare, especially one she might suggest to her clients.\n\nAfter using Flowly for a few months, she was convinced it was worth recommending to her patients as an option. “It was great to kind of focus on something so all-consuming,” Arnoff said. “It’s beautiful; it’s relaxing.”\n\nPatients can use Flowly before, during or after a treatment session to help calm their nervous system. “There are many days with clients where we are asking them to lean into this very uncomfortable place,” Arnoff said. “Flowly is a great way to kind of debrief and kind of come down from a heightened state of emotional or physical state that we might find ourselves in together.”\n\nSome of Arnoff’s patients buy Flowly for their personal use outside of treatment sessions.\n\nFlowly currently has more than 10,000 users and is so far used by more than 100 providers.",
    "extraction_status": "success"
  },
  "https://civileats.com/2022/03/16/can-small-seaweed-farms-help-kelp-scale-up/_Can Small Seaweed Farms Help Kelp Scale Up?": {
    "company": "Atlantic Sea Farms",
    "title": "Can Small Seaweed Farms Help Kelp Scale Up?",
    "url": "https://civileats.com/2022/03/16/can-small-seaweed-farms-help-kelp-scale-up/",
    "source": "Civil Eats",
    "body": "Atlantic Sea Farms, the first commercial edible seaweed farm in the U.S.—founded in 2006 under the name Ocean Approved—is poised to take advantage of the moment. When Briana Warner, 37, took over as CEO in mid-2018, the Maine-based company was ...",
    "date": "2022-03-16",
    "full_content": "While some farms plan to grow massive quantities of kelp, Atlantic Sea Farms is counting on Maine’s small-scale fishermen to expand the industry and distribute ownership.",
    "extraction_status": "success"
  },
  "https://techcrunch.com/2023/08/29/refiberd-textile-waste-sorting/_Refiberd sews up $3.4M seed round to use its AI to tackle textile waste": {
    "company": "Refiberd",
    "title": "Refiberd sews up $3.4M seed round to use its AI to tackle textile waste",
    "url": "https://techcrunch.com/2023/08/29/refiberd-textile-waste-sorting/",
    "source": "TechCrunch",
    "body": "It represents almost 6% of all solid waste in the U.S. \"It's crazy when you think about volumes here,\" Sarika Bajaj, co-founder and CEO of Refiberd, told TechCrunch+. For many years ...",
    "date": "2023-08-29",
    "full_content": "The fashion industry is sitting on a heaping pile of a problem. Over 14 million tons of clothing is either landfilled or incinerated every year, according to theEPA. It represents almost 6% of all solid waste in the U.S.\n\n“It’s crazy when you think about volumes here,” Sarika Bajaj, co-founder and CEO ofRefiberd, told TechCrunch+.\n\nFor many years, the best outcome for clothing that wasn’t donated to a thrift store (or didn’t make the cut there) was to become rags for industrial use. Even those eventually end up in the trash.\n\nMore recently, research into chemical recycling of textiles has been notching a series of successes, and companies have been working tocommercialize the technology. But here again, they’re running into roadblocks. Each textile has a specific blend, and some come festooned with contaminants like buttons or embroidery. If a recycler’s chemical process is to work correctly, they have to know exactly what they’re putting into the mix.\n\nThat’s where Refiberd hopes to stitch up the gap. Bajaj and her co-founder, Tushita Gupta, founded the company three years ago to figure out a technical approach to solve this problem of sorting textiles to enable true textile-to-textile recycling.\n\nAlong the way, the industry caught up. “This seems to be a real problem,” Bajaj said. Accurately sorting textiles “is the main gap that everyone’s seeing in the industry.”\n\nSorting is challenging for a variety of reasons. For one, clothing comes in a range of different materials, and those materials are combined in a variety of different ways. Many today are blended with spandex to give consumers the stretchiness they desire. Others come with multiple layers of different materials — think of a nylon-lined wool blazer, for example.\n\nFor a recycler, those blends and mixes pose challenges. Chemical recycling processes all use different approaches. Some are more tolerant of contaminants than others, but a few kinds of textiles can really gum up the works. Spandex is high on the list.\n\n“It’s in everything; it’s literally in everything,” Bajaj said. “And up to even 1% can cause an issue for them. How can you make sure you’re quantifying that?”\n\nRefiberd’s solution is to point hyperspectral cameras, which sample dozens to hundreds of different bands of light, at the problem. Then they use artificial intelligence to analyze the resulting image to help differentiate between thousands of different textiles.\n\nThe startup has spent the last few years testing the equipment, building the neural networks and assembling a massive sample library with over 10,000 entries. “We’ve worked very hard with manufacturers” to obtain those samples, Bajaj said.\n\nStill, even a 10,000-sample library isn’t going to capture the full range of possible material combinations that a recycler is or isn’t going to see. So Refiberd has employed generative AI to fill in the gaps. The generated “material” may not be anything anyone would make, Bajaj said, but having its spectra on hand helps the model improve its accuracy.\n\nRefiberd has raised a $3.4 million seed round, TechCrunch+ has exclusively learned. The round was led by True Wealth Ventures, with participation by Better Ventures, the Schmidt Family Foundation, Fashion for Good, Susquehanna Private Equity Investments, Kubera Venture Capital, Carnegie Mellon University, and the National Science Foundation.\n\nThe startup also won a €200,000 grant from the H&M Foundation’s Global Change Award, an amount that’s included in the seed round figure.\n\nThe funding will be used to roll out Refiberd’s initial pilots, which are aimed at textile companies, chemical recyclers, mechanical recyclers and textile sorters. All have different demands, which Bajaj said will help Refiberd refine its product.\n\nOne camera unit will eventually be able to sort up to 7 million pounds of material, Bajaj said. Some quick back-of-the-envelope math suggests that just 4,000 Refiberd units could tackle America’s textile waste problem.\n\nIf Refiberd could address just a fraction of the world’s textile waste, it could make a significant dent in the solid waste space. Textile recycling has largely been ignored for a few reasons. One, it’s not an easy problem to tackle because of the broad mix of materials. Second, there’s not been much consumer pressure: Lots of textile waste happens out of sight, and unsold or returned merchandise frequently gets scrapped or landfilled. Donated clothing does, too, especially if it doesn’t meet the minimum standards set by thrift stores, or if it sits on the shelf for too long.\n\nAI is nothing new in the recycling industry, but Refiberd’s approach appears to break fresh ground both in its application to textile recycling and hyperspectral imagery. The use of generative AI to fill in the gaps is particularly clever, and suggests uses well beyond the usual chatbots that we see proliferating today.\n\nWith a seed round under its belt, the young startup still has many mountains to climb. But its founders had a hunch and stuck with it while the rest of the industry came around to their vision. That’s an enviable position to be in.\n\nTopics\n\nSenior Reporter, Climate\n\nThink you know AI? Prove it. With the countdown to TC Sessions: AI underway, it’s your chance to flex your AI knowledge—and score 2 tickets for the price of 1. Answer a few quick AI trivia questions to start your challenge. Special trivia deal ends June 4.\n\nOne of Africa’s most successful founders is back with a new AI startup and already raised $9M\n\nWindsurf says Anthropic is limiting its direct access to Claude AI models\n\nAnthropic’s AI is writing its own blog — with human oversight\n\nNow Deel is accusing Rippling of spying by ‘impersonating’ a customer\n\nGoogle places another fusion power bet on TAE Technologies\n\nThe OpenAI board drama is reportedly turning into a movie\n\nPhone chipmaker Qualcomm fixes three zero-days exploited by hackers",
    "extraction_status": "success"
  },
  "https://markets.businessinsider.com/news/stocks/dermala-a-consumer-dermatology-company-announces-issuance-of-the-second-u-s-patent-covering-the-use-of-novel-human-microbiome-technology-for-treating-acne-vulgaris-1030899083_DERMALA, A Consumer Dermatology Company, Announces Issuance of the Second U.S. Patent Covering the Use of Novel Human Microbiome Technology for Treating Acne Vulgaris": {
    "company": "Dermala",
    "title": "DERMALA, A Consumer Dermatology Company, Announces Issuance of the Second U.S. Patent Covering the Use of Novel Human Microbiome Technology for Treating Acne Vulgaris",
    "url": "https://markets.businessinsider.com/news/stocks/dermala-a-consumer-dermatology-company-announces-issuance-of-the-second-u-s-patent-covering-the-use-of-novel-human-microbiome-technology-for-treating-acne-vulgaris-1030899083",
    "source": "Business Insider",
    "body": "SAN DIEGO, Oct. 26, 2021 /PRNewswire/ -- DERMALA, a consumer dermatology company developing novel, personalized, microbiome-powered solutions for chronic skin conditions, announced today the ...",
    "date": "2021-10-26",
    "full_content": "SAN DIEGO,Oct. 26, 2021/PRNewswire/ -- DERMALA, a consumer dermatology company developing novel, personalized, microbiome-powered solutions for chronic skin conditions, announced today the issuance of the U.S. Patent No. 11,154,522 -COMPOSITIONS AND METHODS FOR TREATING ACNE VULGARIS. This is the second patent in DERMALA's intellectual property portfolio that covers using the human microbiome to treat and prevent acne.\n\nAcneisthe most common skin condition that affectsover 80% of adolescents. It often persists into adulthood with a negative impact on the quality of life. Acne vulgaris is characterized by microbiome dysbiosis associated with an overgrowth ofC. acnesbacteria, followed by inflammation of skin follicles. To date, many strategies have been used to treat acne. However, they often show limited efficacy accompanied by side effects, in part due to suboptimal delivery into the skin and lack of targeting.\n\nDERMALA developed a novel technology for enhanced targeted delivery of human microbiome-derived postbiotic metabolites into specific layers of the skin. This results in higher treatment efficacy due to targeted inhibition ofC. acnesin follicles and reducing inflammation while avoiding side effects. The microbiome-derived postbiotics derived from beneficial bacteria help correct the microbiome dysbiosis associated with acne and produce faster and longer-lasting results.\n\n\"Targeted delivery is critical for overcoming side effects and achieving high treatment efficacy,\" said Dr. Lada Rasochova, founder and CEO of DERMALA. \"Granting of this patent recognizes the uniqueness of our delivery approach and further enhances the value of our microbiome technology as it allows for formulating microbiome-derived ingredients into specific, efficacious, and effective topical products\".\n\nThis patent is an important part of the fast-expanding DERMALA's intellectual property portfolio which focuses on using the human microbiome for improving skin health and treating skin conditions like acne and eczema.\n\nAbout DERMALADERMALA, Inc. is aSan Diego-based consumer dermatology company leveraging a scientific understanding of the human microbiome and data analytics to develop novel treatments for chronic skin conditions. The company's #FOBO®(Fear of Breaking Out) Kit, a personalized, microbiome-powered solution for acne, combines patented topical treatments and oral supplements with the DERMALA Acne Tracker app that customers use to track their skin health and get their product formulations optimized. For more information, visitwww.dermala.com.\n\nPress Contact:Erica@LazarusPR.com\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/dermala-a-consumer-dermatology-company-announces-issuance-of-the-second-us-patent-covering-the-use-of-novel-human-microbiome-technology-for-treating-acne-vulgaris-301408177.html\n\nSOURCE  DERMALA",
    "extraction_status": "success"
  },
  "https://finance.yahoo.com/news/dar-bioscience-rosy-wellness-announce-120000637.html_Daré Bioscience and Rosy Wellness Announce Strategic Collaboration to Educate and Market Daré's DARE to PLAY Sildenafil Cream": {
    "company": "Rosy Wellness",
    "title": "Daré Bioscience and Rosy Wellness Announce Strategic Collaboration to Educate and Market Daré's DARE to PLAY Sildenafil Cream",
    "url": "https://finance.yahoo.com/news/dar-bioscience-rosy-wellness-announce-120000637.html",
    "source": "Yahoo Finance",
    "body": "Collaboration will leverage Rosy Wellness' extensive reach and community of over 250,000 women Rosy Wellness is a multi-award winning app recommended by 8,000+ healthcare professionals Daré expects to start recording revenue in the 4th quarter this year SAN DIEGO,",
    "date": "2025-06-04",
    "full_content": "Collaboration will leverage Rosy Wellness’ extensive reach and community of over 250,000 women\n\nRosy Wellness is a multi-award winning app recommended by 8,000+ healthcare professionals\n\nDaré expects to start recording revenue in the 4th quarter this year\n\nSAN DIEGO, June 04, 2025 (GLOBE NEWSWIRE) -- Daré Bioscience, Inc. (NASDAQ: DARE), a biopharmaceutical company driven by a mission to challenge the status quo, making women's health a priority, and Rosy Wellness, a pioneering digital platform focused on providing lifespan support for women, today announced a strategic collaboration to support the upcoming marketing and consumer and healthcare provider awareness campaign for Daré’s DARE to PLAY Sildenafil Cream.\n\nDaré’s DARE to PLAY Sildenafil Cream is a proprietary topical formulation of sildenafil citrate, the same active ingredient in Viagra®, developed specifically to increase blood flow locally to genital tissues, which is part of the sexual arousal response in women. The company is targeting availability by prescription in the United States in the 4thquarter 2025 as a compounded drug under Section 503B of the FDCA.\n\nThis partnership brings together Daré’s clinical expertise and innovation in women's health with Rosy’s digital reach and content-driven community engagement model, which includes a community of 250K+ women. Concerns with arousal were reported by 65% of those women who completed the Female Sexual Function Index screener questionnaire. The collaboration will center on educational outreach, consumer and healthcare provider engagement, and companion digital support to destigmatize conversations around female sexual health and promote awareness of DARE to PLAY Sildenafil Cream, helping women regain intimacy and satisfaction in their lives.\n\n“Female sexual health remains significantly underserved, and we believe our DARE to PLAY Sildenafil Cream represents a meaningful advancement,” said Sabrina Martucci Johnson, President and CEO of Daré Bioscience. “Partnering with Rosy allows us to connect with women in a trusted, authentic space that encourages open discussion and education about sexual wellness.”\n\nRosy, known for its innovative and evidence-based approach to women’s sexual health through education, CBT-based (Cognitive Behavioral Therapy) exercises, expert-led health coaching, and community support, will support the launch with a comprehensive digital strategy including educational campaigns, and a companion care platform aimed at increasing understanding of female sexual health and supporting DARE to PLAY Sildenafil Cream’s users throughout their journey.\n\n“At Rosy, we’re committed to closing gaps in women’s healthcare with evidence-based, accessible solutions,” said Lyndsey Harper, MD, Founder and CEO of Rosy. “This partnership with Daré accelerates our efforts to bring much needed attention and resources to sexual wellness, a historically stigmatized area. Together, we can expand sexual wellness education, access, and support for women.\"\n\nThe partnership underscores a shared commitment to advancing sexual health equity and ensuring women have access to both the information and solutions they need.\n\nFor more information, please visitwww.darebioscience.comandwww.meetrosy.com.\n\nAbout Rosy Wellness\n\nRosy is a leading women's health platform dedicated to empowering women with evidence-based resources, expert support, and community connection, starting with sexual health and expanding across the full spectrum of the health of women. Founded by Lyndsey Harper, a board-certified OB-GYN, Rosy addresses long-overlooked aspects of women's care through an accessible digital platform that combines personalized education, self-guided tools, community, and health coaching.\n\nWhether tackling issues like sexual dysfunction, menopause, migraine, or emotional well-being, Rosy provides judgment-free, medically backed support designed for real life. By combining evidence-based support with user-friendly technology, Rosy is redefining how women take charge of their health and experience more fulfilling lives.\n\nAbout Daré Bioscience\n\nDaré Bioscience is a biopharmaceutical company driven by a mission to challenge the status quo, making women's health a priority. Daré believes that innovation does not have to start from scratch. The company’s goal is to bring to market as soon as practicable innovative evidence-based solutions that address decades of unmet needs in women’s health and enhance outcomes and convenience, primarily in the areas of contraception, sexual health, pelvic pain, fertility, infectious disease, vaginal health and menopause. The potential products Daré identifies, in many cases, already have clinical proof of concept or existing safety data for the active ingredient that the company leverages. This provides optionality and flexibility, in many cases, in how Daré seeks to bring solutions to market in ways designed to optimize access for women in a fiscally responsible manner.\n\nThe first FDA-approved product to emerge from Daré’s portfolio of women’s health product candidates is XACIATO™ (clindamycin phosphate) vaginal gel 2%, a lincosamide antibacterial indicated for the treatment of bacterial vaginosis in female patients 12 years of age and older, which is under a global license agreement with Organon. Visit www.xaciato.com for information about XACIATO. Daré’s portfolio also includes potential first-in-category candidates in clinical development: Ovaprene®, a novel, hormone-free monthly intravaginal contraceptive whose U.S. commercial rights are under a license agreement with Bayer; Sildenafil Cream, 3.6%, a novel cream formulation of sildenafil citrate, the active ingredient in an oral erectile dysfunction drug for men, to treat female sexual arousal disorder (FSAD); and DARE-HRT1, a combination bio-identical estradiol and progesterone intravaginal ring for menopausal hormone therapy. To learn more about Daré’s full portfolio of women’s health product candidates and mission to deliver differentiated therapies for women, please visit www.darebioscience.com.\n\nDaré Bioscience leadership has been named on the Medicine Maker’s Power List and Endpoints News’ Women in Biopharma and Daré's CEO has been honored as one of Fierce Pharma’s Most Influential People in Biopharma for Daré’s contributions to innovation and advocacy in the women’s health space.\n\nDaré may announce material information about its finances, product and product candidates, clinical trials and other matters using the Investors section of its website (http://ir.darebioscience.com), SEC filings, press releases, public conference calls and webcasts. Daré will use these channels to distribute material information about the company and may also use social media to communicate important information about the company, its finances, product and product candidates, clinical trials and other matters. The information Daré posts on its investor relations website or through social media channels may be deemed to be material information. Daré encourages investors, the media, and others interested in the company to review the information Daré posts in the Investors section of its website and to follow these X (formerly Twitter) accounts: @SabrinaDareCEO and @DareBioscience. Any updates to the list of social media channels the company may use to communicate information will be posted in the Investors section of Daré’s website.\n\nForward-Looking Statements\n\nDaré cautions you that all statements, other than statements of historical facts, contained in this press release, are forward-looking statements. Forward-looking statements, in some cases, can be identified by terms such as “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “design,” “intend,” “expect,” “could,” “plan,” “potential,” “predict,” “seek,” “should,” “would,” “contemplate,” “project,” “target,” “objective,” “on track,” or the negative version of these words and similar expressions. In this press release, forward-looking statements include, but are not limited to, statements relating to Daré’s go-to-market strategies; Daré’s plans and timing for making its proprietary formulation of sildenafil citrate available by prescription in the U.S. as a compounded drug via Section 503B of Federal Food, Drug, and Cosmetic Act (FDCA); the market opportunity for the product and its ability to gain market acceptance; expected timing of revenue from sales; the potential benefits of Daré’s collaboration with Rosy Wellness; and Daré’s development plans for the investigational products in its portfolio and their respective potential to complete clinical development and obtain regulatory approval. As used in this press release, “first-in-category” is a forward-looking statement relating to the potential of a product candidate to represent a new category of product if it were to receive marketing approval for the indication for which it is being developed because Daré believes it would address a need in women’s health that is not being met by existing U.S. Food and Drug Administration (FDA)-approved products. Forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause Daré’s actual results, performance or achievements to be materially different from future results, performance or achievements expressed or implied by the forward-looking statements in this press release, including, without limitation, risks and uncertainties related to: Daré’s ability to raise additional capital when and as needed to execute its business strategy and continue as a going concern; the risk of delisting of Daré’s common stock from Nasdaq; the effects of macroeconomic conditions, geopolitical events, and major changes and disruptions in U.S. government policies and operations on Daré’s ability to raise additional capital or on Daré’s operations, financial results and condition, and ability to achieve current plans and objectives; Daré’s ability to enter into and maintain third-party collaborations to facilitate access to the solutions Daré intends to bring to market as compounded drugs or consumer health products and Daré’s reliance on those third parties; the performance of Section 503B-registered outsourcing facilities and other third parties on which Daré will rely to execute its expanded business strategy; the risk that the FDA could stop permitting Section 503B-registered outsourcing facilities to compound the drug substances in the proprietary formulations Daré intends to bring or brings to market; the degree of market demand and acceptance for the products Daré brings to market; Daré’s reliance on third parties to manufacture and conduct clinical trials and preclinical studies of its product candidates and commercialize XACIATO™ (clindamycin phosphate) vaginal gel 2% and future products, if any; the risk that the current regulatory pathway known as the FDA’s 505(b)(2) pathway for drug product approval in the U.S. is not available for a product candidate as Daré anticipates; Daré’s ability to achieve the product development and other milestones required for it to receive payments under its subaward and grant agreements; the potential for termination of the subaward and grant agreements before Daré receives additional payments; the limits on Daré’s ability to sell stock under its equity line arrangement at times it may desire to raise additional capital; Daré’s ability to develop, obtain FDA or foreign regulatory approval for, and commercialize its product candidates and to do so on communicated timelines; failure or delay in starting, conducting and completing clinical trials of a product candidate and the inherent uncertainty of outcomes of clinical trials; Daré’s ability to design and conduct successful clinical trials, to enroll a sufficient number of patients, to meet established clinical endpoints, to avoid undesirable side effects and other safety concerns, and to demonstrate sufficient safety and efficacy of its product candidates; Daré’s dependence on third parties to conduct clinical trials and manufacture and supply clinical trial material and commercial product; the risks that positive findings in early clinical and/or nonclinical studies of a product candidate may not be predictive of success in subsequent clinical and/or nonclinical studies of that candidate and that interim data or results from a particular clinical study do not necessarily predict the final results for that study; the risk that the FDA, other regulatory authorities, members of the scientific or medical communities or investors may not accept or agree with Daré’s interpretation of or conclusions regarding data from clinical studies of its product candidates; the risk that development of a product candidate requires more clinical or nonclinical studies than Daré anticipates; the loss of, or inability to attract, key personnel; the risk that developments by competitors make Daré’s product or product candidates less competitive or obsolete; difficulties establishing and sustaining relationships with development and/or commercial collaborators; failure of Daré’s product or product candidates, if approved, to gain market acceptance or obtain adequate coverage, pricing and reimbursement from third-party payors; Daré’s ability to retain its licensed rights to develop and commercialize a product or product candidate; Daré’s ability to satisfy the monetary obligations and other requirements in connection with its exclusive, in-license agreements covering the critical patents and related intellectual property related to its product and product candidates; Daré’s ability to adequately protect or enforce its, or its licensor’s, intellectual property rights; the lack of patent protection for the active ingredients in certain of Daré’s product candidates which could expose its products to competition from other formulations using the same active ingredients; product liability claims; governmental investigations or actions relating to Daré’s products or product candidates or the business activities of Daré, its commercial collaborators or other third parties on which Daré relies; the impact of pharmaceutical industry regulation and health care legislation in the United States and internationally; global trends toward health care cost containment; cybersecurity incidents or similar events that compromise Daré’s technology systems or those of third parties on which it relies and/or significantly disrupt Daré’s business; and disputes or other developments concerning Daré’s intellectual property rights. Daré’s forward-looking statements are based upon its current expectations and involve assumptions that may never materialize or may prove to be incorrect. All forward-looking statements are expressly qualified in their entirety by these cautionary statements. For a detailed description of Daré’s risks and uncertainties, you are encouraged to review its documents filed with the SEC including Daré’s recent filings on Form 8-K, Form 10-K and Form 10-Q. You are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date on which they were made. Daré undertakes no obligation to update such statements to reflect events that occur or circumstances that exist after the date on which they were made, except as required by law.\n\nContacts:\n\nDaré Bioscience Investor Relationsinnovations@darebioscience.com\n\nSource: Daré Bioscience, Inc.",
    "extraction_status": "success"
  },
  "https://www.everydayhealth.com/emotional-health/fort-health-review/_At Fort Health, My Teen Finally Found a Therapist He Doesn't Hate": {
    "company": "Fort Health",
    "title": "At Fort Health, My Teen Finally Found a Therapist He Doesn't Hate",
    "url": "https://www.everydayhealth.com/emotional-health/fort-health-review/",
    "source": "Everyday Health",
    "body": "Everyday Health independently vets all recommended products. If you purchase a featured product, we may be compensated. Learn why you can trust us. Everyday Health independently vets all ...",
    "date": "2024-11-18",
    "full_content": "When you have social anxiety, counseling itself is a form of exposure therapy. My oldest son is 16 and has been dealing with symptoms ofsocial anxietyandobsessive-compulsive disorder (OCD)for about two years. He’s been under the care of a psychiatrist, but none of the online therapy we’ve tried has seemed to stick. Speaking with a counselor adds to his anxiety: On days when he has an appointment, he’ll spend the hours leading up to it stressing and fretting.\n\nHe’s tried two large mainstream online therapy platforms, chosen because he could communicate with the therapist via live chat during sessions or message a therapist without having set appointment times. These services didn’t seem to help him very much, and he never wanted to continue with them for longer than a month or so. Chat and messaging may be less intimidating ways to communicate with a counselor, but they also make it harder for the patient and therapist to get to know each other.\n\n[1]\n\n[2]\n\n[3]\n\nSo, for the sake of this review, I convinced my teen to try Fort Health, even though it only offers more traditional face-to-face video therapy sessions. Fort Health provides online therapy and psychiatry/medication management for people ages 4 to 24 in New York, New Jersey, and Pennsylvania. Caregiver coaching services are also available. We tested Fort Health’s child therapy services for nearly a month. This is how it went.\n\nFort Health’s services are covered by most major insurance plans, including Optum, UnitedHealthcare, Aetna, Cigna, Evernorth, Oxford Health Plans, Horizon BlueCross BlueShield, Geisinger Health Plan, and Humana. Medicaid is not accepted.\n\nOther plans may also be accepted; contact Forth Health customer service to confirm your coverage. If your plan is accepted, you’ll only pay a copay or coinsurance payment. I paid the standard copayment for specialists on my insurance plan, which is $50.\n\nIf paying out of pocket, the company uses the pay-per-appointment model; there are no subscriptions or bundling options. Therapy is $180 for the initial evaluation session and $150 for subsequent 55-minute sessions. Psychiatry is $400 for the initial 60-minute evaluation and $200 for each 30-minute follow-up session. The caregiver coaching course is $149 for two 30-minute sessions and 10 short video lessons. The site asserts that if the caregiver course is undertaken as an addition to your child’s therapy, it may be covered by your insurance plan.\n\nTo sign up for service at Fort Health, I simply clicked on the teal “Find Care Now” button on the homepage. This opens a new tab and begins a series of questions.\n\nFirst it asks who you are seeking care for, with two choices: “I am a caregiver scheduling care for my child” or “I am between 18 and 24, looking for care for myself.” I appreciated this distinction because I’ve signed up for online therapy services for my son before where the platform assumed I was the person seeking care. That meant there was no separate portal for me to log into as a parent, which felt intrusive to my son’s privacy in a way that might hamper his ability to speak freely with the therapist.\n\nNext I was prompted to choose among the three states where Fort Health is available: New York, New Jersey, or Pennsylvania. It also asked me to indicate my child’s age group: child, tween, teen, or young adult. This helped the service match my son with a provider with experience and expertise in the appropriate age group.\n\nSeveral questions ask about what brings your child into therapy. I had the option to choose as many items as applicable from options like school problems, anxiety, depression, attention difficulties, disruptive behavior, grief, unhealthy screen behaviors, sleep issues, trauma, body image, autism, social issues, and substance misuse. It also asks if any of these situations apply to the child within the previous six months: mental health-related hospitalization, suicide attempt, violent behavior resulting in safety concerns for them or others, disordered eating, using someone else’s prescription medication or taking too much of their own medication, having excessive energy to the point of rarely sleeping, or hearing or seeing things others don’t.\n\nThen I was asked whether I was seeking therapy, medication management, or both. At that point, I was able to search for my insurance plan and enter those details. I also submitted a photo of the front and back of my health insurance card so Fort Health could begin the process of confirming my insurance.\n\nI then filled in open-ended questions about my availability. The service needed a time when my son and I were available for an initial therapy evaluation session and for our ongoing weekly availability for a regular session. It explained that my son would attend therapy on his own, so this availability should be his. The service then worked to pair my son with a provider who had an open slot that aligned with my son’s availability so he could continue to have a session at the same time each week.\n\nFinally, I was asked to enter my name, contact information, and preferred communication form and then schedule a time to receive a call from an intake coordinator to book the first appointment and discuss my son’s therapist match. Call slots were available on weekdays at various times between 10 a.m. and 2:45 p.m. as soon as the following business day, but I could also choose to schedule it several weeks or months out if needed. I booked one for within a few days. The entire sign-up process took about 15 minutes.\n\nUpon completion of the sign-up process, I received an email welcoming me to the Fort Health community. It included a link to a short informational video by the company’s clinical director. It also said, “To get started with care, call this number.” I was a little confused by this since I was told the next step would be to receive a scheduled call from the company, not make a call. I didn’t call the number and was contacted by the intake representative at the scheduled time, so I guess it wasn’t necessary. Still, I appreciated this more personalized email confirmation of signing up for a service consultation.\n\nThe intake coordinator called me promptly at the scheduled time. They were friendly and helpful and seemed happy to answer any questions I had. She said Fort Health had five therapists and two psychiatrists licensed in Pennsylvania and accepting of UnitedHealthcare insurance, though two of these therapists were not accepting new clients at the moment.\n\nShe matched us with a therapist who had ongoing weekly availability during the weekday afternoon time slot I indicated on the sign-up form. The intake coordinator didn’t tell me about her licensure or credentials, and I forgot to ask. Her public profile on the Fort Health site only says she is an LMHC (licensed mental health counselor) and licensed child therapist. Most of the providers advertised on the site are LMHCs, licensed professional counselors (LPCs), or licensed clinical social workers (LCSWs). The site also employs MDs and psychiatric nurse practitioners to provide psychiatry and medication services.\n\n[4]\n\nThe intake coordinator told me she was sending over paperwork that I would need to complete at least 48 hours ahead of the appointment. Appointments are available as late as 7:30 p.m. on weekdays, and client services can be reached until 6:30 p.m. Of course, because this is a child therapy service, afternoon and evening times are highly popular during the school year.\n\nI received an email immediately after this call confirming my appointment for the initial therapy evaluation. There were two big blue buttons to click on to either join the video session or set up our account. I also received an email that our insurance was confirmed.\n\nI then set up our account in the patient portal, filled in the necessary intake paperwork, and input my payment information for copays. I entered my son’s contact and biographical information, such as date of birth, gender, etc. I was pleased to see the diverse gender identification options: Female, Male, Trans Man, Trans Woman, Genderqueer, Other, or Choose Not to Disclose. I then answered a series of open-ended questions about my son’s mental health and medical history, such as any medications he’s currently taking and any previous experience with therapy. I was also asked to share my concerns relating to my son’s mental health. I appreciated that these sections were all fillable boxes rather than multiple choice.\n\nNext, I signed the consent for disclosure for minors form indicating my agreement to allow the therapist to share notes with my son’s primary care provider. This is recommended, but it’s not required. Then came the cancellation policy, which noted that patients who do not cancel at least 48 hours prior to their appointment or who do not show up to their appointment will be charged a $90 fee.\n\nFinally came Fort Health’s contact information and virtual therapy guidelines, such as how to help your child prepare for therapy sessions and the importance of them having a dedicated, distraction-free area with a closed door, a computer, and a comfortable chair for the session. The use of phones for attending virtual sessions is discouraged.\n\nMy son said he received a text with a short survey about how he was feeling after I put his information into the intake forms.\n\nBut a few days before the appointment, I got an email and a text saying my appointment may be canceled due to incomplete paperwork. I logged into the portal and looked over the paperwork section. The insurance section said it was marked “skipped” by the intake coordinator since our insurance had already been confirmed. I assumed this was what was triggering the messages. I received no further warnings, and the appointment still existed in the portal as of the day before, so I assumed everything was all set.\n\nFort Health uses the Healthie platform for its user portal. There is no button for logging in to be found on the main Fort Health website, so to make this easier on myself I could either bookmark the Healthie site or log in via one of the emails I had received from Fort Health regarding my appointment. Healthie is available on a desktop browser and as an app.\n\nThe patient portal is essentially the same on a browser or the app. It’s very minimal. I could message the therapist, view or submit paperwork, upload documents, find billing information, edit my account or payment details, do a test video session, view my and my son’s upcoming appointments, and make an appointment. When I clicked on a scheduled appointment, I could reschedule it, cancel it, or join it at the allotted time. The only thing I felt was missing in the portal was the ability to view our therapist’s credentials and bio.\n\nMy son and I both received multiple reminder emails and texts in the days leading up to our appointments to ensure we remembered to attend.\n\nOur initial therapy evaluation appointment, which my son and I both attended, went very well. Our therapist explained treatment expectations at the service and that sessions occur once a week for 55 minutes, with patients attending by phone in case of emergency. She went over the cancellation policy again and noted that more than 10 minutes late was considered a no-show. Subsequent appointments would always be made with the therapist at the end of each session, with the expectation that they would generally be at the same time and day every week.\n\nShe explained that Fort Health uses a shorter-term approach than some other services: A full course of treatment is only expected to last 12 to 20 weeks. In addition, caregivers are expected to attend a 30-minute session with their child’s therapist every two to four weeks. She said this would likely be covered by our insurance and should take place during the daytime hours to save the afternoon and evening slots for children’s appointments.\n\n[5]\n\nThe therapist then asked us about what brought us to therapy. It was clear that she’d read the intake information I’d submitted, which I appreciated. She was very upfront about Fort Health not having any providers who specialized in treating OCD. She even gave us the name of another online service that could help us. Though she assured us that she could help with social anxiety, she understood we may not want to continue with the service because they could not treat OCD. This is something I had never encountered at an online therapy platform before: admission of a lack of specialization and encouragement to seek help elsewhere. I can’t imagine any of the big online therapy platforms doing anything but happily accepting my money.\n\nI said since our insurance was accepted and my son’s biggest issue at the moment was how social anxiety was making school miserable, we would happily try a few sessions.\n\nIn addition to treating all types of anxiety, Fort Health asserts it can help with:\n\nWhile the individual therapy sessions are meant to be between just the child and therapist, my son was nervous, so our therapist assured us I could be there at the beginning to help him transition into the appointment. This was probably the least stressed my son has ever been in a live therapy session. He was comfortable talking to her, which made therapy feel less anxiety-provoking.\n\nHe said the therapist controlled the conversation well and prevented the dreaded awkwardness of long quiet pauses. She was skilled at putting him at ease and helping him be less anxious about talking to a therapist in the first place. She taught him actionable strategies to calm down when he feels those physical symptoms of anxiety start to kick in. These can help prevent him from getting to the point of feeling overwhelmed.\n\nWe scheduled two subsequent sessions at the end of the appointment.\n\nOur second regular session was canceled because the provider was ill. I received a phone call and an email at 9:30 a.m. letting me know that our provider was out sick and our appointment later that afternoon was canceled. While I would’ve preferred we get a make-up session later the same week, I understand that schedules are tight and it likely isn’t possible to reschedule and still fit in a full day of sessions within the next two days.\n\nBecause we’ve had such a good experience with our provider so far, this cancellation didn’t bother me. We still plan to meet with her at the same time next week.\n\nAlso on offer at Fort Health are child psychiatry services and caregiver coaching services. Psychiatrists and psychiatric nurse practitioners at Fort Health can prescribe psychotropic medications appropriate for children via an initial evaluation appointment and regular follow-ups. Caregiver coaching consists of two 30-minute sessions and multiple short educational videos. We did not test these services.\n\nRescheduling upcoming appointments is easy in the Fort Health portal — as long as your provider has availability within the week that works with your schedule. Otherwise you would likely just cancel your appointment for that week and see your therapist the following week as usual. Since services are charged per appointment and there are no subscriptions, you would simply not make any further appointments with Fort Health to end services. You must cancel or reschedule your appointment with at least 48 hours’ notice, though. The site literally won’t let you cancel or reschedule if it’s less than that. In this case, you can message your provider to reschedule within the week if possible to avoid the cancellation charge.\n\nFort Health is a much smaller operation than many online therapy companies, both in terms of how many providers it employs and the number of states where it’s available. Compared to huge platforms likeTalkspaceorBetterHelp/Teen Counseling(whose teen therapy services we’ve also tried), Fort Health feels very much like a boutique, personalized experience.\n\nBetween the phone call with an intake coordinator and the openness of the therapist about their specialization, Fort Health felt much more like a virtual version of a local therapy office. Still, even though the company is smaller, we still didn’t have to join a waiting list and found a therapist with availability within a week of signing up. When signing up for both Talkspace and BetterHelp, you feel more like just another number than a person. While Talkspace accepted our insurance and offers psychiatry/medication management services, BetterHelp doesn’t accept any insurance and only provides therapy.\n\nBoth Talkspace and BetterHelp can only treat teenagers (age 13 and up), while Fort Health can treat children as young as age 4. Only a few other online therapy services treat children this young. Little Otter treats ages 0 to 14, so it is geared toward the younger crowd: My 16-year-old would be too old. Plus, it’s only available in a few states. LifeStance Health can treat kids of any age and also offers family therapy, but it’s not available nationwide, and therapist availability can vary widely between states.\n\nDoctor On Demandoffers therapy and psychiatry/medication management services to people of all ages and accepts insurance. I like Doctor On Demand: It’s what my son uses for psychiatry, and I have used it for therapy. The providers are caring and professional, and I appreciate that it also has a pay-per-appointment model like Fort Health.Amwellis another platform similar to Doctor On Demand that offers mental and medical care appointments. Amwell can provide therapy to kids as young as age 10. Both Doctor On Demand and Amwell are available nationwide.\n\nI would definitely recommend Fort Health to anyone looking for short-term online mental health services for their child as well as coaching and support for themselves as caregivers. The company serves a wide range of ages, accepts insurance, offers personalized service, and (despite its smaller size) has plenty of provider availability. I really appreciate being able to message with the provider through the patient portal: Therapist messaging isn’t something that’s usually found at these smaller companies. However, I do wish I could see more detailed provider profiles there as well. This would be especially helpful if I was looking to switch providers.\n\nMy son says he has been using the strategies his therapist taught him at school and that he is willing to continue working with this therapist after the testing period. This speaks volumes. Honestly, it’s a small miracle. He usually can’t get me to cancel an online therapy service fast enough and has never found a therapist who has made him feel so at ease about therapy itself and who has offered such concrete, actionable strategies for managing his anxiety. I believe this service can definitely help my son get control of his anxiety and make school more bearable.\n\nThat said, if your child has a diagnosis like OCD or something else outside the company’s stated wheelhouse, it may not be a good fit for you — and the service will likely advise you of this. It’s also not the service for you if you need a long-term therapy solution. The company considers 12 to 20 weeks of therapy a full course of treatment.\n\nFort Health’s privacy policyis easily accessible and written in plain language instead of legalese. It doesn’t contain anything that alarms me. It states: “We believe that your health information should have heightened privacy protections, which is also required by federal and state laws. All collection, use, and disclosure of your health information through the Site is governed by Professionals’ Health Information Privacy Policy.”\n\nHere at Everyday Health, we’re testing more than 65 different online therapy companies in order to find the very best ones for your needs. We’re testing them all in the same way — by doing reporting to vet the company and its business practices, by interviewing and speaking with a dozen different licensed therapists, by surveying real online therapy users, and by testing each service with professional journalists and/or therapists.\n\nTo assess this service, we looked at its quality of care, ease of sign-up, prices, intake process, therapist qualifications, and the user-friendliness of its platform. I am a science journalist and editor with more than 15 years of experience. My articles have appeared inNational Geographic,The Atlantic,New York Magazine,The WashingtonPost,Parents,People,SELF, andGood Housekeepingamong others. I’m also aNew York Timesbestselling author of the history booksWomen in White Coats: How the First Women Doctors Changed the World of MedicineandSisters in Science: How Four Women Physicists Escaped Nazi Germany and Made Scientific History. So far I have tested five online therapy platforms.\n\nOlivia Campbell is theNew York Timesbestselling author ofWomen in White Coats: How the First Women Doctors Changed the World of MedicineandSisters in Science: How Four Women Physicists Escaped Nazi Germany and Made Scientific History. She is a freelance editor at Dotdash Meredith and a freelance journalist. Her work has appeared inThe Atlantic,National Geographic,New York Magazine, Health, Parents, History, andThe Guardian, among other outlets.\n\nCampbell received a journalism degree from Virginia Commonwealth University and a master's in science writing from Johns Hopkins University, where she now acts as a thesis advisor. She is a member of the National Association of Science Writers.\n\nCampbell lives outside Philadelphia with her husband, three children, and two cats.",
    "extraction_status": "success"
  },
  "https://nymag.com/strategist/article/jiminys-cricket-treats-review.html_My Dog Loves These Cricket Protein Treats More Than She Loves Me": {
    "company": "Jiminy's",
    "title": "My Dog Loves These Cricket Protein Treats More Than She Loves Me",
    "url": "https://nymag.com/strategist/article/jiminys-cricket-treats-review.html",
    "source": "New York Magazine",
    "body": "That seems more like something you do for a pet snake than a toy poodle. But when a bag of Jiminy's cricket treats were sent to the office by a publicist, I decided to bring them home.",
    "date": "2020-02-19",
    "full_content": "MydogUli turns 10 this month. She’s what you call a silver poodle: When she was born, her fur was pitch black, but at around six months, it turned silvery gray, so she’s always kind of looked like she’s equal partspuppyand old lady. Now that she’s gotten old enough to have earned those grays, I have started paying closer attention to the food andtreatsthat I feed her. My hope is that better nutrition will help her live a longer, happier life. For me, this means opting for raw or minimally processeddog foodmade with simple, high-quality ingredients. It also means focusing on what she loves to eat, because the more I think about losing her one day, the more I want to spoil her. Surprisingly, what she loves eating most right now are treats made of crickets.\n\nI don’t know if I would have ever boughtdog treatsmade out of crickets. That seems more like something you do for a pet snake than atoy poodle.But when a bag of Jiminy’s cricket treats were sent to the office by a publicist, I decided to bring themhome. Uli was immediately smitten — so much so that I’ve bought three more bags in the three months since. With Jiminy’s in front of her, Uli’s priorities shift. Whatever she was doing before, she stops. She’s immediately at attention, barely able to keep her energy in. When I ask her tositor roll over for any othertreat, she does the trick at her normal pace, but the minute she sees (or, more likely, smells) that I am holding a cricket treat, she does a montage of every trick she knows at panicked hyperspeed. These treats are so effective that I’ve been using them to teach her tricks I never would have tried before. (We’re almost at the point where she’ll put her owntoysaway.)\n\nI was curious what effect the treats would have on other dogs — plus, it’s nice to share the cricket love — so I gave bags of Jiminy’s to two of my Strategist colleagues who also have small dogs at home. Like Uli, my colleagues’dogs,OakandReggie,took to the cricket treats immediately and with surprising intensity. This was especially unexpected for Oak’s mom, associate director of audience development Stephanie Downes, who says he’s typically a chicken-treat purist. Now, she uses Jiminy’s to get him to take his pills, like delicious little Trojan horses.\n\nCricket treats are higher inproteinand morenutrient densethan beef or chicken treats, and they require fewer resources like land, water, and energy to raise (and cause much lower carbon emissions). I am not a vegetarian, but Iamwary of how much meat I eat and where it comes from, due to the environmental impact, so it makes me feel good to buy dogtreatsmade from more sustainable ingredients. After buying our second bag, my partner and I were so struck by Uli’s obsession with the treats that we decided to taste one. It’s not something we’d serve to guests, but honestly, they taste like health-food-storebeef jerky. And they definitely taste good to Uli, which is the whole point.\n\nThe Strategistis designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the bestacne treatments,rolling luggage,pillows for side sleepers,natural anxiety remedies, andbath towels. We update links when possible, but note that deals can expire and all prices are subject to change.",
    "extraction_status": "success"
  },
  "https://grist.org/food/sustainable-cricket-dog-food-jiminys/_Pets eat a lot of meat. Insects could lower their carbon pawprint.": {
    "company": "Jiminy's",
    "title": "Pets eat a lot of meat. Insects could lower their carbon pawprint.",
    "url": "https://grist.org/food/sustainable-cricket-dog-food-jiminys/",
    "source": "Grist",
    "body": "Here's How Anne Carlson, the founder and CEO of Jiminy's, discovered this when she began experimenting with bringing insect protein to the pet food industry. She started with cricket treats ...",
    "date": "2022-09-13",
    "full_content": "As our climate changes, so will our diets. Fix is exploring that reality through the lens of foods that show what sustainable, equitable, and resilient eating could look like. Try them yourself with the recipes in ourClimate Future Cookbook.\n\nCats and dogs eat a lot of meat. In the U.S., they gobble up abouta quarter of the calories derived from livestock. If they were counted as a country, America’s pets would rank fifth in global meat consumption. Producing all that food generates about ​​64 million tons of carbon dioxide a year, not to mention the land, water, and other resources required to farm animals.\n\nAs pet ownership rises,Americans increasingly see their crittersas family members. An ensuing trend toward premium and“human-grade”diets has further stressed the carbon-intensive livestock industry. But it also represents a pattern that may bode well for the planet — pet foodgenerally tends to mirror shiftsin consumer preferences for people, with a growing emphasis on things like health, quality, and sustainability. As eco-friendly alternatives (particularly alternative proteins) establish themselves in our grocery aisles, the pet aisle may not be far behind. One particular ingredient is emerging as a promising option for our furry friends: insects.\n\nInsectshave gotten a lot of attentionin the past decade or so as a mega-efficient, protein-rich superfood of the future. A number of cuisines, particularly in Asia, Africa, and South America, have included insects for thousands of years, but many people remain squeamish about the idea of eating bugs. Dogs don’t have the same hangups.\n\nGrist thanks its sponsors.Become one.\n\nTo support our nonprofit environmental journalism, please considerdisabling your ad-blockerto allow ads on Grist.Here's How\n\nAnne Carlson, the founder and CEO ofJiminy’s, discovered this when she began experimenting with bringing insect protein to the pet food industry. She started with cricket treats — which dogs went crazy for — then worked with scientists and veterinarians to determine if crickets and “grubs,” or black soldier fly larvae, could provide complete nutrition for dogs. Studies showed that they could, and that the bugs also offered an array of compelling health benefits. (Her team is pursuing similar research for cats.) But Carlson was always looking at it from the angle of curbing emissions. For her, it was a personal matter.\n\nIn 2016, after a stint working for a big pet food company, Carlson was pondering her next move. A conversation with her then-college-aged daughter gave Carlson a new outlook on her career when her daughter said she didn’t want to have kids. “Her reason was she was worried about what the world was going to be like by the time they grew up,” Carlson says. “And she was talking about climate change.”\n\nCarlson felt a pressing sense of responsibility to be part of creating a world in which her daughter would want to raise children. “I actually decided right then that no matter what I did, it was going to be fighting climate change,” she recalls. She founded Jiminy’s later that year. Today, the company offers dry and wet dog food and treats made of insects; its products are available in around1,400 pet storesnationwide and online through popular retailers like Chewy. Although several other companies now offer insect protein treats, Jiminy’s remains the only company in the U.S. selling bug-based dog food.\n\nWe talked to Carlson about her journey to bring a more sustainable form of protein to the pet market, and what she sees as the future of the industry. Her responses have been edited for length and clarity.\n\nGrist thanks its sponsors.Become one.\n\nTo support our nonprofit environmental journalism, please considerdisabling your ad-blockerto allow ads on Grist.Here's How\n\nQ. Tell me about the Jiminy’s origin story. How did you get the idea to launch an alt-protein company for pets?\n\nA.A little bit after that conversation [with my daughter], I got approached to lead a pet food company. They were framing it as a sustainable alternative for pets. It was grass-fed beef. I absolutely fell in love with this idea of sustainability and pets, but I was like, “You know what? Cows are never gonna be the answer.” I started thinking, “What could be a protein source that would be sustainable for pets? And could it be humane as well?” Because that would be awesome. When you look at traditional protein, it’s pretty terrible from a lot of different perspectives.\n\nI started throwing different types of protein sources onto a page. I actually put an insect on the page. I don’t know why. I don’t know what inspired me to do it, but I kept coming back to it. Then I saw that theU.N. had done a studysaying that insects could be the answer to world hunger.\n\nI ordered roasted crickets online. When I got them, I fed them to my dogs to see what they would do. And the drool started right away. I knew I had something that was gonna work. When you think about a dog — I don’t know, do you have a dog?\n\nQ. I do!\n\nA.You know if the drool starts, they’re really loving something. And it was flowing freely. Of course, I had to try it, too. I tried the crickets — and they tasted good! It was a little scary the first time I put it in my mouth, but once you get past that, you’re like, “Oh, it tastes like a sunflower seed.” It’s nutty, it’s earthy. We were kind of off to the races at that point.\n\nQ. So you were inspired by the U.N. study about insects as a solution for human diets, and you translated that to pet food. How did that work?\n\nA.We started with the crickets, because they are the easiest to wrap your head around. We like to call them the gateway bug — but when you look at it, you can see it is a fantastic protein source. It has all of the amino acids that you need to be a complete protein. When you’re working with dogs, you’re looking for 10 essential amino acids, and this delivers it in the quantities that you need. So I knew it was a good protein source, but then you start digging into it and you’re like, “Oh, but it also has minerals and vitamins and fiber.” All of these other things make it into even more than just a protein source. It really is a superfood.\n\nAnd what I loved about working with the dogs is that I felt like I could have a huge impact quickly, if I was able to make a food that was complete and balanced that they could eat every day. Because if you think about it, if I were to make something for people — like, say I make a breakfast bar. Best-case scenario, even if you ate it every single day, I’d only be impacting about 7 percent of your eating occasions. But if I make a food for dogs, I can impact 80 to 90 percent of their eating occasions with one product.\n\nQ. That makes sense. Speaking of the impact, could you give me a quick rundown of some of the benefits of farming insects instead of livestock?\n\nA.You bet. It’s kind of fun, actually. Let me just give you sort of an analogy here: If you had an acre of land and you put cows on it, at the end of a year, you’re gonna get 192 pounds of protein. If you had chickens, you get 265 pounds of protein. But if you had crickets?Sixty-five thousandpounds of protein at the end of the year. And grubs, over a million pounds of protein. [Statistics come from alifecycle assessment by insect producer EnviroFlight.] And there’s a lot of reasons why. They have a shorter lifespan. For crickets, it’s approximately six weeks. They also reproduce at a super-high rate. So if you think about a cow, it’s having one to two babies at a time and it takes nearly a year to gestate, but grubs are laying 500 eggs at a time.\n\n[Read more: Scientists are “milking” microbes to create cow-free dairy products.]\n\nThe other thing that’s really cool is that there’s no waste. You’re using the entire animal. They’re roasted and ground and the entire animal is used. Even their bedding [and excrement] is used. That’s what they call frass,which is this amazing fertilizer.\n\nQ. Jiminy’s is a pioneer and remains the only U.S. company offering complete-diet dog food made from insect protein. What were some of the challenges getting started?\n\nA.The biggest challenge was proving that it was safe for the dogs. You could look at the nutritional analysis on it, but there was still a question as to whether or not the dogs could actually digest it. We worked with Iowa State andAnimalBiometo doa bunch of studies, and they were all published and peer reviewed. And all of that went into proving that it was safe to use in a food.\n\nWhen we started, we focused on treats. In order to do the food, we had to do all those studies — we knew it was really important to be able to prove that it was truly digestible and it had utility. And the great news is, what we found is that it is as digestible for dogs as chicken or beef. The other thing we were able to prove is that, because it’s got that fiber that comes from the exoskeleton, that feeds the good bacteria in the dog’s gut. It’s also hypoallergenic — for dogs that have food allergies, oftentimes this is a great solve for them.\n\nQ. What has been the reaction from pet owners in the five years that Jiminy’s products have been on the market?\n\nA.It’s kind of funny, it’s really shifted. At the beginning, when we would say we’re making dog treats with cricket protein, almost always, it was like, “Wait, what?” You’d have to explain that cricket protein is a thing. Now, people are like, “Oh, cool, I’ve heard of that!” And sometimes they’ll ask us, “Oh, were you onShark Tank?” Because there were a couple of companies making [insect-based] products for peopleonShark Tank— and we’re like, “No, that’s not us! But yeah, it’s like that!”\n\nThe other thing that’s really shifted is, during the pandemic, more people adopted pets. And the people who adopted pets had more time to research what they were going to give to their pets – what kind of food. And one of the other things that’s been happening is pet ownership is starting to shift younger and younger, which is great for us. Millennials and Gen Zare closing in on 50 percent of the pet ownershipin the U.S. — and they just get it. When we say we’re working with insect protein, they’re like, “That’s so cool!” And when we talk about the sustainability, they’re like, “Yes, that’s important to me.” When we say we’re reducing the carbon pawprint, it just makes sense. They know what we’re talking about.\n\nQ. What’s your vision for where the pet industry could be in 10, 20, or 30 years?\n\nA.It needs to change so much. There needs to be sustainability across the board. I do see some great things that are happening in certain areas. Petco now has this [refill option] for cat litter; you can actually bring your own container and scoop the litter into your own container and take it away, rather than getting another plastic container. I think that’s a great example of innovation in another category within pets. But I’d love to see rethinking of the materials that are used for leashes and collars. I mean, think about going into one of those superstores and how many different types of products there are, and then think about how much plastic there is. We need to get away from these materials that can’t be reused or recycled. And I’d like to see other proteins being used that are sustainable as well — getting away from the cow and the chicken that is just so problematic.\n\nQ. What about your daughter? Has she shared her thoughts on the company, and how your vision has impacted her?\n\nA.She hasn’t said absolutely that she wants to have kids, but she’s more open to the idea than she was before. I think there’s more hope. She sees what we’re doing, she sees what others are doing. And we’re trying to [approach sustainability] not just from the products that we make, but we’re trying to make sure that everything we do is moving in the right direction. We’re moving our packaging to sustainable packaging. We’re offsetting [our shipping] by planting trees.We planted over 65,000 trees already. Everything that we do, we try to put it through the lens of, is this the best solution? Is this the best answer, when we think about climate change?\n\nRead more from theClimate Future Cookbook:\n\nA message from\n\nGrist is the only award-winning newsroom focused on exploring equitable solutions to climate change. It’s vital reporting made entirely possible by loyal readers like you. At Grist, we don’t believe in paywalls. Instead, we rely on our readers to pitch in what they can so that we can continue bringing you our solution-based climate news.\n\nGrist is the only award-winning newsroom focused on exploring equitable solutions to climate change. It’s vital reporting made entirely possible by loyal readers like you. At Grist, we don’t believe in paywalls. Instead, we rely on our readers to pitch in what they can so that we can continue bringing you our solution-based climate news.\n\nGrist thanks its sponsors.Become one.\n\nGrist thanks its sponsors.Become one.\n\nTo support our nonprofit environmental journalism, please considerdisabling your ad-blockerto allow ads on Grist.Here's How",
    "extraction_status": "success"
  },
  "https://www.businesswire.com/news/home/20201109005312/en/DERMALA-Announces-6.73-Million-Series-A-Financing-to-Expand-and-Scale-Company’s-Personalized-Microbiome-Based-Solutions-for-Acne-and-Other-Skin-Conditions_DERMALA Announces $6.73 Million Series A Financing to Expand and Scale Company's Personalized Microbiome-Based Solutions for Acne and Other Skin Conditions": {
    "company": "Dermala",
    "title": "DERMALA Announces $6.73 Million Series A Financing to Expand and Scale Company's Personalized Microbiome-Based Solutions for Acne and Other Skin Conditions",
    "url": "https://www.businesswire.com/news/home/20201109005312/en/DERMALA-Announces-6.73-Million-Series-A-Financing-to-Expand-and-Scale-Company’s-Personalized-Microbiome-Based-Solutions-for-Acne-and-Other-Skin-Conditions",
    "source": "Business Wire",
    "body": "SAN DIEGO--(BUSINESS WIRE)--DERMALA, Inc., a consumer dermatology company developing novel, personalized, microbiome-based solutions for acne and other skin conditions, announced today that it has ...",
    "date": "2020-11-09",
    "full_content": "DERMALA Announces $6.73 Million Series A Financing to Expand and Scale Company’s Personalized Microbiome-Based Solutions for Acne and Other Skin Conditions\n\nJohnson & Johnson Innovation – JJDC, Inc. and True Wealth Ventures co-led the funding round, joined by Seventure Partners and Cove Fund\n\nSAN DIEGO--(BUSINESS WIRE)--DERMALA, Inc.,a consumer dermatology company developing novel, personalized, microbiome-based solutions for acne and other skin conditions, announced today that it has closed a $6.73 million Series A financing. The company developed an integrated platform that combines patent-pending microbiome-based topical and oral products containing unique prebiotic, probiotic, and postbiotic ingredients, including the SE Microbiome Complex®, with a proprietary data analytics app that enables personalization and continuous optimization of product formulations based on individual outcomes.\n\n“The consumer dermatology category is ripe for science-based solutions to treat common skin conditions,” said Lada Rasochova, Ph.D., MBA, Founder and CEO of DERMALA. “One size just does not fit all when it comes to acne. Most acne treatments have been on the market for decades, but they do not work for everyone. Our proprietary platform combines human microbiome science with data analytics to identify product formulations that deliver the best results and help our customers feel confident, healthy and beautiful in their skin.”\n\nDERMALA launched its #FOBO®(Fear of Breaking Out) Kit, a microbiome-based solution for acne in 2019. It has attracted many loyal customers who value its personalized approach to helping them conquer their “fear of breaking out”. The solution comprises topical acne treatments and oral supplements paired with the DERMALA Acne Tracker app, which customers use to track their skin health.\n\nThe Series A financing was co-led by Johnson & Johnson Innovation – JJDC, Inc. and True Wealth Ventures. Seventure Partners, investing via their Health for Life Capital™ Funds, and Cove Fund joined the financing round.\n\n“DERMALA brings together science-based products with robust data analytics to deliver value to the customer with a unique skin health solution,” said Sara T. Brand, Founding General Partner of True Wealth Ventures. “The app enables DERMALA’s product customization and helps customers with treatment compliance. It is truly unique within the OTC consumer dermatology category.”\n\n“Exploring the richness of microbiome biology including prebiotics, probiotics and postbiotics, and combining topical and oral products for OTC dermatology makes great scientific sense,” said Isabelle de Crémoux, CEO and Managing Partner of Seventure Partners. “This, combined with creative marketing and a personalized digital program, positions DERMALA for success after this Series A investment and will allow them to scale up their operations and reach more people in need.”\n\nDERMALA will use the proceeds of the funding round to scale operations, manufacturing, and commercial efforts for its acne products. It will also expand its research and development activities exploring new personalized microbiome-based products for other skin conditions including eczema and skin wellness.\n\nAbout DERMALA\n\nDERMALA, Inc. is a privately-held consumer dermatology company leveraging scientific understanding of the human microbiome to develop novel solutions for acne and other skin conditions. The company’s #FOBO®(Fear of Breaking Out) Kit, a personalized microbiome-based solution for acne, combines patent-pending topical acne treatments with oral supplements and a proprietary DERMALA Acne Tracker app that customers use to track their skin health. For more information, visitdermala.com.\n\nFor Media InquiriesGwen Gordon for DERMALA, Inc.858-245-5684GwenGordonPR@outlook.com\n\nFor General InquiriesDERMALA, Inc.www.dermala.cominfo@dermala.com\n\nFor Media InquiriesGwen Gordon for DERMALA, Inc.858-245-5684GwenGordonPR@outlook.com\n\nFor General InquiriesDERMALA, Inc.www.dermala.cominfo@dermala.com\n\nFor Media InquiriesGwen Gordon for DERMALA, Inc.858-245-5684GwenGordonPR@outlook.com\n\nFor General InquiriesDERMALA, Inc.www.dermala.cominfo@dermala.com",
    "extraction_status": "success"
  },
  "https://www.wkrn.com/business/press-releases/cision/20240306DA53947/braincheck-secures-15-million-to-fuel-expansion-and-adoption-of-its-next-generation-digital-cognitive-assessment-and-care-planning-platform/_BrainCheck Secures $15 Million to Fuel Expansion and Adoption of its Next Generation Digital Cognitive Assessment and Care Planning Platform": {
    "company": "BrainCheck",
    "title": "BrainCheck Secures $15 Million to Fuel Expansion and Adoption of its Next Generation Digital Cognitive Assessment and Care Planning Platform",
    "url": "https://www.wkrn.com/business/press-releases/cision/20240306DA53947/braincheck-secures-15-million-to-fuel-expansion-and-adoption-of-its-next-generation-digital-cognitive-assessment-and-care-planning-platform/",
    "source": "WKRN-TV",
    "body": "New financing round, led by Next Coast Ventures, S3 Ventures, and UPMC Enterprises, positions Company for continued growth, innovation, and integration BrainCheck expands Board of Directors ...",
    "date": "2024-03-06",
    "full_content": "News provided by\n\nMar 06, 2024, 8:00 AM\t\t\t\t\t\tET\n\nNew financing round, led by Next Coast Ventures, S3 Ventures, andUPMC Enterprises, positions Company for continued growth, innovation, and integration\n\nBrainCheck expands Board of Directors with appointment ofNicholas Shapiroas New Board Member, further strengthening the Company's strategic leadership\n\nAUSTIN, Texas,March 6, 2024/PRNewswire/ --BrainCheck, Inc., a digital health innovator delivering first-of-its-kind technology into the growing digital cognitive assessment market, today announced a$15 millionnew financing round, led byNext Coast Ventures,S3 Ventures, andUPMC Enterprises, the innovation, commercialization, and venture capital arm of UPMC. The Company also expanded its Board of Directors with the appointment ofNicholas Shapiro, Vice President, UPMC Enterprises, as a new board member, further strengthening the Company's strategic leadership.\n\nThe funding will accelerate BrainCheck's commercial traction, expand innovation within its product portfolio, build upon existing clinical evidence, and extend the Company's impact throughout the healthcare landscape, including major integrations with healthcare systems. This announcement follows the recentlaunchof BrainCheck's next generation platform and 3-minute screening solution, which empowers clinicians to screen and monitor patients' cognitive function anytime, anywhere.\n\n\"We are laser focused on commercializing and scaling a digital cognitive assessment platform that is clinically robust, easy for patients and their caregivers to use, enables a simplified provider experience and improves access to the actionable information needed to intervene sooner and potentially combat cognitive decline,\" saidKim Rodriguez, CEO of BrainCheck. \"We thank our current and new investors for their continued support and look forward to deploying this capital to play an important role in revolutionizing cognitive care.\"\n\n\"We believe in BrainCheck's vision to pioneer a fundamental shift in how cognitive care is delivered,\" saidMichael Smerklo, Co-Founder and Managing Partner of Next Coast Ventures. \"Dementia is projected to impact 14 million people inthe United Statesand 152 million globally in the coming decades, underscoring the importance of proactive measures to address prevention, early detection, and effective management strategies.i,ii\"\n\nTrusted by hundreds of the country's most prestigious providers and specialists, BrainCheck's clinically proven platform is the most comprehensive solution commercially available across the cognitive care continuum, streamlining screening, assessment, care planning and monitoring.\n\n\"Our decision to invest in BrainCheck is fueled by a deep understanding of the pressing burden of cognitive impairment on health care and the exciting solutions on the horizon to advance the industry. I am honored to join BrainCheck's Board of Directors and look forward to working collaboratively with the team to drive strategic initiatives and shape the future growth trajectory of the Company,\" saidNicholas Shapiro, Vice President, UPMC Enterprises. \"BrainCheck's solutions offer rapid, reliable resources to support accurate assessments, stratify individual risk, and deliver actionable insights that can help all stakeholders - patients, caregivers, providers, and risk-bearers.\"\n\nFor more information about BrainCheck and its innovative cognitive assessment solutions, please visitwww.braincheck.com.\n\nAbout BrainCheckTo learn more, please visit braincheck.com.\n\nContact:pr@braincheck.com\n\n________________________________i2022 Alzheimer's disease facts and figures. Alzheimers Dement. 2022 Apr;18(4):700-789. doi: 10.1002/alz.12638. Epub 2022 Mar 14. PMID: 35289055.\n\niiGBD 2019 Dementia Forecasting Collaborators: \"Estimation of the global prevalence of dementia in 2019 and forecasted prevalence in 2050: an analysis for the Global Burden of Disease Study 2019.\" The Lancet Public Health,January 6, 2022.\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/braincheck-secures-15-million-to-fuel-expansion-and-adoption-of-its-next-generation-digital-cognitive-assessment-and-care-planning-platform-302080799.html\n\nSOURCE  BrainCheck, Inc.\n\nNOTE: This content is not written by or endorsed by \"WKRN\", its advertisers, or Nexstar Media Inc.",
    "extraction_status": "success"
  },
  "https://markets.businessinsider.com/news/stocks/dermala-ceo-and-founder-invited-as-speaker-and-panelist-to-two-upcoming-industry-conferences-1031304308_DERMALA CEO AND FOUNDER INVITED AS SPEAKER AND PANELIST TO TWO UPCOMING INDUSTRY CONFERENCES": {
    "company": "Dermala",
    "title": "DERMALA CEO AND FOUNDER INVITED AS SPEAKER AND PANELIST TO TWO UPCOMING INDUSTRY CONFERENCES",
    "url": "https://markets.businessinsider.com/news/stocks/dermala-ceo-and-founder-invited-as-speaker-and-panelist-to-two-upcoming-industry-conferences-1031304308",
    "source": "Business Insider",
    "body": "SAN DIEGO, March 24, 2022 /PRNewswire/ -- DERMALA, a consumer dermatology company developing novel, personalized, microbiome-powered solutions for chronic skin conditions such as acne and eczema ...",
    "date": "2022-03-24",
    "full_content": "SAN DIEGO,March 24, 2022/PRNewswire/ -- DERMALA, a consumer dermatology company developing novel, personalized, microbiome-powered solutions for chronic skin conditions such as acne and eczema, announces its involvement in two prominent industry meetings. Dr.Lada Rasochova, the founder and CEO ofDERMALA, will participate as a speaker and panelist at the Personalized BeautyUSAandMicrobiome&ProbioticsR&D & Business Collaboration ForumUSAconferences.\n\nPersonalized BeautyUSA, a Personalized Beauty Summit, is taking place inSan Francisco, CAonMarch 30tand 31. Dr Rasochova will be a panelist on two topics - 'The Role of the Microbiome in Personalized Skincare' and 'Creating an End-to-End Customer Experience.' DERMALA will share insights on providing successful product personalization and continuous treatment optimization and building customer relationships by utilizing treatment progress tracking via selfies and various skin tests, understanding the microbiome changes, and deploying data analytics to present the best product options to customers.\n\n\"Personalization is becoming fundamental to the customer journey,\" said Dr. Lada Rasochova. \"Our priority is to build relationships with our customers, and it is only by understanding large amount of data that you can fully realize personalized skincare and develop that relationship.\"\n\nDERMALA will also attend the Microbiome & Probiotics R&D & Business Collaboration ForumUSAmeeting that is held onMarch 29and 30 inSan Diego, CA.DERMALA will participate in discussions of the most cutting-edge microbiome and probiotics research, challenges, and opportunities at this world-renowned event. Dr. Rasochova will review microbiome research and clinical data during her talk 'Acne and the Human Microbiome' in the Skin and Cosmeceuticals session. During the 'Dosing in the Microbiome – Dealing with The Great Unknown' panel discussion, Dr. Rasochova will provide insights into the research, product development, and manufacturing of microbiome-based products.\n\n\"We look forward to sharing our research, customer experience, and results of personalizing microbiome-based skincare products,\" said Rasochova. \"It is a tremendous opportunity to share our insights as both speaker and panelist at these two upcoming meetings.\"\n\nAll DERMALA products are based on cutting-edge human microbiome science. They are formulated with patented microbiome-derived prebiotics, probiotics, and postbiotics that improve skin and gut health naturally.\n\nAbout DERMALADERMALA, Inc. is aSan Diego-based company leveraging a scientific understanding of the human microbiome and data analytics to develop novel personalized treatments for chronic skin conditions. For more information, visitwww.dermala.com.\n\nMedia Contact:Erica Lazaruserica@lazaruspr.com\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/dermala-ceo-and-founder-invited-as-speaker-and-panelist-to-two-upcoming-industry-conferences-301509331.html\n\nSOURCE  DERMALA",
    "extraction_status": "success"
  },
  "https://finance.yahoo.com/news/rosy-closes-2m-seed-round-150000026.html_Rosy Closes $2M Seed Round to Further Novel Developments for Women's Sexual Health": {
    "company": "Rosy Wellness",
    "title": "Rosy Closes $2M Seed Round to Further Novel Developments for Women's Sexual Health",
    "url": "https://finance.yahoo.com/news/rosy-closes-2m-seed-round-150000026.html",
    "source": "Yahoo Finance",
    "body": "DALLAS, Nov. 16, 2021 (GLOBE NEWSWIRE) -- Rosy Wellness, the app changing the sex lives of women across the country, announced today it raised an additional $2 million in seed funding. Designed ...",
    "date": "2021-11-16",
    "full_content": "Backed by thousands of doctors and therapists, Rosy continues to pave the way for evidence-based treatments for massively underserved market.\n\nDALLAS, Nov. 16, 2021 (GLOBE NEWSWIRE) -- Rosy Wellness, the app changing the sex lives of women across the country, announced today it raised an additional $2 million in seed funding. Designed and supported by doctors and psychologists, the first-of-its-kind evidence-based platform grants women groundbreaking access to information and interventions to solve their sexual health problems.\n\nFounder and CEO, Board-certified Ob/Gyn, Dr. Lyndsey Harper, M.D., FACOG, IF, started Rosy after recognizing that 43% of women had a sexual health problem but were met with a complete lack of resources when trying to solve these important issues. In 2019, Dr. Harper launched Rosy with the goal of putting sexual health education and tools in the hands of women everywhere.\n\n\"It's time women feel empowered to talk about sexual health issues and have access to convenient solutions,\" said Dr. Harper. \"I created Rosy to revolutionize the way women and their providers think about, talk about, and treat women's sexual problems.\"\n\nRecent studies validate Rosy's approach and highlight how the company stands apart from other platforms in the space. In a 2020 study, results showed that Rosy users experienced statistically significant improvements in many aspects of sexual function including desire, arousal, orgasm, and lubrication. More recently, in a study from Mount Sinai Hospital presented at the American Urogynecology Society Annual Meeting, Dr. Alexandra Dubinskaya et al. concluded that \"only one App was approved to be recommended to patients by experts in the field,\" and that app was Rosy. This has been echoed in the medical community with more than 6% of ob/gyns in the country now recommending Rosy to their patients\n\nThe women's health technology company secured $2 million in funding in its seed round led by Austin-based True Wealth Ventures with additional participation from Portfolia's Femtech II Fund and Mindshift Capital. The company will use the funding to support further development of its flagship platform, grow the team, and facilitate original research in women's sexual health.\n\n\"In Rosy, we see the investment opportunity to be the trusted leader in a massive untapped market with a deeply resonant and novel approach that is already changing the world for women and their sexual health needs,\" said Kerry Rupp of True Wealth Ventures.\n\n\"Sexual health is a part of everyone's life, yet when it comes to women's sexual health, no one is talking about it,\" Jane van Dis, M.D. of Portfolia, said in a statement. \"Rosy is leading the charge to breakdown stigmas and shine a light on women, sex, pleasure and wellness in the evidence-based way that women deserve.\"\n\nDr. Harper commented, \"Rosy is proud to smash taboos around women's sexual health and prove that everyone, investors included, should be paying attention to these interventions that women need, want, and deserve.\"\n\nContact: Lyndsey Harper, M.D.,lyndsey@meetrosy.com\n\nRelated Images\n\nImage 1: Lyndsey Harper, MDPhoto by Victoria Saperstein\n\nThis content was issued through thepress release distribution service at Newswire.com.\n\nAttachment\n\nLyndsey Harper, MD",
    "extraction_status": "success"
  },
  "https://www.finanznachrichten.de/nachrichten-2024-01/61175839-sidney-collin-de-oro-devices-names-cori-lathan-phd-as-new-ceo-200.htm_Sidney Collin: De Oro Devices Names Cori Lathan, PhD, as New CEO": {
    "company": "De Oro Devices",
    "title": "Sidney Collin: De Oro Devices Names Cori Lathan, PhD, as New CEO",
    "url": "https://www.finanznachrichten.de/nachrichten-2024-01/61175839-sidney-collin-de-oro-devices-names-cori-lathan-phd-as-new-ceo-200.htm",
    "source": "Finanznachrichten",
    "body": "Dr. Lathan brings two decades of medical technology with her to drive the health tech startup forward SAN LUIS OBISPO, CA / ACCESSWIRE / January 18, 2024 / De Oro Devices, a leading innovator in ...",
    "date": "2024-01-18",
    "full_content": "Dr. Lathan brings two decades of medical technology with her to drive the health tech startup forward\n\nSAN LUIS OBISPO, CA / ACCESSWIRE / January 18, 2024 /De Oro Devices, a leading innovator in medical technology for the aging and mobility-impaired population, is pleased to announce the appointment of Dr. Cori Lathan as its new Chief Executive Officer (CEO). In her new role, Lathan will focus on continuing the rapid growth De Oro Devices has seen by exploring new partnerships across the healthcare industry and working to advance its innovative technology.\n\nDr. Lathan joins De Oro Devices from her previous role as CEO at AnthroTronix, where she successfully invented, developed, and commercialized medical technology for over 20 years before leading the company through a successful exit. She has been recognized by the World Economic Forum as a Technology Pioneer and Young Global Leader and is the founding co-chair of their Global Futures Council on Human Augmentation and Longevity. Her expertise in brain health and age tech as well as mobility products positions her as a visionary leader capable of driving De Oro Devices to new heights.\n\n\"We are thrilled to welcome Dr. Cori Lathan as our new CEO,\" said Sidney Collin, Board Member, Co-founder, President and CTO at De Oro Devices. \"Her exceptional leadership, deep industry knowledge, and commitment to innovation align perfectly with our mission. As we continue to improve the lives of the mobility-impaired, I know Dr. Lathan is the right leader to take De Oro Devices forward.\"\n\n\"I am honored and excited to lead De Oro Devices into its next chapter of growth and innovation,\" said Dr. Cori Lathan. \"The team's dedication to changing lives through developing transformational medical technologies is inspiring, and I look forward to building on the company's successes to make a meaningful impact on technology for the aging population globally.\"\n\nDe Oro Devices is at the forefront of medical technology, known for creating the first non-invasive cueing technology that can be used with any mobility aid to improve mobility and decrease falls for people with mobility impairments. Learn more at www.getnexstride.com.\n\nDe Oro Devices is an award-winning tech startup that's restoring mobility, independence, and a higher quality of life to individuals with mobility challenges and/or heightened fall risk. De Oro's flagship product, NexStride, is a small, unobtrusive device that can attach to any assisted walking tool (i.e., cane, walker, or rollator), which leverages visual and auditory cueing technology to reduce fall risk and improve mobility. Learn more at www.getnexstride.com.\n\nWilliam Thompsonpr@deorodevices.com\n\nView the original press release on newswire.com.",
    "extraction_status": "success"
  },
  "https://medcitynews.com/2023/06/maternal-healthcare-postpartum-birth-fertility/_INVEST Pitch Perfect Spotlight: How Partum Health Is Working To Transform Maternal Healthcare": {
    "company": "Partum Health",
    "title": "INVEST Pitch Perfect Spotlight: How Partum Health Is Working To Transform Maternal Healthcare",
    "url": "https://medcitynews.com/2023/06/maternal-healthcare-postpartum-birth-fertility/",
    "source": "MedCity News",
    "body": "Meghan Doyle, co-founder and CEO of Partum Health, was working at a consulting firm in the healthcare sector when she first became a mom. It was during this time that she realized how confusing ...",
    "date": "2023-06-03",
    "full_content": "Meghan Doyle (left), CEO of Partum Health, accepts the MedCity INVEST Pitch Perfect award from Arundhati Parmar (right), editor-in-chief of MedCity News, May 24.\n\nMeghan Doyle, co-founder and CEO of Partum Health, was working at a consulting firm in the healthcare sector when she first became a mom. It was during this time that she realized how confusing maternal healthcare really is.\n\n“I think a lot of the things I was talking to my clients about — like the digital front door and how we build around patient-centered outcomes and multidisciplinary care models — were really absent when it came to my maternal care journey,” Doyle said in an interview. “That made a big impression on me.”\n\nTo ensure effective cost mitigation, employers can’t wait for the market to adjust — they have to punch first.\n\nWhat was absent was care for needs other than actual pregnancy care, like mental health and physical therapy. Postpartum care was also seriously lacking. Drawing from her experience, Doyle went on to create Chicago-basedPartum Healthin 2020.Judges crowned Partum Health the winner of the consumer/employer track of theMedCity News INVEST Pitch Perfect conteston May 24, preferring it over four other companies.\n\nPartum Health, a direct-to-consumer company, supports families during fertility, pregnancy and postpartum. It currently only serves patients in Illinois, but is looking to expand nationally. It offers doula care (during birth and postpartum), lactation consultants, physical therapy, nutrition support, mental health services and acupuncture. Patients can meet with the care team in the provider’s office, the patient’s home or via telehealth. They can also chat with the care team through Partum’s app.\n\n“I think the reality is, if you want to have a great postpartum experience, you actually have to start planning and doing preventative care during your pregnancy,” Doyle said. “Then we also know that, for example, when people are in the midst of fertility treatments, there’s a really high incidence of mental health challenges, and also nothing really built into that care delivery to bring mental health side-by-side with your fertility journey. There may also be instances where people need support with the physical side from [physical therapy], things like nutrition, that can really aid in supporting optimal fertility, pregnancy and postpartum.”\n\nPartum Health was chosen as the winner of the Pitch Perfect contest because it is filling an “unmet market need,” said Shawn Ellis, managing partner ofDistributed Venturesand a judge for the contest.\n\nRadiologists today face a surge in imaging volume and pressure to produce fast, accurate reports. Workflow optimization is about delivering the right results at the right time with less friction.\n\n“There was a consensus that Partum is coordination of different specialist care that’s really, really needed during pregnancy and post pregnancy,” Ellis said. “[I] loved the coordination of care, loved the very consumer-centric approach, patient-centric approach.”\n\nWhile Partum is a direct-to-consumer company, it is in-network with Blue Cross Blue Shield, Aetna, UnitedHealthcare and Cigna for its clinical services. It functions in a fee-for-service model, in which clinical care is usually reimbursed through insurance and non-clinical services like doula care is paid out of pocket or through a health savings account or flexible spending account.Down the line, the company aims to engage in more payer relationships (including Medicaid), as well as work with employers.\n\nPartum has received interest from investors as well, raising a little over $1 million in a pre-seed round from angel investors. The startup is currently raising its seed round.\n\nOther maternal health companies are gaining funding as well. Maven Clinic raised$90 millionin Series E funding in November. The company offers care including fertility, maternity and pediatric support. Oula — which provides midwifery, obstetrics and pregnancy education — raised more than$19 millionin January.\n\nPartum Health’s ultimate goal is to expand the scope of what’s considered needed in pregnancy care, Doyle said.\n\n“Our aim is that every family — just like you see an obstetrician or you see a reproductive endocrinologist if you’re going through fertility — they also have access to mental health and physical therapy and doula care,” Doyle said. “That’s really the shift that we’re trying to create. The default model really needs to be expanded to include these specialists because that’s what the families are looking for. And that’s what’s going to move the needle on the health complications and issues that people are experiencing today.”\n\nPhoto: MedCity News",
    "extraction_status": "success"
  },
  "https://www.pbs.org/video/atlantic-sea-farms-b1pe1x/_Atlantic Sea Farms": {
    "company": "Atlantic Sea Farms",
    "title": "Atlantic Sea Farms",
    "url": "https://www.pbs.org/video/atlantic-sea-farms-b1pe1x/",
    "source": "PBS",
    "body": "Atlantic Sea Farms partners with lobstermen on the rocky coast of Maine to farm kelp. Atlantic Sea Farms partners with lobstermen up and down the rocky coast of Maine to farm kelp in the region ...",
    "date": "2020-01-04",
    "full_content": "Atlantic Sea Farms\n\nSeason 2 Episode 201 | 26m 4sVideo hasClosed Captions|CC\n\nAtlantic Sea Farms partners with lobstermen on the rocky coast of Maine to farm kelp.\n\nAired 01/04/2020 | Expires 01/04/2028 | Rating TV-G\n\nSeason 2 Episode 201 | 26m 4sVideo hasClosed Captions|CC\n\nAtlantic Sea Farms partners with lobstermen on the rocky coast of Maine to farm kelp.\n\nAtlantic Sea Farms partners with lobstermen up and down the rocky coast of Maine to farm kelp in the region’s icy waters. The cultivation of this fast-growing, highly nutritious sea vegetable is creating new economic opportunities for fisheries in Maine while also benefiting the ocean. Plus, it’s delicious and chefs are finding creative ways to incorporate kelp into their menus.\n\nAired 01/04/2020 | Expires 01/04/2028 | Rating TV-G\n\nProblems playing video?Report a Problem|Closed Captioning Feedback\n\nBefore you submit an error, please consult ourVideo Help page.\n\nProblems playing video?Report a Problem|Closed Captioning Feedback\n\nBefore you submit an error, please consult ourVideo Help page.\n\ntasteMAKERSis presented by your local public television station.\n\ntasteMAKERS is made possible by our sponsors: Edward Jones, Fleischmann’s Yeast, AB Mauri, and Natural Tableware. tasteMAKERS is distributed by American Public Television.\n\nSeason 2 Episode 201 | 26m 4sVideo hasClosed Captions|CC\n\nAtlantic Sea Farms partners with lobstermen up and down the rocky coast of Maine to farm kelp in the region’s icy waters. The cultivation of this fast-growing, highly nutritious sea vegetable is creating new economic opportunities for fisheries in Maine while also benefiting the ocean. Plus, it’s delicious and chefs are finding creative ways to incorporate kelp into their menus.\n\nAired 01/04/2020 | Expires 01/04/2028 | Rating TV-G\n\nProblems playing video?Report a Problem|Closed Captioning Feedback\n\nBefore you submit an error, please consult ourVideo Help page.\n\ntasteMAKERS\n\nS2Ep201\n\ntasteMAKERSis available to stream on pbs.org and the free PBS App, available on iPhone, Apple TV, Android TV, Android smartphones, Amazon Fire TV, Amazon Fire Tablet, Roku, Samsung Smart TV, and Vizio.\n\nProviding Support for PBS.org\n\nSupport for PBS provided by:\n\ntasteMAKERSis presented by your local public television station.\n\ntasteMAKERS is made possible by our sponsors: Edward Jones, Fleischmann’s Yeast, AB Mauri, and Natural Tableware. tasteMAKERS is distributed by American Public Television.",
    "extraction_status": "success"
  },
  "https://markets.businessinsider.com/news/stocks/vidafuel-provides-free-nutritional-support-to-dialysis-patients-in-response-to-covid-19-1029058614_Vidafuel Provides Free Nutritional Support to Dialysis Patients in Response to COVID-19": {
    "company": "VidaFuel",
    "title": "Vidafuel Provides Free Nutritional Support to Dialysis Patients in Response to COVID-19",
    "url": "https://markets.businessinsider.com/news/stocks/vidafuel-provides-free-nutritional-support-to-dialysis-patients-in-response-to-covid-19-1029058614",
    "source": "Business Insider",
    "body": "NEW YORK, April 2, 2020 /PRNewswire/ -- In response to the COVID-19 pandemic, Vidafuel Nutrition, maker of dietitian-developed nutrition products, has announced a dialysis patient support program ...",
    "date": "2020-04-02",
    "full_content": "NEW YORK,April 2, 2020/PRNewswire/ -- In response to the COVID-19 pandemic, Vidafuel Nutrition, maker of dietitian-developed nutrition products, has announced a dialysis patient support program to provide its Wellness Protein drink, free of charge, to patients who are most at risk and in need of optimal nutrition. Patients with severe kidney disease, and particularly those receiving dialysis, are extremely vulnerable during this time. Adequate protein intake is critical for dialysis patients in boosting their immune systems and increasing strength to ward off infection and viruses. Furthermore, going to the grocery store is of great concern right now and shelf stable, kidney-friendly protein is in short supply.\n\nIn just a two-ounce serving, the Vidafuel Wellness Protein drink delivers 16 grams of high quality, complete protein with immune boosting essential amino acids. The product is shelf stable, renal-diet compliant with low sugar, phosphorus, potassium and sodium and without artificial sweeteners or coloring. The two-ounce serving is economical and easy to ingest, while the flavor profile is light and good tasting.\n\n\"Recognizing the vulnerability of the dialysis community to COVID-19 and the importance of optimal nutritional support, the Vidafuel board made a decision to enact this patient support program and give back to the community which we serve,\" saysBette Parolini, founder and CEO of Vidafuel Empowering Nutrition. \"We have seen first-hand the impact proper nutrition can have on these patients. We feel a responsibility to make it as accessible as possible during this time of increased risk and need.\"\n\nDietitians and social workers can request the free Wellness Protein for patients who are in most need, either financially or health wise, by submitting a request form at Patient Support Program.\n\nVidafuel is a consumer health company creating the next generation of nutritional therapy products. Nutritional intervention is critical to the daily management of a chronic disease, age related supplementation and during the recovery from an adverse event. The Vidafuel clinical team develops effective and desirable nutrition products that support the complex needs of those with kidney disease, diabetes, heart disease, cancer and the aging population.\n\nFor more information regarding Vidafuel Nutrition and its product line of dietitian developed nutrition products, visit: https://www.vida-fuel.com/. Products are available for sale directly from Amazon or the Vidafuel Website.\n\nView original content:http://www.prnewswire.com/news-releases/vidafuel-provides-free-nutritional-support-to-dialysis-patients-in-response-to-covid-19-301033768.html\n\nSOURCE  Vidafuel",
    "extraction_status": "success"
  },
  "https://www.forbes.com/sites/davidriemer/2022/11/07/jiminys-is-fighting-climate-change-one-pet-treat-at-a-time/_Jiminy's Is Fighting Climate Change One Pet Treat At A Time": {
    "company": "Jiminy's",
    "title": "Jiminy's Is Fighting Climate Change One Pet Treat At A Time",
    "url": "https://www.forbes.com/sites/davidriemer/2022/11/07/jiminys-is-fighting-climate-change-one-pet-treat-at-a-time/",
    "source": "Forbes",
    "body": "Anne Carlson, founder and CEO of Jiminy's, was two years into building her new, sustainable pet food company, before she was able to tell the story of why she created it. It turns out that the ...",
    "date": "2022-11-07",
    "full_content": "ByDavid Riemer,\n\nFormer Contributor.\n\nAnne Carlson, founder and CEO ofJiminy’s, was two years into building her new, sustainable pet food company, before she was able to tell the story of why she created it. It turns out that the story was too emotional for Carlson to share in public. It was a classic “purpose story” that began with an upsetting conversation Carlson had with her adult daughter about the future of our planet. The conversation was the “inciting incident” in her story that led the former Del Monte executive to tackle climate change by identifying new sources of protein for pet food—starting with crickets. Since creating the company, Carlson and her team have raised $6 million in seed money, secured distribution in 1,100 Petco stores, built a direct-to-consumers business and generated millions in annual revenue. Now, as Carlson looks to raise a Series A to help dramatically scale the business, she has a new storytelling challenge.\n\nBut this startup story starts with Carlson’s origin story.\n\nWhile at Del Monte, Carlson helped aggregate and sell its pet food assets and rebrand them as Big Heart Pet Brands. In 2016, the J.M. Smucker Company bought the new pet brand, and Carlson moved on to think about her next thing. Around this time, Carlson had a conversation that most parents eventually have with their adult children about whether they hope to have kids one day. Carlson’s daughter answered, “no.” She wouldn’t want to bring them into a world that was devolving due to climate change. Carlson was heartbroken. She wished her daughter would experience the same joy she had raising a family. And she might have felt a bit guilty as well about not doing enough to change the narrative. Looking back, Carlson says, “I realized that I couldn’t just do a normal job after that—building a better future for her was everything.”\n\nBecause of Carlson’s experience in the pet food business, she knew thatan estimated 25%-35%of domestic meat production was used to feed dogs and cats. Dogs alone consume 32 billion pounds of protein annually. The environmental impact of feeding pets in the U.S. is huge, because of the massive amount of land, water and feed required to raise cows and chickens. In researching alternatives, Carlson discovered that insects, especially crickets, are a tremendous source of protein that require a fraction of the resources required to produce traditional meat products. Cricket production, by example, generates 99% lessgreenhouse gasthan chicken production. Jiminy’s was created to address this macro problem. In Carlson’s early pitches, she focused on this big picture story.\n\nBut this is where things get more complicated and the real storytelling challenge emerges. The story that inspired Carlson to start the company is a memorable way to introduce Jiminy’s, but to raise a series A, she must also convince investors that there’s a massive market of pet owners willing to feed their dogs insect-based food. This is a common challenge for the founder who has a great origin story for their business. They’ve told ustheirstory, but they’ve yet to introduce the true protagonist in their product story. There has to be acustomerwith a set of needs that only Jiminy’s can solve.\n\nThe good news for Carlson is that millennial and Gen Z pet owners are extraordinarily conscious of — and troubled by — the causes of climate change; and they’re knowledgeable about emerging solutions. They also make-up nearly half the dog ownership in the U.S. Now Carlson has the protagonist for her new story.\n\nJiminy's Chewy Cricket Treat\n\nJiminy's 2022\n\nCarlson tells the story of Lauren, a millennial Jiminy’s customer who refers to her dog Mordecai as “her son.” Lauren, like Carlson’s daughter, is extremely worried about climate change so much so that she uses the “greener” peer-to-peer videoconferencing solutionCrewdleinstead of Zoom for her work and non-profit board meetings. That’s the big picture stuff. But when it comes to Mordecai, an adorable deaf rescue pup, Lauren’s concerned about her dog’s gut health. Mordecai isn’t a lot of fun to be around, when suffering from stomach ailments. Lauren also wants meal options she can provide her pet throughout the day. Custom meal services are expensive and have way too much packaging. She’d be delighted to try a more sustainable pet food, if it was healthy for the dog and came in different formats. Lauren’s heard that insects are an emerging source of protein and she’s willing to try something new.\n\nJiminy’s answers the call. Jiminy’s is asustainable pet foodusing insect protein. Once a customer like Lauren switches from a traditional meat-based pet food to Jiminy’s, for example, it could save 200,000 to 2,000,000 gallons of water every year depending on the size of the dog and whether it had been eating chicken or beef based food (Jiminy’s offers aneco-calculatorto figure this out). The food is nutritious, prebiotic and hypoallergenic. It includes fiber, iron, vitamin B2 and 12. And finally, Jiminy’s offers a host of products from wet food to treats that can feed a dog throughout the day.\n\nFor her roadshow, Carlson will lead with her emotional origin story and quickly pivot to Lauren’s story. Prospective investors will learn why Carlson is so passionate about creating a new pet brand to fight climate change, and why customers like Lauren are buying it. Lauren says, “since switching (brands), Mordecai is a whole new dog. He's healthier, his fur is softer, his breath is better, and we can now breathe around him!” And Lauren also feels like she’s doing her part for the planet. It’s a powerful one-two punch that Carlson hopes will help her raise an $8 million series A to expand her business and promote a healthier future one dog at a time.",
    "extraction_status": "success"
  },
  "https://markets.businessinsider.com/news/stocks/new-and-real-world-research-supports-braincheck-s-cognitive-assessment-and-care-planning-solutions-1032812763_New and Real-World Research Supports BrainCheck's Cognitive Assessment and Care Planning Solutions": {
    "company": "BrainCheck",
    "title": "New and Real-World Research Supports BrainCheck's Cognitive Assessment and Care Planning Solutions",
    "url": "https://markets.businessinsider.com/news/stocks/new-and-real-world-research-supports-braincheck-s-cognitive-assessment-and-care-planning-solutions-1032812763",
    "source": "Business Insider",
    "body": "Clinicians and patients report high levels of satisfaction with BrainCheck's standard battery, Assess™ and care planning tool, Plan™ Studies confirm Assess can effectively determine severity ...",
    "date": "2023-11-13",
    "full_content": "Clinicians and patients report high levels of satisfaction with BrainCheck's standard battery, Assess™ and care planning tool, Plan™\n\nStudies confirm Assess can effectively determine severity of cognitive impairment\n\nAUSTIN, Texas,Nov. 13, 2023/PRNewswire/ --BrainCheck, Inc.announced promising new and real-world data supporting BrainCheck's cognitive assessment and care planning solutions was recently presented at The Gerontological Society of America's Annual Scientific Meeting fromNovember 8-12inTampa, FL.Studies confirm clinicians and patients report high levels of satisfaction with BrainCheck's standard battery, Assess™, and care planning tool, Plan™. Research also showed Assess can effectively determine severity of cognitive impairment.\n\n\"More than 7 million Americans are unaware they have mild cognitive impairment (MCI), and 99% of primary care physicians (PCPs) are under-diagnosing the condition,1,2suggesting clinicians and patients are critically in need of a reliable and intuitive solution to help detect MCI earlier,\" saidKim Rodriguez, CEO of BrainCheck. \"BrainCheck's plug-and-play technology is the only solution of its kind that empowers providers with an all-in approach to cognitive care, offering the tools needed to intervene sooner and combat cognitive decline. And now, our latest version offers unparalleled flexibility for use in-clinic or remotely, making this technology even more accessible and easy to implement in the clinical setting.\"\n\nClinicians and Patients Report High-Level of Satisfaction with BrainCheck in Real-World StudyA collaborative quality improvement study with Savannah Neurology Specialists and Dent Neurologic Institute evaluated usage, reimbursement and usability of BrainCheck's standard battery, Assess, and care planning tool, Plan and determined patients and clinicians showed a high level of satisfaction with the technology.\n\n\"Our collaboration with BrainCheck has opened a new chapter in our approach to patient care planning and support,\" saidBela Ajtai, MD, Director of the Center for Cognitive Disorders and Brain Health at Dent Neurologic Institute, one of the largest outpatient neurology practices in the U.S. \"Providers appreciate the value of BrainCheck as a promising solution to the increasing demand for cognitive care in an aging population. Patients and care partners value the information and resources presented in care plans. With this leading-edge technology, we are taking a significant step toward improving the quality of care for patients facing cognitive challenges.\"\n\nAccurately Distinguishing Severity of Cognitive ImpairmentResearchers confirmed BrainCheck's standard battery, Assess, effectively distinguished normal cognition (NC) from stages of cognitive decline, which may be associated with mild cognitive impairment (MCI) and dementia (DEM), providing a potentially reliable tool for early detection of cognitive impairment.4\n\n\"With dementia projected to affect 14 million people inthe United Statesand 152 million people globally in the coming decades, early detection of cognitive impairment is paramount but remains a challenge with current clinical protocols,\" saidReza Hosseini Ghomi, MD, MSE, neuropsychiatrist and Chief Medical Officer at BrainCheck. \"BrainCheck's platform offers an efficient end-to-end cognitive care solution that can be operationalized in any clinical setting. These research results confirm our standard battery, Assess, is a reliable and efficient tool for early detection of impairment, marking a significant advancement in addressing cognitive decline.\"\n\nTrusted by hundreds of the country's most prestigious providers and specialists, BrainCheck's clinically-proven platform is the most comprehensive solution commercially available across the cognitive care continuum, streamlining screening, assessment, care planning and monitoring.\n\nAbout BrainCheckTo learn more, please visit braincheck.com.\n\nContact:pr@braincheck.com\n\n1Soeren Mattke et al, Expected and diagnosed rates of mild cognitive impairment and dementia in the U.S. Medicare population: observational analysis, Alzheimer's Research & Therapy (2023). DOI: 10.1186/s13195-023-01272-z2Detection Rates of Mild Cognitive Impairment in Primary Care for the United States Medicare Population, The Journal of Prevention of Alzheimer's Disease (2023). DOI: 10.14283/jpad.2023.1313Huang B., et al. Implementation of BrainCheck for Cognitive Assessment and Care Planning in the Clinical Setting. Poster presented at The Gerontological Society of America's Annual Scientific Meeting;November 8-12, 2023.Tampa, FL4Huang B., et al. Early Detection of Dementia and Mild Cognitive Impairment With BrainCheck-Assess. Poster presented at The Gerontological Society of America's Annual Scientific Meeting;November 8-12, 2023.Tampa, FL\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/new-and-real-world-research-supports-brainchecks-cognitive-assessment-and-care-planning-solutions-301985593.html\n\nSOURCE  BrainCheck, Inc.",
    "extraction_status": "success"
  },
  "https://www.businesswire.com/news/home/20200402005201/en/Flowly-App-Helps-Reduce-Coronavirus-Stress-Anxiety_Flowly App Helps Reduce Coronavirus Stress and Anxiety; Pledges Support for COVID-19 Relief Efforts": {
    "company": "Flowly",
    "title": "Flowly App Helps Reduce Coronavirus Stress and Anxiety; Pledges Support for COVID-19 Relief Efforts",
    "url": "https://www.businesswire.com/news/home/20200402005201/en/Flowly-App-Helps-Reduce-Coronavirus-Stress-Anxiety",
    "source": "Business Wire",
    "body": "LOS ANGELES--(BUSINESS WIRE)--Flowly, the mobile app for pain and anxiety management, today announced new offerings to help people cope with Coronavirus-related stress and anxiety, while pledging ...",
    "date": "2020-04-02",
    "full_content": "Flowly App Helps Reduce Coronavirus Stress and Anxiety; Pledges Support for COVID-19 Relief Efforts\n\nCompany to donate $0.50 to GlobalGiving Coronavirus Relief Fund for every app session completed\n\nFlowly App Helps Reduce Coronavirus Stress and Anxiety while raising money for GlobalGiving Coronavirus Relief Fund (Graphic: Business Wire)\n\nLOS ANGELES--(BUSINESS WIRE)--Flowly, the mobile app for pain and anxiety management, today announced new offerings to help people cope with Coronavirus-related stress and anxiety, while pledging monetary support for COVID-19 relief efforts. The Flowly app #BreatheTogether experience features targeted breathing exercises in an interactiveenvironment designed specifically to reduce anxiety, which has been magnified as a result of the Coronavirus pandemic. Flowly’s #BreatheTogether experience is free and available for download in theApp Storeand atwww.flowly.world.\n\n“The Coronavirus is not only affecting physical health, but is also taking a toll on mental health all around the world. The day-to-day uncertainty has led to a tremendous increase in stress and anxiety, and Flowly is here to help you manage that,” said Celine Tien, co-founder & CEO, Flowly. “Our proven breathing and relaxation techniques can help you better cope during these uncertain times and your participation will also help benefit first responders and those in need as we make a donation for every Flowly app session you complete.”\n\nFlowly has teamed up withGlobalGivingto provide critical relief for COVID-19. Flowly will allocate $0.50 for every and any session completed towards theCoronavirus Relief Fund, helping send doctors and nurses to affected communities, supply masks, ventilators, and other medical supplies to hospitals, and deliver essential items to families and children in need.\n\nFlowly offers interactive experiences that engage users in biofeedback for relaxation training. The app immerses users in 360 degree and virtual reality worlds that train them to relax and regulate their nervous systems to better manage pain, stress, and anxiety. Flowly experiences are all mobile, allowing users to engage in the virtual worlds on their phones or with VR headsets. The first eight Flowly Intro sessions and #BreatheTogether experience are available to all users whodownload the app.\n\nTo learn more about Flowly and to start managing your pain and anxiety today, visitwww.flowly.world.\n\nAbout Flowly\n\nFlowly is your app to help manage chronic pain, stress and anxiety. Founded in 2019 by two Yale classmates and an award-winning designer, Flowly’s mission is to take typically inaccessible therapies like biofeedback and virtual reality, and put it in the hands of the people who need it most. The company’s easy-to-use and accessible VR platform guides users in relaxation training to regulate their nervous systems while immersed in beautiful and relaxing VR environments. Flowly tracks user progress and offers an online community forum to share and support with other members. To learn more, visitwww.flowly.world.\n\nFlowlyDonna Loughlin Michaels(408) 393-5575 |donna@lmgpr.com\n\nFlowlyDonna Loughlin Michaels(408) 393-5575 |donna@lmgpr.com\n\nFlowlyDonna Loughlin Michaels(408) 393-5575 |donna@lmgpr.com",
    "extraction_status": "success"
  },
  "https://finance.yahoo.com/news/partum-health-expands-dallas-mission-124100615.html_Partum Health Expands to Dallas, On A Mission to Elevate Maternal Care Throughout Texas": {
    "company": "Partum Health",
    "title": "Partum Health Expands to Dallas, On A Mission to Elevate Maternal Care Throughout Texas",
    "url": "https://finance.yahoo.com/news/partum-health-expands-dallas-mission-124100615.html",
    "source": "Yahoo Finance",
    "body": "Partum Health was founded with a mission to change the standard of maternal care after its founders witnessed the huge gap between the care they needed and what they actually received during their ...",
    "date": "2024-08-21",
    "full_content": "The maternal health start-up provides expert support for growing families through proactive care from pre-conception through early parenthood.\n\nCHICAGO,Aug. 21, 2024/PRNewswire/ --Partum Health, theChicago-based maternal health startup that offers direct-to-consumer interdisciplinary pregnancy and postpartum care, is expanding toDallas, the brand's third market. Partum was founded inChicagoin 2021 and expanded toHoustoninNovember 2023afterraising$3.1 millionin seed funding.\n\nInthe United States, more women die each year of pregnancy-related complications than in any other developed country, with the majority of those deaths happening between one week and one year of giving birth. And inTexas, the need is especially acute. A2022 studypublished by the Texas Medical Association ranked the state 50th among all states in access to high-quality prenatal and maternal care, citing barriers to health care before and after their hospital stay as a key factor. Moreover, areportlast year by the Texas Health and Human Services Commission found that 90% of the state's pregnancy-related deaths are preventable, recommending an improvement in care coordination and access to comprehensive health services to achieve better outcomes.\n\nPartum Health was founded with a mission to change the standard of maternal care after its founders witnessed the huge gap between the care they needed and what they actually received during their own families' perinatal experiences.\n\nIn addition to a comprehensive network of postpartum specialty providers across lactation, mental health, physical therapy and more, Partum families also have a dedicated care coordinator. This go-to contact helps parents make informed decisions, schedule appointments, navigate insurance and is available 24/7 via text. To help remove barriers to access, Partum's services are available virtually and in-home to meet the dynamic needs of modern families.\n\n\"We built Partum to help bridge the gap in comprehensive maternal health and improve outcomes during the critical postpartum period. Our offerings are focused on preventing the most common complications of pregnancy, including perinatal mood and anxiety disorders and avoidable C-sections, among others. We look forward to partnering with OBs and Midwives acrossDallas/Fort Worthto provide wraparound, interdisciplinary care to their patients,\" saidMeghan Doyle, co-founder and CEO of Partum Health.\n\nTo support its launch inDallas, Partum is hosting gatherings to engage local communities around women's health.Collaborative Care in Women's Healthwill bring together women's health providers across the spectrum of care to discuss how to better integrate in service of improved patient outcomes.Reconnecting and Finding Intimacywill convene experts for an honest discussion on social and emotional wellbeing postpartum. Partum will also be meeting with local expectant families at the Prego Expo Convention.\n\nAbout Partum Health\n\nPartum Health believes all families deserve comprehensive, whole-person care that supports their mental, physical and emotional health needs throughout the pregnancy and postpartum experience. Through digital care coordination and patient education as well as interdisciplinary services offered virtually and in person by expert care providers, Partum Health makes this a reality for families. For more information, please visitwww.partumhealth.comor follow Partum Health onInstagram,Facebook,XandLinkedIn.\n\nMedia Contact:Sona Jones877-381-5221382123@email4pr.com\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/partum-health-expands-to-dallas-on-a-mission-to-elevate-maternal-care-throughout-texas-302226913.html\n\nSOURCE Partum Health",
    "extraction_status": "success"
  }
}