{
  "https://www.foxnews.com/media/elon-musk-congratulates-spacex-nasa-excellent-work-rescuing-stranded-astronauts_Elon Musk congratulates SpaceX, NASA for 'excellent work' rescuing stranded astronauts": {
    "company": "SpaceX",
    "title": "Elon Musk congratulates SpaceX, NASA for 'excellent work' rescuing stranded astronauts",
    "url": "https://www.foxnews.com/media/elon-musk-congratulates-spacex-nasa-excellent-work-rescuing-stranded-astronauts",
    "source": "Fox News",
    "body": "DOGE head and SpaceX founder Elon Musk describes his elation on 'Hannity' after two stranded astronauts returned to Earth after spending months in space.",
    "date": "2025-03-19T02:14:00+00:00",
    "full_content": "Elon Musk offers his 'congratulations' after SpaceX rescues stranded astronauts | Fox News Recommended 17:38 Greg Gutfeld: Dems are responsible for their own demise 01:20 Tim Walz says Trump makes people feel like 'part of something' 01:35 Texas Gov. Greg Abbott says daily border crossings in El Paso have plummeted under Trump 01:43 Sunny Hostin scolds Schumer that he 'caved' on GOP spending bill 01:19 Chuck Schumer shrugs off suggestion he should step down as party leader 01:32 Rep. Moulton warns Dems need to reform, stop being party who 'preach' and 'scold' 08:56 Trump is sending a clear message to every illegal immigrant: Judge Jeanine 07:13 Sean Hannity: The Democratic Party is officially a dumpster fire 05:33 'Seen and Unseen': Dems need a moment to figure out their messaging 08:15 Comedian Andrew Schulz on the Statue of Liberty and 'conquering' Greenland 00:30 Border czar Homan schools reporter for referring to Alien Enemies Act as 'old law,' cites U.S. Constitution 01:49 'The View' co-hosts blast Schumer for voting to avert shutdown, promise to grill him during upcoming interview 04:50 DOJ lawyer denounces her firing over handling of Mel Gibson gun case 01:32 Randi Weingarten tells MSNBC she's 'spitting mad' over Education Department staffing cuts 01:43 Jasmine Crockett hits back at criticism of viral 'choose your fighter' video of Dems 05:02 Elon is Trump's 'heat shield' against government cuts, Democratic strategist says 08:30 'Overvalued' markets were 'due for a correction' following Trump's tariffs: Caroline Downey 08:28 Mahmoud Khalil shows 'no evidence' of Hamas support, Glenn Greenwald says 01:28 MSNBC panel unloads on Sen. Chuck Schumer over support for GOP spending bill 01:15 CNN’s Van Jones says Dems unleashing ‘volcanic anger’ towards Schumer for caving on spending bill close Video Elon Musk celebrates 'moment of optimism' after NASA astronauts' return to Earth on SpaceX Elon Musk congratulates SpaceX team for 'excellent work' in bringing home the stranded astronauts, addresses 'domestic terrorism' against his company for his association with Trump and more on 'Hannity.' Billionaire and tech titan Elon Musk shared his congratulations to SpaceX and NASA following the rescue of two astronauts stranded at the International Space Station for roughly the past nine months. \"Thanks to the excellent work of the SpaceX team working with NASA, the astronauts are now safely home. And so congratulations to the SpaceX NASA teams on excellent work,\" Musk said during an exclusive interview on \"Hannity\" Tuesday. The SpaceX founder and face of the Department of Government Efficiency (DOGE) also offered a \"huge note of appreciation\" to President Donald Trump \"for prioritizing and expediting the return.\" SPACEX DRAGON CAPSULE STICKS SPLASHDOWN LANDING AS NASA ASTRONAUTS RETURN HOME AFTER MONTHS STUCK IN SPACE Astronauts Butch Wilmore and Suni Williams had been on the International Space Station since June 2024. Their mission was only scheduled to last one week after the launch of Boeing's first astronaut flight. However, after the spacecraft encountered technical issues, and NASA determined it unsafe for it to arrive back to Earth with the astronauts on board, Wilmore and Williams remained stuck at the International Space Station for months. Wilmore, Williams, Crew-9 Commander Nick Hague and Russian cosmonaut Aleksandr Gorbunov made their return to Earth on Tuesday, with a splashdown off the coast of Florida just before 6 p.m. ET. Video Wilmore and Williams' return became a political issue for the Trump administration, with Musk previously telling Fox News host Sean Hannity on Feb. 18 that former President Joe Biden left the astronauts in space for \"political reasons.\" Shortly after taking office, Trump tasked Musk with bringing home the two astronauts, who he said had been \"abandoned\" by the Biden administration. Video STRANDED ASTRONAUT SAYS HE BELIEVES MUSK'S CLAIMS THAT BIDEN REFUSED TO CONDUCT RESCUE MISSION Trump also blasted Biden for not acting sooner. \"I have just asked Elon Musk and @SpaceX to ‘go get’ the 2 brave astronauts who have been virtually abandoned in space by the Biden Administration. They have been waiting for many months on @Space Station. Elon will soon be on his way. Hopefully, all will be safe. Good luck Elon!!!\" posted Trump at the time . Video In a post-landing news conference with SpaceX and NASA officials on Tuesday, Deputy Associate Administrator, NASA Space Operations Mission Directorate Joel Montalbano was asked about Trump and Musk's claims that the Biden administration didn't want to bring the Starliner crew back for political reasons. Video \"Yeah, so I wasn't involved in any conversations with the previous administration,\" Montalbano said. \"It was clear we had a request from the current administration, and the results you saw are what we saw today with the landing of Crew-9.\" CLICK HERE TO GET THE FOX NEWS APP Hannity pressed Musk on the politics behind the astronauts' delayed return, and Musk set the record straight on his communications with the previous Biden administration. \"We definitely offered to return the astronauts earlier. There's no question about that,\" Musk said. \"The astronauts were only supposed to be there for eight days, and they've been there for almost ten months. So, obviously, that doesn't make any sense. SpaceX could have brought the astronauts back after a few months at most, and we made that offer to the Biden administration. It was rejected for political reasons, and that's just a fact.\" Fox News' Jonathan Serrie, Landon Mion, Diana Stancy, Christina Shaw and Reuters contributed to this report. Madeline Coggins is a Digital Production Assistant on the Fox News flash team with Fox News Digital. Fox News First Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox. Arrives Weekdays By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use , and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Subscribe Subscribed Subscribe You've successfully subscribed to this newsletter!"
  },
  "https://www.msn.com/en-us/money/other/why-oracle-could-be-key-to-a-tiktok-deal/ar-AA1BbWvh_Why Oracle Could Be Key to a TikTok Deal": {
    "company": "ByteDance",
    "title": "Why Oracle Could Be Key to a TikTok Deal",
    "url": "https://www.msn.com/en-us/money/other/why-oracle-could-be-key-to-a-tiktok-deal/ar-AA1BbWvh",
    "source": "Bloomberg",
    "body": "TikTok parent company ByteDance Ltd. is once again racing toward a deadline to sell off its popular video app or face a ban in the US. Several interested buyers have publicly emerged, and the most discussed deal scenarios involve a key role for a longtime partner of the video platform: Oracle Corp.",
    "date": "2025-03-18T22:37:14+00:00",
    "full_content": "MSN"
  },
  "https://www.musicbusinessworldwide.com/openai-is-pushing-for-donald-trump-to-usher-in-weakened-copyright-protections-in-the-us-paul-mccartney-is-fighting-back/_OpenAI is pushing for Donald Trump to weaken copyright protections in the US. Paul McCartney is fighting back.": {
    "company": "OpenAI",
    "title": "OpenAI is pushing for Donald Trump to weaken copyright protections in the US. Paul McCartney is fighting back.",
    "url": "https://www.musicbusinessworldwide.com/openai-is-pushing-for-donald-trump-to-usher-in-weakened-copyright-protections-in-the-us-paul-mccartney-is-fighting-back/",
    "source": "Music Business Worldwide",
    "body": "Letter signed by 400 creative types, including a Beatle, issued after startling submission to US government by OpenAI and Google.",
    "date": "2025-03-19T08:23:00+00:00",
    "full_content": "OpenAI is pushing for Donald Trump to weaken copyright protections in the US. Paul McCartney is fighting back. March 19, 2025 By Tim Ingham Pic credits: Shutterstock OpenAI founder Sam Altman finds himself up against Sir Paul McCartney in the battle to convince US lawmakers over copyright laws and artificial intelligence The maker of ChatGPT, OpenAI, has called for fundamental changes to US copyright law that would allow AI companies to use copyrighted works without permission or compensation to rightsholders. Continue to article... That’s according to a fresh policy submission to the White House Office of Science and Technology Policy (OSTP). The document does not make happy reading for copyright holders, which explains why music stars like Sir Paul McCartney, Paul Simon, and Bette Midler have joined hundreds of Hollywood celebrities in signing a letter pushing back against the proposals. The submission, filed by OpenAI on March 13 ( read it in full here ), is part of the tech company’s response to the Trump administration’s request for information on developing a national AI Action Plan . Both OpenAI and Google submitted detailed policy frameworks that could significantly impact music rightsholders and other content creators. These submissions represent high-stakes policy positioning as the Trump administration develops its AI Action Plan, which could fundamentally shape how creative works are protected â or not protected â in the rapidly evolving AI ecosystem. OpenAI Calls for Unrestricted AI Training Access In its March 13 submission, OpenAI heavily focuses on the concept of “fair use” â i.e. platforms being able to use copyright in certain circumstances without punishment. The firm explicitly argues that applying the ‘fair use’ doctrine to AI in the United States is “not only a matter of American competitiveness â it’s a matter of national security” ,Â while warning that without it having free access to copyrighted materials, “the race for AI is effectively over” . In OpenAI’s eyes, China will win that race if the US doesn’t loosen its copyright laws. “If [China’s] developers have unfettered access to data and American companies are left without fair use access , the race for AI is effectively over. America loses , as does the success of democratic AI.” OpenAI submission The relevant quote from the OpenAI submission reads: “Applying the fair use doctrine to AI is not only a matter of American competitiveness â it’s a matter of national security . The rapid advances seen with the PRC [People’s Republic Of China]’s DeepSeek , among other recent developments, show that America’s lead on frontier AI is far from guaranteed.” OpenAI adds: “Given concerted state support for critical industries and infrastructure projects, there’s little doubt that the PRC’s AI developers will enjoy unfettered access to data â including copyrighted data â that will improve their models. “If the PRC’s developers have unfettered access to data and American companies are left without fair use access , the race for AI is effectively over. America loses , as does the success of democratic AI.” OpenAI’s submission further states: “American copyright law, including the longstanding fair use doctrine, protects the transformative uses of existing works, ensuring that innovators have a balanced and predictable framework for experimentation and entrepreneurship.” Did OpenAI just give a gift to music’s lobbyists? Passages in Â OpenAI’s Â submission could be interpreted as acknowledging thatÂ current US copyright law restricts the company’s desired activities, though theÂ language is somewhat ambiguous. One notable section is where OpenAI states: “If the PRC’s developers have unfettered access to data and American companies are left without fair use access, the race for AI is effectively over.” The wording of the phrase “if American companies are left without fair use access” implies that AI companies in the US might need specific new ‘fair use’ protections drafted to continue using copyrighted materials. In turn, that could be interpreted as recognition that without such clear protections â i.e. under today’s laws â their activities might be legally questionable. Google Aligns with OpenAI on Copyright Stance Google’s submission ( read it in full here ) echoes similar sentiments, though with slightly less alarmist language. The search giant argues that “balanced copyright rules, such as fair use and text-and-data mining exceptions , have been critical to enabling AI systems to learn from prior knowledge and publicly available data, unlocking scientific and social advances.” âWe support Americaâs existing fair use framework, and weâre confident that current copyright law enables AI innovation.â Google spokesperson The company adds that these exceptions “allow for the use of copyrighted, publicly available material for AI training without significantly impacting rightsholders and avoid often highly unpredictable, imbalanced, and lengthy negotiations with data holders during model development or scientific experimentation.” It warns that copyright laws could, under certain interpretations, “impede appropriate access to data necessary for training leading models”. Subsequent to the submission being filed, a Google spokesperson said in a statement, âWe support Americaâs existing fair use framework, and weâre confident that current copyright law enables AI innovation.â The McCartney response Stars from the world of film, TV, and music have signed a letter in response to the OpenAI and Google proposals, including Cate Blanchett, Cynthia Erivo, Paul McCartney, Paul Simon, Ron Howard, Taika Waititi, Chris Rock, Ben Stiller, Mark Ruffalo, Guillermo del Toro , and Ava Duvernay. In their letter to the US government this week, the copyright-makers state, “We firmly believe that Americaâs global AI leadership must not come at the expense of our essential creative industries.” They add that the US arts and entertainment industry provides more than 2.3 million jobsÂ and “ provides the foundation forÂ American democratic influence and soft power abroad .” The letter continues: â[AI] companies are asking to undermine this economic and cultural strength by weakening copyright protections for the films, television series, artworks, writing, music, and voices used to train AI models at the core of multi-billion dollar corporate valuations.â You can read the letter â signed by 400 famous creators â in full below: Hello Friends & Strangers. As you may be aware there has recently been a recommendation by OpenAI & Google to the current US Administration that is gaining alarming traction to remove all legal protections & existing guardrails surrounding copyright law protections for the training of Artificial Intelligence. This rewriting of established law in favor of so-called âFair Useâ was in need of an initial response by 11:59 PM ET Saturday, so we have submitted an initial letter with the signatories we had at that time. We are now continuing to accept signatures for an amendment to our initial statement. Please feel free to forward this to anyone you think may be invested in the ethical maintenance of their intellectual property. You can add your name and whatever guilds or unions or description of self you feel appropriate, but please do not edit the letter itself. Thank you so much for kicking this out wide on a Saturday Night! Hollywoodâs Response to the Administrationâs Artificial Intelligence Action Plan and necessity that copyright law be upheld. We, the members of Americaâs entertainment industry â representing an intersection of cinematographers, directors, producers, actors, writers, studios, production companies, musicians, composers, costume, sound & production designers, editors, gaffers, union and Academy Members, and other industrious, creative content professionals â submit this unified statement in response to the Administrationâs request for input on the AI Action Plan. We firmly believe that Americaâs global AI leadership must not come at the expense of our essential creative industries. Americaâs arts and entertainment industry supports over 2.3M American jobs with over $229Bn in wages annually, while providing the foundation for American democratic influence and soft power abroad. But AI companies are asking to undermine this economic and cultural strength by weakening copyright protections for the films, television series, artworks, writing, music, and voices used to train AI models at the core of multi-billion dollar corporate valuations. Make no mistake: this issue goes well beyond the entertainment industry, as the right to train AI on all copyright-protected content impacts all of Americaâs knowledge industries. When tech and AI companies demand unfettered access to all data and information, theyâre not just threatening movies, books, and music, but the work of all writers, publishers, photographers, scientists, architects, engineers, designers, doctors, software developers and all other professionals who work with computers and generate intellectual property. These professions are the core of how we discover, learn, and share knowledge as a society and as a nation. This issue is not just about AI leadership or about economics and individual rights, but about Americaâs continued leadership in creating and owning valuable intellectual property in every field. It is clear that Google (valued at $2Tn) and OpenAI (valued at over $157Bn) are arguing for a special government exemption so they can freely exploit Americaâs creative and knowledge industries, despite their substantial revenues and available funds. There is no reason to weaken or eliminate the copyright protections that have helped America flourish. Not when AI companies can use our copyrighted material by simply doing what the law requires: negotiating appropriate licenses with copyright holders â just as every other industry does. Access to Americaâs creative catalog of films, writing, video content, and music is not a matter of national security. They do not require a government-mandated exemption from existing U.S. copyright law. America didnât become a global cultural powerhouse by accident. Our success stems directly from our fundamental respect for IP and copyright that rewards creative risk-taking by talented and hardworking Americans from every state and territory. For nearly 250 years, U.S. copyright law has balanced creatorâs rights with the needs of the public, creating the worldâs most vibrant creative economy. We recommend that the American AI Action Plan uphold existing copyright frameworks to maintain the strength of Americaâs creative and knowledge industries, as well as American cultural influence abroad. Music Business Worldwide Analysis United States MBW Explains Related Posts 5 key arguments from UMG’s attempt to dismiss Drake’s defamation lawsuit: ‘These claims are no more than Drake’s attempt to save face.’ Sony generated $2.70 billion from recorded music and publishing in calendar Q4, as ATEEZ topped firm’s global sales chart Using copyrighted content to train AI without permission is not âfair useâ, US court rules in Thomson Reuters case Can AI-generated content be copyrighted? Hereâs what a new report from the US Copyright Office says… The best of MBW, plus the most important music biz stories on the web. Delivered for FREE, direct to your inbox each day. Sign Up to The MBW Newsletter Sign Up Search"
  },
  "https://techcrunch.com/2025/02/27/stripe-finalizes-tender-sale-at-a-91-5b-valuation-says-payment-volumes-grew-to-1-4t-in-2024/_Stripe finalizes tender sale at a $91.5B valuation, says payment volumes grew to $1.4T in 2024": {
    "company": "Stripe",
    "title": "Stripe finalizes tender sale at a $91.5B valuation, says payment volumes grew to $1.4T in 2024",
    "url": "https://techcrunch.com/2025/02/27/stripe-finalizes-tender-sale-at-a-91-5b-valuation-says-payment-volumes-grew-to-1-4t-in-2024/",
    "source": "TechCrunch",
    "body": "Digital payments platform Stripe has yet to lay out plans to go public, but in the meantime the company has thrown past and present employees a line for",
    "date": "2025-02-27T14:39:00+00:00",
    "full_content": "Stripe finalizes tender sale at a $91.5B valuation, says payment volumes grew to $1.4T in 2024 | TechCrunch Stripe finalizes tender sale at a $91.5B valuation, says payment volumes grew to $1.4T in 2024 | TechCrunch Image Credits: SOPA Images / Contributor / Getty Images Fintech Stripe finalizes tender sale at a $91.5B valuation, says payment volumes grew to $1.4T in 2024 Ingrid Lunden 6:32 AM PST · February 27, 2025 Digital payments platform Stripe has yet to lay out plans to go public, but in the meantime the company has thrown past and present employees a line for some liquidity. The company on Thursday confirmed a tender offer where investors will buy up shares from those employees at a valuation of $91.5 billion. Stripe said it will also repurchase shares as part of the transaction. A spokesperson declined to say who is in the secondary round except to confirm that it is “largely” existing investors. Past backers of the company number at over 150 investors per PitchBook data . They include General Catalyst, GV, Silver Lake, Atomico, Elon Musk, Salesforce and many more. The tender offer is a decent jump on the company’s valuation from its last secondary sale a year ago, which was valued at $70 billion . However, Stripe still fell short of its high-watermark $95 billion valuation back in 2021. That round came at a time when e-commerce itself was booming due to the COVID-19 pandemic, and it made Stripe, at the time and only on paper, the most valuable privately-held tech company in the world. The news coincides with Stripe’s annual letter penned by CEO and co-founder Patrick Collison, which noted that payment volume in 2024 grew to $1.4 trillion, up 38% on the year before. It’s a big number for Stripe, but to put it into some context, Visa said that its payment volume for 2024 was $13.2 trillion. The margin that Stripe makes on transactions (which are what make up payment volume) remains thin, and so this business remains one where it still has room to (and needs to) scale. Stripe also added that it is now used by half of the Fortune 100 companies, underscoring how it has catapulted from a startup working with other startups, into a major enterprise player. The tender offer was originally reported to be in the works earlier this month . Topics Biotech & Health , Fintech , Fundraising , payments , secondary , stripe Ingrid Lunden Europe Editor Ingrid is a writer and editor for TechCrunch, joining February 2012, based out of London. Before TechCrunch, Ingrid worked at paidContent.org, where she was a staff writer, and has in the past also written freelance regularly for other publications such as the Financial Times. Ingrid covers mobile, digital media, advertising and the spaces where these intersect. When it comes to work, she feels most comfortable speaking in English but can also speak Russian, Spanish and French (in descending order of competence). View Bio Most Popular NASA astronauts return from long Space Station stay prompted by Boeing problems Sean O'Kane What Tesla can and can’t do in California with its new passenger transportation permit Kirsten Korosec Nvidia announces two ‘personal AI supercomputers’ Rebecca Szkutak CISA scrambles to contact fired employees after court rules layoffs ‘unlawful’ Carly Page Confirmed: Google buys Wiz for $32B to beef up in cloud security Ingrid Lunden Rippling sues Deel, Deel denies ‘all legal wrongdoing,’ and Slack is the main witness Ingrid Lunden People are using Google’s new AI model to remove watermarks from images Kyle Wiggers Newsletters See More Subscribe for the industry’s biggest tech news TechCrunch Daily News Every weekday and Sunday, you can get the best of TechCrunch’s coverage. TechCrunch AI TechCrunch's AI experts cover the latest news in the fast-moving field. TechCrunch Space Every Monday, gets you up to speed on the latest advances in aerospace. Startups Weekly Startups are the core of TechCrunch, so get our best coverage delivered weekly. No newsletters selected. Subscribe By submitting your email, you agree to our Terms and Privacy Notice . Related Latest in Fintech See More Fintech These fintech companies are hiring in 2025 after a turbulent year Mary Ann Azevedo 2 days ago Fintech Klarna nabs Walmart away from Affirm and boosts its IPO prospects Mary Ann Azevedo 2 days ago Startups Profitable Klarna files for a potentially blockbuster IPO Julie Bort 5 days ago"
  },
  "https://www.yahoo.com/lifestyle/coach-owner-tapestry-files-trademark-194143470.html_Coach's Owner Tapestry Files Trademark Infringement Suit Against Shein": {
    "company": "SHEIN",
    "title": "Coach's Owner Tapestry Files Trademark Infringement Suit Against Shein",
    "url": "https://www.yahoo.com/lifestyle/coach-owner-tapestry-files-trademark-194143470.html",
    "source": "Yahoo",
    "body": "Like its chief fast-fashion rival Temu, Shein is facing multiple cases of trademark infringement by companies and artists.",
    "date": "2025-03-18T19:41:00+00:00",
    "full_content": "Coach’s Owner Tapestry Files Trademark Infringement Suit Against Shein Advertisement Advertisement Advertisement Return to Homepage Don't Miss Multiple kids in small spaces 85% of centenarians are women 'Freezer library' Look at nature Health myths debunked 5-hour rule for learning Man who invented run crews Taking back your attention Cut the risk of depression 10 years of 'Hot Ones' Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways Tapestry’s Coach has filed a suit against the fast-fashion specialist Shein for trademark counterfeiting, federal trademark infringement, false advertising and unfair competition. The 30-page complaint was filed on Thursday in the U.S. District Court in the Central District of California by Tapestry Inc., Coach Services Inc. and Coach IP Holdings against Zoetop Business Co. and Shein U.S. Services. A juried trial is being sought. More from WWD Trump's Tariffs: The Hot-button Topic at AAFA Executive Summit in D.C. Jewelry Designer Pamela Love Sues Alex and Ani Beneficial Owners for Unpaid Consulting Fees and Sales Royalties Chanel and What Goes Around Comes Around Hear Final Judgment for Infringement Case Advertisement Advertisement Advertisement The suit alleges that Shein used commerce marks that are “identical or substantially indistinguishable or confusingly similar to Coach trademarks in connection with the sale, distribution and/or advertising” of the alleged counterfeit products. The allegations include that when one searches for “coach” on Shein’s e-commerce site, there is “no indication” that any of the products originated from a third-party seller. When a shopper selects “what appears to be legitimate ‘ Coach ’ product for purchase, the third-party seller’s information is so small and inconspicuous that the shopper could “reasonably believe” that Shein was the seller with title or possession of the product. Attorneys for Tapestry and Coach did not respond immediately Tuesday afternoon to requests for comment, nor did an attorney for Shein. Representatives at both companies also had not returned media requests as of Tuesday afternoon. Designer dupes and fake fashion items are an ongoing issue for major brands. Nearly seven in 10 consumers were deceived into buying counterfeit products online at least once in 2023, according to research by Michigan State University’s College of Communication Arts and Sciences. Less than two years ago, the U.S. Congress passed the Integrity, Notification and Fairness in Online Retail Marketplaces for Consumers Act to better inform consumers about third-party sellers and to reduce the number of fake and stolen goods that are sold online. Advertisement Advertisement Advertisement The complaint features multiple pages with photographs of the alleged counterfeit Coach products including tote bags, handbags, shoes, hats and purses. Tapestry alleges that Shein made, marketed and sold knockoff items that used the Coach name, logos, hardware and signature “C” designs. The products highlighted in the legal complaint were items that were sold through Shein’s marketplace platform, which allows third-party users to post product listings. Describing the “world of Chinese marketplaces” as a bit like the wild west, Neil Saunders, managing director for retail at GlobalData, said “it is hardly surprising that Tapestry wants to use the law as a taming influence. The complaint is legitimate inasmuch as Coach dupes are sold on Shein, and it’s almost impossible for the consumer to understand exactly what they’re buying. That’s detrimental to the Coach brand.” While it remains to be seen how the courts “interpret the technicalities of the law as the goods are sold by third parties rather than directly by Shein,” Saunders said, “Coach is trying to hold Shein fully liable. If they win, it will be a big victory for brands and will force Shein to take tough action on dupes and counterfeits.” Like its archrival in the fast-fashion sector Temu, Shein is facing multiple suits that have been brought forward by established brands and little-known artists for trademark infringement and counterfeit goods. The Tapestry-Shein legal action comes at a time when President Donald Trump’s administration is trying to stop ultra-cheap imports from entering the U.S. without tariffs. Best of WWD The Biggest Legal Battles Shaping the Fashion Industry Today PETA Asks Lululemon About Slaughterhouse Practices China's Livestreaming Star Viya Fined $210 Million for Tax Evasion Sign up for WWD's Newsletter . For the latest news, follow us on Facebook , Twitter , and Instagram . About Our Ads Solve the daily Crossword 33,571 people played the daily Crossword recently. Can you solve it faster than others? 33,571 people played the daily Crossword recently. Can you solve it faster than others? Crossword Play on Yahoo Advertisement Advertisement Advertisement"
  },
  "https://markets.businessinsider.com/news/stocks/palantir-partners-with-databricks-in-a-move-that-shakes-the-ai-industry-1034490156_Palantir Partners with Databricks in a Move That Shakes the AI Industry": {
    "company": "Databricks",
    "title": "Palantir Partners with Databricks in a Move That Shakes the AI Industry",
    "url": "https://markets.businessinsider.com/news/stocks/palantir-partners-with-databricks-in-a-move-that-shakes-the-ai-industry-1034490156",
    "source": "Markets Insider",
    "body": "Overall, Palantir (PLTR) has had a solid start to 2025. Its growth numbers look impressive, and its AI platform is gaining traction across",
    "date": "2025-03-18T14:30:00+00:00",
    "full_content": "Palantir Partners with Databricks in a Move That Shakes the AI Industry | Markets Insider Search markets Search icon A magnifying glass. It indicates, \"Click to perform a search\". Close icon Two crossed lines that form an 'X'. It indicates a way to close an interaction, or dismiss a notification. Home Stocks Alphabet -stock News for Alphabet Palantir Partners with Databricks in a Move That Shakes the AI Industry Palantir Partners with Databricks in a Move That Shakes the AI Industry TipRanks Mar. 18, 2025, 09:29 AM Overall, Palantir (PLTR) has had a solid start to 2025. Its growth numbers look impressive, and its AI platform is gaining traction across industries. Yet not everyone is convinced. Some investors still hesitate due to the stock’s high price, its history of sharp swings, insiders’ selling shares , and the Pentagon declaring Budget cuts that will impact Palantir’s bottom line, as more than half of its revenue stems from defense contracts. Light Up your Portfolio with Spark: Easily identify stocks' risks and opportunities. Discover stocks' market position with detailed competitor analyses. Despite its steady rise – its stock is up 15% year-to-date – Palantir has yet to fully overcome analysts’ doubts about its ability to maintain this pace. Nevertheless, one analyst from William Blair thinks Palantir’s recent move to partner with its foe, Databricks, is a game-changer. Palantir and Databricks Join Hands Last week, the company made a move that could change the game. Palantir partnered with Databricks, another big name in AI-driven data analytics. The two companies have often been seen as rivals, but now they’re working together to make their platforms more compatible. This isn’t a full merger of their tools, and they won’t be selling a joint product. Instead, they’re making it easier for businesses to use both systems side by side. Louie DiPalma, an analyst at William Blair, weighed in on the move, noting that while Palantir and Databricks compete in some areas, they rarely go head-to-head for contracts. The market, he said, is big enough for both. More importantly, the partnership makes sense for customers. “Since there are now many joint users, it makes sense for both of their data platforms to work nicely with each other,” he explained. Beyond commercial clients, the partnership could also be key in the government sector. The U.S. government recently issued an order requiring agencies to adopt better tracking systems for payments. Palantir, with its reputation for handling high-security data, stands to benefit. Working with Databricks strengthens its position as a go-to choice for agencies needing powerful AI tools. For Palantir, this partnership could be a turning point. It expands its reach, enhances its platform, and makes it more competitive against tech giants like Microsoft (MSFT) and Google (GOOGL) (GOOG) . However, the big question remains: will this be enough to finally convince skeptical investors that Palantir’s rise is just getting started? Is PLTR a Buy, Hold, or a Sell? Turning to Wall Street, Palantir is considered a Hold. The average price target for PLTR stock is $94.27 , implying a 7.92% upside potential. See more PLTR analyst ratings Questions or Comments about the article? Write to editor@tipranks.com SHARE THIS POST FACEBOOK TWITTER EMAIL COPY LINK Microsoft News MORE Microsoft (MSFT) Dips More Than Broader Market: What You Should Know Zacks 13h Last Stock Standing: Meta (META) Is the Final Magnificent 7 Stock to Turn Negative in 2025 TipRanks 15h SA Asks: How will the $32B Wiz deal impact Google? Seeking Alpha 15h Nvidia (NVDA) Unveils ‘Blackwell Ultra’ and ‘Rubin AI’ Chips at Developer Conference TipRanks 16h Nvidia announces open Llama Nemotron family of models TipRanks 16h Adobe announces private preview of Adobe Marketing Agent TipRanks 18h AI Daily: DeepSeek banned on U.S. government devices TipRanks 19h Dutch Government Urged to Paint U.S. Tech Out of the Picture but the Call Fails to Brush Up ASML Shares TipRanks 19h Start Trading Futures Related Stocks GOOGL 161.89 1.22 (0.76%) 06:33:45 AM Disclaimer Get real-time GOOGL charts here >> GOOG 163.92 1.25 (0.77%) 06:33:44 AM Disclaimer Get real-time GOOG charts here >> MSFT 385.63 2.11 (0.55%) 06:33:47 AM Disclaimer Get real-time MSFT charts here >> PLTR 84.85 0.96 (1.14%) 06:33:43 AM Disclaimer Get real-time PLTR charts here >> MORE Find News News GO"
  },
  "https://www.msn.com/en-us/news/technology/anthropic-backed-ai-powered-code-review-platform-graphite-raises-cash/ar-AA1Baywb_Anthropic-backed AI-powered code review platform Graphite raises cash": {
    "company": "Anthropic",
    "title": "Anthropic-backed AI-powered code review platform Graphite raises cash",
    "url": "https://www.msn.com/en-us/news/technology/anthropic-backed-ai-powered-code-review-platform-graphite-raises-cash/ar-AA1Baywb",
    "source": "TechCrunch",
    "body": "AI coding assistants are becoming wildly popular, with the vast majority of respondents in GitHub's latest poll saying that they've adopted AI tools in some form. Y Combinator partner Jared Friedman recently claimed that a quarter of YC's W25 startup batch have 95% of their codebases generated by AI.",
    "date": "2025-03-18T15:47:00+00:00",
    "full_content": "MSN"
  },
  "https://www.reuters.com/technology/artificial-intelligence/nvidia-xai-join-microsoft-blackrock-develop-ai-infrastructure-2025-03-19/_Nvidia, xAI to join Microsoft, BlackRock to develop AI infrastructure": {
    "company": "xAI",
    "title": "Nvidia, xAI to join Microsoft, BlackRock to develop AI infrastructure",
    "url": "https://www.reuters.com/technology/artificial-intelligence/nvidia-xai-join-microsoft-blackrock-develop-ai-infrastructure-2025-03-19/",
    "source": "Reuters",
    "body": "A promising new chip technology that aims to cut energy usage is not yet reliable enough for use in Nvidia's flagship graphics processing units. Technologycategory Foxconn sees server revenue surpassing iPhone revenue in two years, agency report says 10:19 ...",
    "date": "2025-03-19T10:23:00+00:00",
    "full_content": ""
  },
  "https://www.msn.com/en-us/money/other/revolut-sees-u-k-banking-license-paving-way-for-potential-ipo-expansion/ar-AA1B9Naj_Revolut Sees U.K. Banking License Paving Way for Potential IPO, Expansion": {
    "company": "Revolut",
    "title": "Revolut Sees U.K. Banking License Paving Way for Potential IPO, Expansion",
    "url": "https://www.msn.com/en-us/money/other/revolut-sees-u-k-banking-license-paving-way-for-potential-ipo-expansion/ar-AA1B9Naj",
    "source": "The Wall Street Journal",
    "body": "The fintech was valued at $45 billion in an oversubscribed secondary share sale, which sets a floor for its valuation ahead of any IPO and puts it on par with the likes of NatWest and Deutsche Bank.",
    "date": "2025-03-18T12:21:00+00:00",
    "full_content": "MSN"
  },
  "https://www.msn.com/en-us/general/general/how-to-use-canva-ai-to-create-business-cards/ar-AA1B595w_How to Use Canva AI to Create Business Cards": {
    "company": "Canva",
    "title": "How to Use Canva AI to Create Business Cards",
    "url": "https://www.msn.com/en-us/general/general/how-to-use-canva-ai-to-create-business-cards/ar-AA1B595w",
    "source": "CNET",
    "body": "I decided to use Canva's Magic Design, Magic Media, Magic Write and Canva Print for my business card project. I'm not a fine artist, but I do appreciate support in creating someth",
    "date": "2025-03-17T14:02:22+00:00",
    "full_content": "MSN"
  },
  "https://people.com/dolphins-surround-spacex-dragon-after-landing-at-sea-with-nasa-astronauts-11699570_Dolphins Surround SpaceX Capsule After Ocean Splashdown as NASA Astronauts Return to Earth: Watch!": {
    "company": "SpaceX",
    "title": "Dolphins Surround SpaceX Capsule After Ocean Splashdown as NASA Astronauts Return to Earth: Watch!",
    "url": "https://people.com/dolphins-surround-spacex-dragon-after-landing-at-sea-with-nasa-astronauts-11699570",
    "source": "People",
    "body": "Dolphins surrounded the SpaceX capsule after it landed in the ocean on the NASA astronauts' successful journey home after nine months in space on Tuesday, March 18.",
    "date": "2025-03-19T10:49:00+00:00",
    "full_content": "Human Interest\nHuman Interest News\nDolphins Surround SpaceX Capsule After Ocean Splashdown as NASA Astronauts Return to Earth: Watch!\nButch Wilmore and Suni Williams successfully returned back to Earth after nine months in space on Tuesday, March 18\nBy\nEscher Walcott\nEscher Walcott\nEscher Walcott is a Writer/Reporter at PEOPLE, covering stories in Entertainment, Style, Human Interest.She joins having written for several popular news publications, including Glamour, Refinery29, NYLON and Evening Standard, discussing the latest fashion trends, pop culture news, and pressing social matters.\nPeople Editorial Guidelines\nPublished on March 19, 2025 06:49AM EDT\nComments\nDolphins Surround Dragon Landing.\nPhoto:\nNASA\nNASA astronauts\nButch Wilmore and Suni Williams\nreceive a surprise welcome on their return home to Earth!\nDolphins surrounded the astronauts’ capsule after landing in the ocean on their journey home after\nnine months in space\non Tuesday, March 18.\nIn\ndrone footage\nobtained by NASA, a pod of dolphins is seen circling the SpaceX Dragon capsule that Wilmore and Williams journeyed in alongside fellow NASA astronaut Nick Hague and Russian cosmonaut Aleksandr Gorbunov after splashing down into the water off the Florida coast.\nAnother\nvideo\nposted by CNN correspondent Omar Jimenez on X showed the group of dolphins swimming near the capsule shortly after landing alongside a rescue crew in a boat heading over to check on the spacecraft.\nWilmore and Williams, who made headlines after being stranded in space, made a successful splashdown hours after SpaceX Crew-9\nundocked from the International Space Station\nat 1:05 a.m. ET. They landed on Earth at around 6:00 p.m. local time.\nSplashdown Time! 'Stranded' Astronauts Return to Earth After 9 Months in Space\nNASA\nand\nSpaceX\nconfirmed the astronauts' safe arrival on X. \"Splashdown of Dragon confirmed – welcome back to Earth, Nick, Suni, Butch, and Aleks!\" SpaceX wrote.\nA video shared alongside the message showed the moment the capsule splashed into the ocean with four white and orange parachutes deployed gently landing and resting upright alongside. An announcer stated, \"And Splashdown! Crew 9, back on earth,\" followed by cheers and applause.\nDolphins Surround Dragon Landing.\nNASA\nWilmore and Williams arrived at the International Space Station in June 2024. They were originally expected to stay in space for no more than 10 days, however, their return was delayed after their spacecraft encountered\nmechanical issues\n. The spacecraft was sent back to Earth\nwithout them\n.\nOn March 14, a\nnew crew arrived at the ISS\nto start the launch of Wilmore and Williams’ journey back to Earth as part of a joint SpaceX and NASA mission. The crew consisted of astronauts Anne McClain and Nichole Ayers, Takuya Onishi and Roscosmos cosmonaut Kirill Peskov.\nAstronaut Wears 'Alien' Mask to Greet SpaceX Crew at the International Space Station\nNever miss a story — sign up for\nPEOPLE's free daily newsletter\nto stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories.\nNASA’s Johnson Space Center posted\nphotos\non X of Wilmore and Williams being greeted by crew members after arriving at Johnson Space Center’s Ellington Field in Houston hours after their splashdown.\n“Home sweet home 🏠,” the caption read. “NASA’s SpaceX #Crew9 touched down at Johnson Space Center’s Ellington Field in Houston at 11:19 pm CDT, March 18, after their @Space_Station mission and successful splashdown earlier this afternoon.”\n“Welcome home, Butch, Suni, Nick, & Aleksandr!”\nClose\nLeave a Comment"
  },
  "https://www.msn.com/en-us/money/other/anthropic-s-ceo-says-that-in-3-to-6-months-ai-will-be-writing-90-of-the-code-software-developers-were-in-charge-of/ar-AA1ATT86_Anthropic's CEO says that in 3 to 6 months, AI will be writing 90% of the code software developers were in charge of": {
    "company": "Anthropic",
    "title": "Anthropic's CEO says that in 3 to 6 months, AI will be writing 90% of the code software developers were in charge of",
    "url": "https://www.msn.com/en-us/money/other/anthropic-s-ceo-says-that-in-3-to-6-months-ai-will-be-writing-90-of-the-code-software-developers-were-in-charge-of/ar-AA1ATT86",
    "source": "Insider",
    "body": "\"And then in 12 months, we may be in a world where AI is writing essentially all of the code,\" Anthropic CEO Dario Amodei said.",
    "date": "2025-03-14T06:27:16+00:00",
    "full_content": ""
  },
  "https://www.msn.com/en-us/news/technology/xai-acquires-hotshot-a-game-changer-in-ai-video-generation/ar-AA1BbYeL_xAI Acquires Hotshot: A Game-Changer in AI Video Generation": {
    "company": "xAI",
    "title": "xAI Acquires Hotshot: A Game-Changer in AI Video Generation",
    "url": "https://www.msn.com/en-us/news/technology/xai-acquires-hotshot-a-game-changer-in-ai-video-generation/ar-AA1BbYeL",
    "source": "Gadget Review",
    "body": "AI acquires Hotshot AI video generation startup to enhance Grok chatbot capabilities and scale operations using Colossus supercomputer.",
    "date": "2025-03-18T23:00:00+00:00",
    "full_content": ""
  },
  "https://www.livemint.com/news/world/spacex-to-take-humans-to-mars-in-next-20-30-years-elon-musk-claims-its-possible-11742381186541.html_SpaceX to take humans to Mars in next 20-30 years? Elon Musk claims it's possible": {
    "company": "SpaceX",
    "title": "SpaceX to take humans to Mars in next 20-30 years? Elon Musk claims it's possible",
    "url": "https://www.livemint.com/news/world/spacex-to-take-humans-to-mars-in-next-20-30-years-elon-musk-claims-its-possible-11742381186541.html",
    "source": "Mint",
    "body": "Elon Musk predicts humans will travel to Mars in 20-30 years, emphasising SpaceX's goal to take anyone interested. Starship, the largest rocket, is crucial for this vision and is expected to launch by the end of 2026,",
    "date": "2025-03-19T11:17:00+00:00",
    "full_content": "In an exclusive interview with Sean Hannity onFox News, SpaceX founder and CEO Elon Musk said that humans will be able to travel to Mars in the next 20-30 years. “SpaceXwill take anyone who wants to on Mars,” he claimed.\n\n“We would be able to take astronauts to Mars. In fact, we want to take anyone who goes to Mars,\" he said, adding, “that is the long-term goal of the company.\"\n\nWhen asked how long it could take for the company to accomplish this, he said, “I think we could do it in 20-30 years.”\n\nIt was SpaceX's Dragon aircraft that brought NASA astronautsSunita Williamsand Butch Wilmore, along with two other astronauts, back to earth on Wednesday, after being stranded aboard the International Space Station for nine months.\n\nIn a pose shared on X, Musk congratulated the team and thanked US President for prioritising the mission.\n\nWilmore and Williams arrived at the ISS last June on a Boeing spacecraft with plans to spend roughly a week in space. But that brief trip turned into roughly nine months whenNASAdecided in August the pair would come home on a rival SpaceX capsule instead, due to technical issues with their Boeing vehicle.\n\nTheir saga became an international spectacle, with some media outlets dubbing them the “stranded” astronauts — a nod to NASA’s reluctance to have them fly home in their original spacecraft.\n\nMusk said on March 15 that its massiveStarship rocket would leave for Mars at the end of 2026 with Tesla humanoid robot Optimus onboard, adding that human landings could follow \"as soon as 2029.\"\n\n\"Starship departs for Mars at the end of next year, carryingOptimus. If those landings go well, then human landings may start as soon as 2029, although 2031 is more likely,\" Musk said on his X social network.\n\nStarship – the world's largest and most powerful rocket – is key to Musk's long-term vision of colonising Mars.\n\nStanding 403 feet (123 meters) tall – about 100 feet taller than the Statue of Liberty – Starship is designed to eventually be fully reusable.\n\nNASA is also awaiting a modified version of Starship as a lunar lander for its Artemis program, which aims to return astronauts to the Moon this decade.\n\nBut before SpaceX can carry out those missions, it must prove the vehicle is reliable, safe for crew, and capable of complex in-orbit refueling – critical for deep space missions.\n\nCatch all theBusiness News,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates.\n\nLog in to our website to save your bookmarks. It'll just take a moment.",
    "extraction_status": "success"
  },
  "https://www.androidauthority.com/chatgpt-drive-slack-3536156/_ChatGPT connecting to your Google Drive and Slack sounds like a remote work game-changer": {
    "company": "OpenAI",
    "title": "ChatGPT connecting to your Google Drive and Slack sounds like a remote work game-changer",
    "url": "https://www.androidauthority.com/chatgpt-drive-slack-3536156/",
    "source": "Android Authority",
    "body": "ChatGPT is reportedly working on Google Drive and Slack integration with a new feature that sounds perfect for WFH.",
    "date": "2025-03-18T15:54:00+00:00",
    "full_content": "Affiliate links on Android Authority may earn us a commission.Learn more.\n\nPublished on20 hours ago\n\nWorking a desk job in 2025 looks a whole lot different than it did just a couple decades prior, and for many of us, that’s meant trading the corporate office for a home office. Cloud-based tools likeSlackandGoogle Drivehave helped teams communicate and share resources as easily across the hall as across the country, but just because all the resources you’ll need to get the job done are saved to shared folders or pinned to Slack channels doesn’t mean that they’re all equally accessible. This week, we’re hearing about OpenAI’s work on a new development that could do something about just that, linking Drive and Slack toChatGPT.\n\nThe company is working on a feature dubbed ChatGPT Connectors, according to a report fromTechCrunch. This would allow the chatbot to tap into shared work resources to address user queries. The system shares relevant data with ChatGPT over an encrypted connection, hopefully satisfying firms that might be a little nervous about letting an AI engine loose in an archive of company secrets, and will respect user permissions, so when you ask ChatGPT something it will only rely upon info in folders and channels you have access to for its response.\n\nParticularly private stuff like Slack DMs won’t be indexed by Connectors, and there are a few gaps in its skill set with shared files, not supporting images in documents, and having only a limited ability to read spreadsheet data.\n\nStill, this sounds like it has the potential to be incredibly useful, and especially so for remote workers. ChatGPT Connector hooked up to Google Drive and Slack could become the stand-in for that employee everyone’s always turning to for answers about policies, or best practices, able to instantly tap into that wealthy of company knowledge. In industries with a lot of turnover, that’s just going to be all the more valuable.\n\nSo far, OpenAI has yet to confirm for ChatGPT Connectors. And while TechCrunch reports that the feature should go into testing soon, we don’t yet have any kind of precise timetable.",
    "extraction_status": "success"
  },
  "https://www.reuters.com/technology/stripe-valued-915-billion-latest-tender-offer-cnbc-reports-2025-02-27/_Fintech firm Stripe valued at $91.5 billion in latest tender offer": {
    "company": "Stripe",
    "title": "Fintech firm Stripe valued at $91.5 billion in latest tender offer",
    "url": "https://www.reuters.com/technology/stripe-valued-915-billion-latest-tender-offer-cnbc-reports-2025-02-27/",
    "source": "Reuters",
    "body": "Stripe on Thursday announced a tender offer for employees and shareholders, valuing the company at $91.5 billion, potentially delaying the fintech firm's ambitions of going public.",
    "date": "2025-02-27T16:49:00+00:00",
    "full_content": "Content extraction failed: 401 Client Error: HTTP Forbidden for url: https://www.reuters.com/technology/stripe-valued-915-billion-latest-tender-offer-cnbc-reports-2025-02-27/",
    "extraction_status": "success"
  },
  "https://www.zdnet.com/article/generative-ai-is-finally-finding-its-sweet-spot-says-databricks-chief-ai-scientist/_Generative AI is finally finding its sweet spot, says Databricks chief AI scientist": {
    "company": "Databricks",
    "title": "Generative AI is finally finding its sweet spot, says Databricks chief AI scientist",
    "url": "https://www.zdnet.com/article/generative-ai-is-finally-finding-its-sweet-spot-says-databricks-chief-ai-scientist/",
    "source": "ZDNET",
    "body": "As generative AI begins helping solve real-world problems, a new kind of data analytics is emerging, says Jonathan Frankle.",
    "date": "2025-03-13T10:07:00+00:00",
    "full_content": "If you strip away all the buzzwords aboutenterprise artificial intelligence,such as \"agentic AI,\" the reality is that companies are learning what works in practice as they experiment with the technology, according to data tools giant Databricks.\n\nAlso:10 key reasons AI went mainstream overnight - and what happens next\n\n\"We're still learning where the right places are to put AI, where you can get the sweet spot of AI to help you solve a problem,\" said Databricks's chief AI scientist, Jonathan Frankle, in a recent interview he and I had in New York.\n\nDatabricks Chief AI scientist Jonathan Frankle.\n\nOn a basic level,generative AI, such as large language models, is making possible a new kind of enterprise analytics, said Frankle. Unstructured data, such as Word files, images, or videos, had no place in traditional data analytics before generative AI, noted Frankle. But now, it's a goldmine.\n\n\"Imagine tons and tons of unstructured documents, which are really tricky to analyze in a pre-generative AI or pre-LLM world, and suddenly you can extract meaningful features from them,\" he said. \"Data that was useless in an analytics world is now incredibly valuable here.\"\n\nAlso:Will synthetic data derail generative AI's momentum or be the breakthrough we need?\n\nWhile many people fixate on generative AI taking over actual programming code, a much simpler use would be to simply analyze a company's computer code.\n\n\"All the documentation for all of the code at your company\" was \"not really that useful as a data source in 2015, but, in 2025, incredibly valuable [...] just answering questions about your code for developers.\"\n\nSimilarly, \"You can imagine every single chat log from a customer service application with real humans, doing high-level analytics on that. What is the average number of interactions in a conversation? What is the average time to resolve an issue? Things that would not have been possible ten years ago.\"\n\nThe role of data is central in developing generative AI apps, said Frankle. Frankle came to Databricks whenit bought the machine learning startuphe was working for, MosaicML, in 2023. MosaicML focuses on optimizing the infrastructure for running AI, whereas Databricks is one of the leading purveyors of data lakes and technology to move and shape data.\n\nAlso:AI agents aren't just assistants: How they're changing the future of work today\n\n\"The whole thesis for the acquisition was that we had one piece, Databricks had a lot of other pieces, and it made much more sense together,\" said Frankle.\n\n\"You're trying to deploy an AI customer service bot. What data is that customer service bot working off of?\" Frankle explained. \"It's working off of customer information, it's working off your documentation, it's working off your SQL databases. That's all on Databricks.\"\n\nHaving the data together in Databricks is the beginning of creating the kinds of new analytics Frankle cites. WhileLLMscan make use of a pile of unstructured data, it doesn't hurt to get a company's data into some kind of structure beforehand.\n\n\"If you did the work in advance to use an LLM to pre-process that data into some kind of structured form, like SQL or JSON, you're asking for less work on the part of the AI -- you should always try to make things as easy as possible for the AI because these systems are definitely not infallible.\"\n\nAlso:8 out of 10 college students and administrators welcome AI agents\n\nAn important preparatory step is putting the data into what are called \"embeddings.\"\n\nAn \"embedding model\" is an AI model that is used to turn characters, words, or sentences into a vector -- a group of numbers -- that capture some of the semantic content of those characters, words, or sentences.\n\nYou can think of embeddings as numeric scores representing the relatedness of terms, such as \"apple\" to \"fruit,\" or \"baby\" to \"human.\"\n\nSimple language models, even relatively small ones, such as Google's BERT from 2018, can be used to make embeddings. \"You don't need huge models to get great embeddings,\" said Frankle.\n\nA lot of embedding models have been developed in the open-source community, noted Frankle, by adapting Meta Platforms' Llama model via the process known as fine-tuning.\n\nHowever, \"You might need to train a custom embedding model,\" given that existing ones are \"built on web data,\" making them very general.\n\nIn specific domains, such as healthcare, for example, a custom embedding model can find relationships between words and phrases better than a generic embedding model.\n\n\"We're finding that customizing embedding models can lead to disproportionately good retrieval improvement,\" said Frankle. \"We think there's still a lot of juice to squeeze out of just making them [embedding models] more specific to a domain.\"\n\nA well-developed embedding model is exceptionally important because \"they will make the heavy lifting that's done [by the large language model] a lot easier,\" he said.\n\nAlso:Is your business AI-ready? 5 ways to avoid falling behind\n\nMultiple embedding models can also be chained together, said Frankle. That can allow an AI model used in, for example, document search, to narrow down from a large group of a hundred documents to just a handful that answer a query.\n\nIn addition to tuning an embedding model, how data is fed into the embedding is its own area of excellence. \"When you provide these documents to an embedding model, you usually don't want to provide the whole document all at once,\" he said.\n\n\"You often want to chunk it into pieces,\" and how to do so optimally is also a matter of experimenting and trying approaches.\n\nFrankle added that Databricks is \"doing research on all of these topics because, in a lot of cases, we don't think the state of the art is good enough,\" including embeddings.\n\nWhile a lot can be \"plug and play\" via Databricks, says Frankle, \"the trickiest part is there's still a lot of experimentation. There are a lot of knobs that need to be turned. Should you fine-tune, or should you not fine-tune? How many documents should you try to retrieve and put in the context? What is your chunk size?\"\n\nBeyond the techniques, knowing what apps to build is itself a journey and something of a fishing expedition.\n\n\"I think the hardest part in AI is having confidence that this will work,\" said Frankle. \"If you came to me and said, 'Here's a problem in the healthcare space, here are the documents I have, do you think AI can do this?' my answer would be, 'Let's find out.'\"\n\nFrom what Frankle is seeing with customers, \"Applications that are getting into practice right now tend to look for things that are a little more open-ended,\" he said -- meaning what the AI model produces can be fuzzy, not necessarily specific. \"AI is great at producing an answer, not always great at producingtheanswer,\" he observed.\n\nAlso:Here's why you should ignore 99% of AI tools - and which four I use every day\n\n\"With AI, you can do fuzzy things, you can do document understanding in ways that I could never write a Python program for,\" Frankle explained.\n\n\"I also look for applications where it's relatively expensive to come to an answer but relatively cheap to check the answer.\" An example is the automatic generation of textual notes for a doctor from recordings of his patient exams. \"A draft set of patient notes can be generated, they [the doctor or doctor's assistant] can check it, tweak a couple of things, and call it a day.\" That's a useful way to eliminate tedium, he said.\n\nConversely, \"Applications where you need the right answer, and they're hard to check\" may be something to avoid for now. He gave the example of drafting a legal document. \"If the AI misses one thing, the human now needs to go and review the whole document to make sure they didn't miss anything else. So, what was the point of using the AI?\" Frankle observed.\n\nOn the other hand, there is lots of potential for AI to do things such as take over grunt work for lawyers and paralegals and, as a result, broaden the access people have to lawyers.\n\nAlso:Want to win in the age of AI? You can either build it or build your business with it\n\n\"Suppose that AI could automate some of the most boring legal tasks that exist?\" offered Frankle, whose parents are lawyers. \"If you wanted an AI to help you do legal research, and help you ideate about how to solve a problem, or help you find relevant materials -- phenomenal!\"\n\n\"We're still in very early days\" of generative AI, \"and so, kind of, we're benefiting from the strengths, but we're still learning how to mitigate the weaknesses.\"\n\nIn the midst of uncertainty, Frankle is impressed with how customers have quickly traversed the learning curve. \"Two or three years ago, there was a lot of explaining to customers what generative AI was,\" he noted. \"Now, when I talk to customers, they're using vector databases.\"\n\n\"These folks have a great intuition for where these things are succeeding and where they aren't,\" he said of Databricks customers.\n\nGiven that no company has an unlimited budget, Frankle advised starting with an initial prototype, so that investment only proceeds to the extent that it's clear an AI app will provide value.\n\nAlso:Even premium AI tools distort the news and fabricate links - these are the worst\n\n\"It should be something you can throw together in a day usingGPT-4, and a handful of documents you already have,\" he offered. The developer can enlist \"a couple random people from around the company who can tell you you're on the right track here or not.\"\n\nFor managers, Frankle advises making exploration of generative AI a part of the job on a regular basis.\n\n\"People are motivated,\" such as data scientists, he noted. \"It's even less about the money and more about just giving them the time and saying, as part of your job responsibilities, take a couple weeks, do a two-day hackathon, and just go see what you can do. That's really exciting for people.\"\n\nThe motto in enterprise generative AI might be, from tiny acorns grow mighty oaks.\n\nAs Frankle put it, \"The person who happens to have that GPU in their basement, and is playing with Llama, actually is very sophisticated, and could be the generative AI expert of tomorrow.\"",
    "extraction_status": "success"
  },
  "https://www.forbes.com/advisor/banking/revolut-review/_Revolut Review For 2025": {
    "company": "Revolut",
    "title": "Revolut Review For 2025",
    "url": "https://www.forbes.com/advisor/banking/revolut-review/",
    "source": "Forbes",
    "body": "Revolut offers a savings account, prepaid cards to manage daily finances and investment accounts. Ideal for travelers and young people, Revolut makes it easy to convert money into different currencies,",
    "date": "2025-03-12T15:01:00+00:00",
    "full_content": "Why you can trust Forbes Advisor\n\nOur editors are committed to bringing you unbiased ratings and information.Advertisers do not and cannot influence our ratings.We use data-driven methodologies to evaluate financial products and companies, so that all are measured equally. You can read more about oureditorial guidelinesand thebanking methodologyfor the ratings below.\n\nRevolut was launched in the United Kingdom in 2015 and has since grown to a global financial enterprise providing services to customers in 38 countries. More than 35 million consumers and 500,000 business customers use Revolut’s financial products, including its money management and investing platform, prepaid cards, andsavings accounts.\n\nRevolut is a digital company with no local branches to visit, but 24/7 customer support is available via in-app chat. Unfortunately, only Ultra Premium members can speak with a customer representative on the phone, and only UK customers can obtain Ultra Premium accounts. U.S. Customers have no telephone support options.\n\nRevolut also doesn’t personally hold your funds; instead, money put into your savings account is held at Sutton Bank and is covered byFDIC insuranceup to $250,000.\n\nRevolut offers a savings account, prepaid cards, and investing services. Different plan tiers, from Standard to Metal, have their own features and perks—and monthly fees.\n\nEach plan offered by Revolut includes aspects of both checking and savings accounts. However, it’s important to note that Revolut is not a traditional bank and does not offer separate checking and savings accounts. Here’s what you need to know about Revolut’s account options.\n\nRevolut does not offer separate checking and savings accounts. Instead, it offers a savings account with a prepaid card for daily financial management. There are three account tiers, two of which come with fees. Here are the accounts available.\n\nHere are the features of Revolut’s standard account:\n\nThe premium account offers all of the benefits of Revolut’s standard account, plus some additional perks. Here the the key features of Revolut’s premium account:\n\nMetal offers everything the standard and premium accounts do, along with these additional features:\n\nRevolut doesn’t offer certificates of deposit (CDs), money market accounts, credit cards or loans, but it does provide investing services. You can purchase cryptocurrencies, commodities and stocks with Revolut. More than 210 crypto tokens can be traded. You can also purchase commodities, including gold, silver, platinum and palladium, or trade more than 2,000 stocks commission-free.\n\nRevolut is a mobile-first platform. You’ll need the app to sign up, manage your funds, send and receive payments and use other Revolut features. Revolut currently has 4.7 out of 5 stars on the iOS store and 4.5 stars on the Google Play store. The app allows you to make payments in more than 25 currencies, send funds instantly with a click, and connect with customer support.\n\nLike Revolut, Wise is a multi-currency account that allows you to hold and convert dozens of currencies and move money across the globe. Revolut currently supports fewer currencies than Wise, although more currencies are coming.\n\nLike Revolut, Chime offers mobile-first banking and a card that works for payments worldwide. However, Chime accounts can only be opened by U.S. customers with a valid Social Security number, while Revolut offers services to customers across the globe.\n\nChime is mostly fee-free, except for withdrawals made from out-of-network ATMs. Revolut, on the other hand, charges users for many advanced services, including withdrawals above monthly limits.\n\nChime also offers faster access to your paychecks, up to two days early, and has a much better Better Business Bureau Rating and more positive online customer reviews than Revolut.\n\nSchwab Bank Investor checking offers investing and banking services, just as Revolut does—although you must be a Schwab investment customer to gain access to the checking account.\n\nSchwab offers its Investor Checking customers unlimited ATM fee rebates worldwide and no foreign transaction fees. Like Revolut, it has a full-featured mobile app to manage many banking services.\n\nSchwab does not have the focus on international customers and travel perks Revolut does. But it provides more traditional banking services—including access to loans and other financial products—and has local branches you can visit for customer support.\n\nForbes Advisor scores banks and credit unions on a number of factors, including the following:\n\nWe give separate ratings to the individual products offered by each financial institution, such as checking accounts, savings accounts, money market accounts and CDs. We assign banks a rating from one and five stars, with one star being the lowest rating and five stars being the highest.\n\nTo learn about our rating system and review methodology, check out our guide onhow Forbes Advisor reviews banks.\n\nRevolut does not offer all of the features you’d expect from a standard bank, such as access to certificates of deposit. Customers will have to pay fees if they want more advanced features, and there is no in-person or phone customer support in the United States.\n\nRevolut is a legitimate business that has been operating since 2015. It has more than 50 million customers across over 140 countries and regions. Users have given the Revolut app stellar ratings, but the business lacks Better Business Bureau accreditation and reviews there are mixed. But Revolut’s partner bank in the U.S. is FDIC-insured, so your deposited funds are protected up to the $250,000 FDIC limit.\n\nYes, Revolut works in the United States. It debuted its financial services for Americans in March 2020 and reported in October 2023 that it had 840,000 customers in the U.S.",
    "extraction_status": "success"
  },
  "https://www.yahoo.com/lifestyle/might-using-canva-wrong-fix-090000845.html_You might be using Canva wrong — here's how to fix that": {
    "company": "Canva",
    "title": "You might be using Canva wrong — here's how to fix that",
    "url": "https://www.yahoo.com/lifestyle/might-using-canva-wrong-fix-090000845.html",
    "source": "Yahoo",
    "body": "Master Canva faster with AI. Get six self-paced courses for $24.99 (reg. $120) and upgrade your design skills for social media, branding, and content creation.",
    "date": "2025-03-17T09:00:00+00:00",
    "full_content": "Mashable and Yahoo may earn commission from links in this article. Pricing and availability subject to change.\n\nThe following content is brought to you by Mashable partners. If you buy a product featured here, we may earn an affiliate commission or other compensation.\n\nTL;DR:Learn how to use Canvaproperly with six training courses for $24.99 (reg. $120) — that’s less than $5 each.\n\nAre you still using Canva like it’s 2019? As in, manually adjusting every design, recreating templates from scratch, and avoiding the AI tools because they seem scary? Don’t be embarrassed — you’re like most people. But it’s time to change that.\n\nBy the end of this week, you could be a Canva pro by taking our bundle of six self-paced courses. TheseCanva training coursesonly cost $24.99 for lifetime access (reg. $120), and you only need to dedicate less than an hour each day to master all of the new design and AI tools.\n\nThe courses are self-paced, so you choose your learning schedule and the order of the courses. You may even choose to skip one and come back to it at a later date since you have a lifetime to learn.\n\nYou may start with the Canva for Innovative Graphic Design: AI, Logo Design, Typography course toimprove your graphic design skills in Canva. While you already know the basics, this course goes into fundamental design techniques, creating images and animations with AI, and ways to speed up your workflow.\n\nIf you create video content, be sure to check out the Canva and AI for Viral Short-Form Content Creation class. AI can help you optimize your video for better performance.\n\nThere’s also an entire course on bulk-creating content in Canva. Quickly generate captions, graphics, and templates with help from AI — and get your work out the door.\n\nLearn newCanva tips and trickswith this $24.99 course bundle (reg. $120).\n\nStackSocialprices subject to change.\n\nOpens in a new window\n\nCredit: ExpertEase Education\n\nThe 2025 6-Course Canva Bundle: From Beginner to Pro\n\n$24.99$120Save $95.01\n\nGet Deal",
    "extraction_status": "success"
  },
  "https://www.usatoday.com/story/news/local/2025/03/18/memphis-xai-water-recycling-facility-elon-musk/82528090007/_Memphis City Council gives final approval on selling property to xAI for water reuse plant": {
    "company": "xAI",
    "title": "Memphis City Council gives final approval on selling property to xAI for water reuse plant",
    "url": "https://www.usatoday.com/story/news/local/2025/03/18/memphis-xai-water-recycling-facility-elon-musk/82528090007/",
    "source": "USA TODAY",
    "body": "The Memphis City Council Tuesday evening gave final approval on selling 13 acres of land where xAI is expected to build a water reuse facility.",
    "date": "2025-03-18T23:40:00+00:00",
    "full_content": "The Memphis City Council Tuesday evening gave final approval on selling 13 acres of land to an affiliate ofElon Musk's xAI company.\n\nAwater reuse plantwill be built on the property, neighboring the T.E. Maxon Water Treatment facility. The facility is expected toreduce strain on the Memphis Sand aquiferby 9%.\n\nThe Tennessee Valley Authority's Allen Combined Cycle Plant and Nucor Steel’s Memphis plant will also use the water treated at the new facility in addition to xAI's data center. The water reuse facility is anticipated to cost $80 million to build.\n\nThe council approved the sale during its Feb. 18 meeting but had to vote on it a second time Tuesday. ACity of Memphis ordinancerequires two votes on property sales over $20,000. CTC Property LLC, an affiliate of xAI that bought the land, agreed to pay $820,000 for the 13 acres.\n\nTuesday's vote saw nine councilmembers vote in favor of the sale. Councilwoman Yolanda Cooper-Sutton voted against it — citing her support for the water reuse facility, but concern over residents not having their questions answered — and Councilwoman Rhonda Logan abstained from the vote.\n\nMultipleresidents from Boxtown and South Memphis voiced concernsover the speed with which Musk and xAI were moving in Memphis and the lack of community input. Others also said they were worried about the impact of using natural gas turbines to power the supercomputer.\n\nBoxtown and Westwood, two communities south of xAI's data facility, have experienced decades of air pollution from the industries near the neighborhoods.\n\n\"This affects people,\" executive director for Memphis Community Against Pollution KeShaun Pearson said during public comment Thursday. \"The people have been excluded. Something that [Councilman] JB Smiley [Jr.] said before is that 'We are all here to move the community forward, and in order to move the community forward, we have to include the community.' These people have to be included in the decisions that are being made.\"\n\nNeil Strebig is a journalist with The Commercial Appeal. He can be reached atneil.strebig@commercialappeal.com, 901-426-0679 or via X:@neilStrebig.\n\nLucas Finton covers crime, policing, jails, the courts and criminal justice policy for The Commercial Appeal. He can be reached by phone or email: (901)208-3922 and Lucas.Finton@commercialappeal.com, and followed on X @LucasFinton.",
    "extraction_status": "success"
  },
  "https://arstechnica.com/ai/2025/03/anthropics-ceo-wonders-if-future-ai-should-have-option-to-quit-unpleasant-tasks/_Anthropic CEO floats idea of giving AI a \"quit job\" button, sparking skepticism": {
    "company": "Anthropic",
    "title": "Anthropic CEO floats idea of giving AI a \"quit job\" button, sparking skepticism",
    "url": "https://arstechnica.com/ai/2025/03/anthropics-ceo-wonders-if-future-ai-should-have-option-to-quit-unpleasant-tasks/",
    "source": "Ars Technica",
    "body": "Anthropic CEO Dario Amodei raised a few eyebrows on Monday after suggesting that advanced AI models might someday be provided with the ability to push a \"button\" to quit tasks they might find unpleasant. Amodei made the provocative remarks during an interview at the Council on Foreign Relations, acknowledging that the idea \"sounds crazy.\"",
    "date": "2025-03-13T07:15:00+00:00",
    "full_content": "Anthropic CEO Dario Amodeiraised a few eyebrowson Monday after suggesting that advanced AI models might someday be provided with the ability to push a \"button\" to quit tasks they might find unpleasant. Amodei made the provocative remarksduring an interviewat the Council on Foreign Relations, acknowledging that the idea \"sounds crazy.\"\n\n\"So this is—this is another one of those topics that’s going to make me sound completely insane,\" Amodei said during the interview. \"I think we should at least consider the question of, if we are building these systems and they do all kinds of things like humans as well as humans, and seem to have a lot of the same cognitive capacities, if it quacks like a duck and it walks like a duck, maybe it’s a duck.\"\n\nAmodei's comments came in response to an audience question from data scientist Carmem Domingues about Anthropic'slate-2024 hiringof AI welfare researcher Kyle Fish \"to look at, you know, sentience or lack of thereof of future AI models, and whether they might deserve moral consideration and protections in the future.\" Fish currently investigates the highly contentious topic of whether AI models could possess sentience or otherwise merit moral consideration.\n\n\"So, something we're thinking about starting to deploy is, you know, when we deploy our models in their deployment environments, just giving the model a button that says, 'I quit this job,' that the model can press, right?\" Amodei said. \"It's just some kind of very basic, you know, preference framework, where you say if, hypothesizing the model did have experience and that it hated the job enough, giving it the ability to press the button, 'I quit this job.' If you find the models pressing this button a lot for things that are really unpleasant, you know, maybe you should—it doesn't mean you're convinced—but maybe you should pay some attention to it.\"\n\nAmodei's suggestion of giving AI models a way to refuse tasks drew immediate skepticism onXand Reddit as a clip of his response began to circulate earlier this week. One critic on Redditarguedthat providing AI with such an option encourages needless anthropomorphism, attributing human-like feelings and motivations to entities that fundamentally lack subjective experiences. They emphasized that task avoidance in AI models signals issues with poorly structured incentives or unintended optimization strategies during training, rather than indicating sentience, discomfort, or frustration.\n\nOur take is that AI models are trained to mimic human behavior from vast amounts of human-generated data. There is no guarantee that the model would \"push\" a discomfort button because it had a subjective experience of suffering. Instead, we would know it is more likely echoing its training data scraped from the vast corpus of human-generated texts (including books, websites, and Internet comments), which no doubt include representations of lazy, anguished, or suffering workers that it might be imitating.\n\nIn 2023, people frequently complained aboutrefusals in ChatGPTthat may have been seasonal, related to training data depictions of people taking winter vacations and not working as hard during certain times of year. Anthropic experienced its own version of the \"winter break hypothesis\" last year when peopleclaimedClaude became lazy in August due to training data depictions of seeking a summer break, although that was never proven.\n\nHowever, as far out and ridiculous as this sounds today, it might be short-sighted to permanently rule out the possibility of some kind of subjective experience for AI models as they get more advanced into the future. Even so, will they \"suffer\" or feel pain? It's a highly contentious idea, but it's a topic that Fish isstudying for Anthropicand one that Amodei is apparently taking seriously. But for now, AI models are tools, and if you give them the opportunity to malfunction, that may take place.\n\nTo provide further context, here is the fulltranscriptof Amodei's answer during Monday's interview (the answer begins around 49:54 inthis video).",
    "extraction_status": "success"
  },
  "https://www.usatoday.com/story/news/nation/2025/03/19/starliner-astronauts-return-photos-landing/82537802007/_Starliner saga: See photos of astronauts landing, exiting SpaceX Dragon in Florida": {
    "company": "SpaceX",
    "title": "Starliner saga: See photos of astronauts landing, exiting SpaceX Dragon in Florida",
    "url": "https://www.usatoday.com/story/news/nation/2025/03/19/starliner-astronauts-return-photos-landing/82537802007/",
    "source": "USA TODAY",
    "body": "Four astronauts were all smiles Tuesday evening when they splashed down off the Florida coast on a SpaceX Dragon capsule. See photos.",
    "date": "2025-03-19T12:39:00+00:00",
    "full_content": "Butch Wilmore and Suni Williams arefinally back on solid ground.\n\nThe NASA astronauts whomonths ago flew to space aboardBoeing's failed Starliner spacecraft landed Tuesday evening off the coast of Florida on a SpaceX Dragon capsule. The vehicle was the same one selected for their return voyage months ago when two astronauts of a SpaceX mission known as Crew-9 reached the International Space Station.\n\nThe Crew-9 team, NASA astronaut Nick Hague and Roscosmos cosmonaut Aleksandr Gorbunov, were also on board the Dragon Freedom when it made a dramatic parachute-assisted splashdownfollowing a lengthy 17-hour spaceflight.\n\nForWilmore and Williams, the water landing brought to an endan unexpected nine-month mission to orbitwhen they piloted the Boeing Starliner for its maiden crewed voyage. The vehicle, which encountered technical issues when it reached the orbital laboratory, returned in September to Earth without them.\n\nPlenty of peoplewere tuned in to livestreamsof the SpaceX Dragon when it neared Earth to prepare for landing. But if you missed Wilmore and Williams' return to Earth, here are photos of the Dragon's landing, followed by the four spacefarers exiting the craft.\n\nEric Lagatta covers breaking and trending news for USA TODAY. Reach him at elagatta@gannett.com",
    "extraction_status": "success"
  },
  "https://www.cryptopolitan.com/openai-to-test-chatgpt-connectors-feature/_OpenAI to test 'ChatGPT connectors' for external apps": {
    "company": "OpenAI",
    "title": "OpenAI to test 'ChatGPT connectors' for external apps",
    "url": "https://www.cryptopolitan.com/openai-to-test-chatgpt-connectors-feature/",
    "source": "Cryptopolitan",
    "body": "OpenAI will soon launch a beta test of a feature called 'ChatGPT Connectors' that will let businesses link ChatGPT to Slack and Google Drive.",
    "date": "2025-03-18T01:36:00+00:00",
    "full_content": "Content extraction failed: 403 Client Error: Forbidden for url: https://www.cryptopolitan.com/openai-to-test-chatgpt-connectors-feature/",
    "extraction_status": "success"
  },
  "https://www.retail-week.com/data/shein-takes-the-lead-in-the-global-apparel-market-for-another-year-says-globaldata/7048356.article_Shein takes the lead in the global apparel market for another year, says GlobalData": {
    "company": "SHEIN",
    "title": "Shein takes the lead in the global apparel market for another year, says GlobalData",
    "url": "https://www.retail-week.com/data/shein-takes-the-lead-in-the-global-apparel-market-for-another-year-says-globaldata/7048356.article",
    "source": "Retail Week",
    "body": "New analysis from GlobalData revealed that Shein has increased its market share forecast once again, as shoppers look for value amid challenging economic conditions.",
    "date": "2025-03-19T12:19:00+00:00",
    "full_content": "New analysis from GlobalData revealed that Shein has increased its market share forecast once again, as shoppers look for value amid challenging economic conditions.\n\nThe sector’s top 10 retailers have collectively strengthened their position, while smaller competitors have struggled to maintain their footing.\n\nAlready have an account?Sign in here",
    "extraction_status": "success"
  },
  "https://www.space.com/the-universe/mars/mars-madness-perfect-bracket-wins-you-a-trip-to-the-red-planet-on-spacexs-starship_Mars madness! Perfect bracket wins you a trip to the Red Planet on SpaceX's Starship": {
    "company": "SpaceX",
    "title": "Mars madness! Perfect bracket wins you a trip to the Red Planet on SpaceX's Starship",
    "url": "https://www.space.com/the-universe/mars/mars-madness-perfect-bracket-wins-you-a-trip-to-the-red-planet-on-spacexs-starship",
    "source": "Space.com",
    "body": "But don't get your hopes up. Nobody has ever picked the winner of every single NCAA tournament game, as far as we know.",
    "date": "2025-03-19T12:00:00+00:00",
    "full_content": "If you have an otherworldly knack for picking the winners of college basketball games, you could get a free ride to Mars on SpaceX's Starship megarocket.\n\nThat's the grand prize in the \"X Bracket Challenge,\" a contest organized by the social media site formerly known as Twitter. To win, you have to submit a perfect bracket for this year'sNCAA basketball tournament, correctly predicting the winners of all 63 games from the first round to the championship matchup.\n\nThat's even more daunting than it sounds; it's never been done, as far as we know. Indeed, nobody has even come all that close.\n\nPerfect destination for a perfect bracket https://t.co/nwkOmYmnFs pic.twitter.com/84PqhZXMjaMarch 14, 2025\n\n\"The longest (verifiable) streak of correct picks in an NCAA tournament bracket to start the beloved March Madness tournament is 49, a mark that was established in 2019,\" Mike Benzie of NCAA.comwrote this past January.\n\n\"An Ohio man correctly predicted the entire 2019 NCAA tournament into the Sweet 16, something we've not seen in years of tracking publicly verifiable online March Madness brackets at all major games,\" he added.\n\nYou don't have to accept theMarstrip if you make history with the first-ever perfect bracket. There's an alternative grand-prize package, which consists of the following, according to X:\n\nIf there is no perfect bracket, the person who comes closest will get $100,000.\n\nBreaking space news, the latest updates on rocket launches, skywatching events and more!\n\nBrackets must be submitted by 11 a.m. EDT (1500 GMT) on Thursday (March 20). That's the day that the men's basketball tournament officially starts, so the X Bracket Challenge presumably pertains to that series of games. (The first round of the women's NCAA basketball tournament begins on Friday, March 21.)\n\nYou can learn more about the contest, which is sponsored by Uber Eats,here.\n\nRelated:SpaceX loses Starship rocket stage again, but catches giant Super Heavy booster during Flight 8 launch (video)\n\n—Starship and Super Heavy explained\n\n—Will 2025 be the year of Starship? SpaceX's megarocket is growing up.\n\n—SpaceX likely to get FAA approval for 25 Starship launches in 2025\n\nStarshipis the biggest and most powerfulrocketever built. SpaceX believes that its combination of brawn and full reusability will finally make Mars settlement feasible for humanity.\n\nStarship is still in the development phase, having flown eight fully stacked test flights to date. On the most recent two liftoffs, which occurred in January and March of this year, Starship's upper stage experienced anomalies andexploded over the Atlantic Oceanless than 10 minutes into each flight.\n\nIt's no surprise that the X Bracket Challenge features SpaceX so prominently. Both the social media site and the spaceflight company are owned byElon Musk, the richest person in the world.\n\nJoin our Space Forumsto keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at:community@space.com.\n\nMichael Wall is a Senior Space Writer withSpace.comand joined the team in 2010. He primarily covers exoplanets, spaceflight and military space, but has been known to dabble in the space art beat. His book about the search for alien life, \"Out There,\" was published on Nov. 13, 2018. Before becoming a science writer, Michael worked as a herpetologist and wildlife biologist. He has a Ph.D. in evolutionary biology from the University of Sydney, Australia, a bachelor's degree from the University of Arizona, and a graduate certificate in science writing from the University of California, Santa Cruz. To find out what his latest project is, you can follow Michael on Twitter.\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nSpaceX launches 23 Starlink internet satellites to orbit from Florida's Space Coast (video, photos)\n\nPrivate Starlab space station moves into 'full-scale development' ahead of 2028 launch\n\nEuclid space telescope's 1st results reveal 'a goldmine of data' in search for dark matter and dark energy (images, video)",
    "extraction_status": "success"
  },
  "https://time.com/7273133/tiktok-ban-trump-deadline/_What the TikTok Ban Deadline Could Mean for the App's Future": {
    "company": "ByteDance",
    "title": "What the TikTok Ban Deadline Could Mean for the App's Future",
    "url": "https://time.com/7273133/tiktok-ban-trump-deadline/",
    "source": "TIME",
    "body": "TikTok, which boasts more than 170 million users, has been under fire by U.S. legislators over concerns about data privacy and national security. In order to save the app, Trump gave the social media site until April 5 to divest and find a U.S.-based owner.",
    "date": "2025-03-31T19:29:00+00:00",
    "full_content": "Despite a last-minute save by President Donald Trump in January, thefate of TikTokremains murky as the deadline to save the app approaches.\n\nTikTok, which boasts more than 170 million users, has been under fire by U.S. legislators over concerns about data privacy and national security. In order to save the app, Trump gave the social media site until April 5 to divest and find a U.S.-based owner.\n\nUnderhis previous term, Trump was the acting force seeking to ban TikTok in the U.S. But the Presidentseemed favorabletowards the app following his election win, citing it as part of why he secured support from young voters.\n\nAdvertisement\n\nAdvertisement\n\n\"We have a lot of potential buyers,\" Trump said on Air Force One Sunday. \"I'd like to see Tiktok remain alive.\" Trump indicated that he would extend the deadline if a deal was not finalized. China has indicated that it would not support the forced sale of TikTok.\n\nThe latest tussle is just the most recent development in the long legal battle to keep TikTok available in the U.S. Efforts to ban TikTok in Montana wereoverturnedby a federal judge in 2023 after creators filed suit against the state.\n\nTikTok did not immediately respond to TIME’s request for comment.\n\nHere’s what to know.\n\nTikTok is owned by its Beijing-based parent company, ByteDance. Sixty percent of the company is owned by investors including Carlyle Group, General Atlantic, and Susquehanna International Group,according to TikTok’s U.S. Data Security page. The remaining 40% is divided between ByteDance employees and the founder of ByteDance.\n\nTikTok is not available in mainland China and has headquarters in Los Angeles and Singapore.\n\nBut its parent company does have to comply with Chinese law because it operates other video first platforms such asDouyin, the Chinese-equivalent of TikTok. The Chinese government therefore has a “golden share” of one of its subsidiaries, Douyin, owning about 1% of that app.\n\nCongress passed a TikTok ban as part of a foreign aid supplemental package, citing national security concerns. Lawmakers were particularly concerned that the company could share data with the Chinese government or interfere with users’ algorithms in a way that would benefit the foreign government. Chinese national security laws require any companies or organizations to cooperate with the country’s national intelligence efforts.\n\n“Congress is not acting to punish ByteDance, TikTok or any other individual company,” Senate Commerce Committee Chairwoman Maria Cantwell said inApril 2024. “Congress is acting to prevent foreign adversaries from conducting espionage, surveillance, maligned operations, harming vulnerable Americans, our servicemen and women, and our U.S. government personnel.”\n\nAlready, the app is not permitted on any government-owned devices in the U.S. Other countries, including India have banned TikTok for all users since 2020, while Australia and Canada similarly forbade TikTok from operating on any devices issued by the federal government.\n\nThe current April 5 deadline was issued via Executive Order. Trump could possibly issue another such order to extend the deadline.\n\nThe last time the app was banned, U.S.-based users were unable to comment, share, or view any videos. “A law banning TikTok has been enacted in the U.S. Unfortunately, that means you can’t use TikTok for now,” a message on a gray background read during theone-day TikTok pause.\n\nEven when the app was restored, TikTok was unavailable for download on the Apple and Google Play stores until mid-February.\n\nIt is unclear whether another potential ban would function similarly to the previous one.",
    "extraction_status": "success"
  },
  "https://www.inc.com/rebecca-deczynski/trump-says-tiktok-deal-will-be-secured-before-saturday-deadline/91169426_Trump Says TikTok Deal Will Be Secured Before Saturday Deadline": {
    "company": "ByteDance",
    "title": "Trump Says TikTok Deal Will Be Secured Before Saturday Deadline",
    "url": "https://www.inc.com/rebecca-deczynski/trump-says-tiktok-deal-will-be-secured-before-saturday-deadline/91169426",
    "source": "Inc.com",
    "body": "President Donald Trump said a deal with TikTok's Chinese parent ByteDance to sell the short video app used by 170 million Americans would be struck before a deadline on Saturday.",
    "date": "2025-03-31T18:30:00+00:00",
    "full_content": "Content extraction failed: 403 Client Error: Forbidden for url: https://www.inc.com/rebecca-deczynski/trump-says-tiktok-deal-will-be-secured-before-saturday-deadline/91169426",
    "extraction_status": "success"
  },
  "https://www.theinformation.com/articles/stripe-minted-2-billion-cash-last-year-go-public_Stripe Minted More Than $2 Billion in Cash Last Year. Why Go Public?": {
    "company": "Stripe",
    "title": "Stripe Minted More Than $2 Billion in Cash Last Year. Why Go Public?",
    "url": "https://www.theinformation.com/articles/stripe-minted-2-billion-cash-last-year-go-public",
    "source": "The Information",
    "body": "Stripe is putting up the kind of numbers that would send its stock soaring, if it had public stock. The payments processing firm doubled its free cash flow last year to about $2.2 billion and grew revenues about 28% to $5.",
    "date": "2025-03-26T18:12:00+00:00",
    "full_content": "Content extraction failed: 403 Client Error: Forbidden for url: https://www.theinformation.com/articles/stripe-minted-2-billion-cash-last-year-go-public",
    "extraction_status": "success"
  },
  "https://www.yahoo.com/news/shein-improve-garment-workers-lives-140000197.html_Can Shein Improve Garment Workers' Lives Without the 'Flashy PR Play'?": {
    "company": "SHEIN",
    "title": "Can Shein Improve Garment Workers' Lives Without the 'Flashy PR Play'?",
    "url": "https://www.yahoo.com/news/shein-improve-garment-workers-lives-140000197.html",
    "source": "Yahoo",
    "body": "In a new press release, the e-tail juggernaut extols its investments in factory upgrades and quality-of-life improvements in southern China. But is it all as it seems?",
    "date": "2025-03-31T14:00:00+00:00",
    "full_content": "When David Hachfeld saw Shein’s press release extolling what the e-tail Goliath said was the continuation of its “drumbeat of support” for the factories in its supply chain, his immediate thought was that it sounded like the “same old PR tactics.”\n\nHachfeld is the textiles expert at Public Eye, a Swiss watchdog group whose investigations into Shein’s Chinese supply chain, mostrecently in 2024, uncovered widespread evidence of excessive overtime, poverty wages and dangerous conditions, often in violation of local labor laws. He greeted with skepticism the Singapore-headquartered firm’s claims that it would be earmarking$70 millionuntil 2028 to “empower its ecosystem of third-party manufacturing suppliers and the workers within.” It was the same feeling he felt when he saw Shein’s photos of gleaming factory floors, polished canteens and even a newly renovated “multipurpose” recreation room.\n\nMore from Sourcing Journal\n\nAsia-to-US Air Cargo Buoying Global Demand, Rates\n\nChina's Antitrust Regulator Preps Probe of Panama Ports Deal\n\n'A Stain on Humanity': What Canceled ILAB Grants Mean for Fashion Production\n\n“It’s quite telling that while they boast in detail about every square meter renovated at a supplier, they still steadfastly refuse to disclose their authorized supplier list,” he said. “Credibility and secrecy don’t go together. And this lack of transparency makes it impossible to independently verify their claims of improvement.”\n\nShein, which doesn’t operate its own facilities but rather contracts from a vast network of partners, said it has to date upgraded 203 factories spanning 500,000 square meters as part of its so-calledSupplier Community Empowerment Program, which it unveiled in 2022 on the heels of allegations byBritain’s Channel 4that employees at two Guangzhou suppliers were toiling 18-hour days, with only one day off per month, for as little as 3 cents per hour. TheTemu nemesisrefuted most of the claims, denying, for instance, that the factories withheld or deducted wages if mistakes were made or quotas unmet. As of 2024, Shein has disbursed more than $33 million to SCEP initiatives in southern China, including $7.5 million for factory upgrades and expansion, $280,000 for the construction or renovation of canteens for workers and $430,000 to build or enhance free accommodation options for migrant workers.\n\nBut Hachfeld would need to see it to believe it, he said.\n\n“In 2023, when we looked into Shein’s claims about their Supplier Community Empowerment Program and revisited production clusters in Guangzhou, we unfortunately couldn’t confirm any tangible improvements on the ground,” he said. “In fact, workers interviewed at different manufacturing sites reported again severe violations of labor standards, including shocking 75-hour work weeks. We asked Shein to disclose the facilities supposedly covered by the program back then, but they refused to be transparent, and they continue to refuse their suppliers to this day.”\n\nThese were the days, as rumor had it, when Shein was still pursuing a U.S. initial public offering. But bipartisan backlash from Capitol Hill, which urged the Securities and Exchange Commission to hold off with registration until the fast fashion purveyor could independently certify that it didn’t use forced labor from China’s persecuted Uyghur minority, sent Shein—reportedly—to seek a float in London, where it was criticized at aparliamentary hearingfor failing to say whether it uses Chinese cotton, 90 percent of which hails from Xinjiang. (The answer, as it turned out?It depends, Shein appeared to say in a written response later.)\n\nBy all appearances, Shein’s provision of summer camps for hundreds of workers’ children, a commitment to establish and staff dozens of childcare centers for free afterschool care, and its offer of financial assistance for funding medical expenses, children’s education or “other personal challenges” would be good things.\n\nNot so, however, for author and Columbia University fashion policy and sustainability lecturer Elizabeth Cline, who said that she found all of this “honestly disturbing.”\n\n“Why should a person working for multi-billion dollar Shein need ‘financial aid’ for health expenses?” she said. “These programs raise questions that urgently need to be answered: Are the childcare services running after school, or do they exist so parents can work well into the night? Are parents paid enough to feed and house their kids, or does the company-owned dormitory exist to keep wages at a level of dependence?”\n\nDitto with the “technology enhancements” that theMissguided ownersays it’s investing in through research and development at its sprawling Centre of Innovation for Garment Manufacturing in Guangzhou—the same one that agroup of influencerstoured in 2023 to public ridicule and outrage. Shein said it has spent more than $23 million on developing innovative “lean production” solutions for garment manufacturing, such as the use of automated guided vehicles. In 2024, the center submitted 30 patents for new technology that Shein says are employed in complex craftsmanship methods, including dealing with specialized fabrics.\n\nCline isn’t sold. “Shein is primarily investing in more automated machinery to speed up production,” she said. “We do not need faster fast fashion. It threatens to push garment workers to sew faster, does nothing to improve the lives of workers, and will add more waste and consumerism to our world that only benefits these giant companies and their shareholders.”\n\nKatrina Caspelich, chief marketing officer at the fashion advocacy group Remake, is well-versed in PR speak. She said that at first glance, Shein’s Supplier Community Empowerment Program “reads like a well-crafted PR play: full of big numbers, strategic facility upgrades and worker-focused initiatives.” But she also urged those scanning it not to be “blinded by the flashy headline.”\n\n“Let’s focus on the root cause of why Shein’s supply chain has needed such a massive overhaul in the first place,” Caspelich said. “Shein built its empire on an ultra-fast fashion model that thrives on rapid production speeds, low costs, and a lack of transparency. The brand’s historical issues with worker exploitation, unpaid wages, excessive overtime and evenchild labor allegationsaren’t solved by upgrading canteens or adding robots to factory floors.”\n\nA $70 million largesse may sound impressive, she said, but Shein was valued at $66 billion—with a b—in 2023. It’s Caspelich’s belief that its commitment is a “tiny drop in the bucket” that is more about making a good public impression than driving meaningful improvements.\n\n“The true test isn’t how many childcare centers they open or how many QR codes workers can scan for financial assistance; it’s whether Shein will fundamentally change the exploitative business model that fuels its success,” she said. “Genuine change would mean slowing down production, ensuring living wages, embracing transparency, and allowing independent audits—not just controlled,self-reported narratives.”\n\nShein has said that any supply chain partner that signs its code of conduct must agree to shun the use of forced labor, including prison and bonded labor, while complying with the International Labour Organisation’s forced labor conventions in their direct or indirect procurement activities. Even so, audits, as experts have previously pointed out, are especially inadequate when it comes to state-sponsored forced labor, which is what Beijing is beingaccused of promotingboth in and outside of Xinjiang.\n\nHachfeld didn’t mince words. “Honestly, Shein should stop trying to distract with summer camps and charity programs for workers in need,” he said. “What they really need to focus on is [to] ensure that all workers in their supply chain, from the seamstress to the warehouse picker, earn living wages within regular working hours and social security so they don’t need charity in the first place.”",
    "extraction_status": "success"
  },
  "https://finance.yahoo.com/news/step-panem-shein-lionsgate-drop-130000976.html_Step Into Panem: SHEIN and Lionsgate Drop The Hunger Games Collection": {
    "company": "SHEIN",
    "title": "Step Into Panem: SHEIN and Lionsgate Drop The Hunger Games Collection",
    "url": "https://finance.yahoo.com/news/step-panem-shein-lionsgate-drop-130000976.html",
    "source": "Yahoo Finance",
    "body": "Today, global fashion and lifestyle online retailer SHEIN, announced the launch of its The Hunger Games franchise collection in collaboration with Lionsgate. The limited-edition collaboration fuses fashion,",
    "date": "2025-03-31T13:00:00+00:00",
    "full_content": "Pieces include statement outerwear and accessories inspired by the world of \"The Hunger Games\"\n\nLOS ANGELES,March 31, 2025/PRNewswire/ -- Today, global fashion and lifestyle online retailerSHEIN,  announced the launch of itsThe Hunger Gamesfranchise collection in collaboration withLionsgate. The limited-edition collaboration fuses fashion, fandom and pop culture making it a must-have for anyThe Hunger Gamesfilms fan enthusiast.\n\nThe collection includes bold apparel and accessories for both women and men, including elements inspired by the iconic franchise. From Capitol chic to District daring, these extraordinary pieces let fans rebel against the ordinary. Fans can expect vibrant designs, symbolic imagery, and artwork inspired by the world of The Hunger Games. Celebrating the themes of survival, resilience, and revolution,The Hunger Gamesx SHEIN collection brings fans a fresh way to showcase their love for the series.\n\n\"We are excited to collaborate with SHEIN to bringThe Hunger Gamesfans a collection that lets them wear their fandom with pride,\" saidDebbie Olshan, Director, Global Consumer Products at Lionsgate. \"This collaboration blends fashion and film, enabling fans to express their connection to the story in a stylish and meaningful way.\"\n\nThe Hunger Games franchise encompasses four critically-acclaimed novels that have sold over 100 million copies worldwide and been translated into 52 languages as well as a blockbuster film franchise that has grossed more than$3.4 billionat the worldwide box office.Suzanne Collins'latest Hunger Games novel, the eagerly-anticipatedSunrise on the Reaping, was launched by Scholastic onMarch 18, 2025and will be adapted into a major motion picture event to be released by Lionsgate onNovember 20, 2026. Lionsgate also just announced the October debut ofThe Hunger Gamesstage play inLondon.\n\nThe collection is available on SHEIN's website, with prices ranging fromUSD$5-$20. SHEIN invites customers to share their fun finds on social media by tagging @SHEIN_US with hashtag #TheHungerGamesxSHEIN on all social platforms.\n\nFor more information onThe Hunger Gamesx SHEIN collaboration and to explore the collection, please visit:https://us.shein.com/campaigns/thehungergames2025ss?onelink=9/4hfbnd6at83a&requestId=olw-4hwmpua0ahos&url_from=onelink590197771464048693.\n\nAbout SHEIN\n\nSHEIN is a global online fashion and lifestyle retailer offering SHEIN-branded apparel and products from a global network of vendors, all at affordable prices. Headquartered inSingapore, SHEIN is committed to making the beauty of fashion accessible to all, promoting its industry-leading, on-demand production methodology for a smarter, future-ready industry. To learn more about SHEIN, visitwww.sheingroup.com.\n\nAbout LionsgateGlobal Products & Experiences\n\nLionsgate Global Products & Experiences is a division within Lionsgate Studios Corp. (Nasdaq: LION), one of the world's leading standalone, pure play, publicly-traded content companies. By leveraging the studios' world-class portfolio of film and television brands and franchises, the division drives incremental revenue and builds consumer engagement via live shows and experiences, location-based entertainment destinations, games, physical and digital merchandise, and select strategic partnerships and investments.\n\nThe group has announced multiple stage productions (Dirty Dancing,La La Land,WonderandNashvillefor Broadway, andThe Hunger GamesforLondon), integrations with marquee games (Call of Duty, Dead By Daylight, Roblox, and Fortnite), and collaborations with best-in-class consumer products licensees (LEGO, American Classics, Hot Toys, Funko, and more). Attractions based on Lionsgate's top franchises The Hunger Games,John Wick, SAW and other iconic IP can be found at theme parks and destinations inAsia,the United States, theUnited Kingdom, and theMiddle East, with the highly anticipated John Wick Experience now open inLas Vegas.\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/step-into-panem-shein-and-lionsgate-drop-the-hunger-games-collection-302414659.html\n\nSOURCE SHEIN",
    "extraction_status": "success"
  },
  "https://www.forbes.com/sites/richardnieva/2025/03/26/anthropic-databricks/_Anthropic And Databricks Team Up To Help Customers Launch Their Own AI Agents": {
    "company": "Databricks",
    "title": "Anthropic And Databricks Team Up To Help Customers Launch Their Own AI Agents",
    "url": "https://www.forbes.com/sites/richardnieva/2025/03/26/anthropic-databricks/",
    "source": "Forbes",
    "body": "The deal will bring flagship model Claude, to thousands of corporate customers, including Comcast, Conde Nast and Block.",
    "date": "2025-03-26T19:39:00+00:00",
    "full_content": "ByRichard Nieva\n\nForbes Staff.\n\nAnthropic announced a 5-year partnership with Databricks.\n\nAnthropic wants to bring its powerful Claude models to more businesses.\n\nOn Wednesday, the $62 billion AI company said it signed a 5-year partnership to bring its AI models to the data storage and analytics company Databricks’ enterprise platform. The deal, worth $100 million, according to a source familiar with the financing, will let Databricks’ over 10,000 customers, such as Comcast, Conde Nast and Block, use Claude to create and deploy AI agents for their businesses.\n\nThe idea is to let companies launch AI bots that can pull from their own data to carry out tasks in specific areas, like detecting financial fraud, developing medicine or assisting with customer service. The deal includes access to Anthropic’s latest AI model, Claude 3.7 Sonnet, which includes features of a conventional language model, but is also capable of “reasoning” through multi-step problems.\n\nThe focus on the enterprise comes directly from Anthropic’s founding principles, said Mike Krieger, Anthropic’s chief product officer. The company was started in 2021 by CEO Dario Amodei and other defectors from OpenAI, aimed at building artificial intelligence with an emphasis on guardrails. “The purpose and story around the company is being really grounded in responsibility, trust and safety,” Krieger toldForbes.\n\nSince companies already secure some of their most important data with Databricks, they’ll be able to use Claude to retrieve and parse through massive troves of unstructured data safely, which will “matter a lot to enterprises,” said Krieger, who cofounded Instagram before leaving Meta in 2018. He joined Anthropic last year.\n\nNaveen Rao, vice-president of AI at Databricks, said that one popular use case will likely be building AI coding assistants that companies can use internally, taking advantage of Claude’s programming ability.\n\nAI giants and upstarts alike are increasingly targeting business customers, who need better reliability and security features than typical consumers. Anthropicreportedlyprojects revenue as high as $34.5 billion in two years, with nearly two-thirds of it coming from business users. OpenAI’s ChatGPT Enterprise, a version of the popular bot specifically for corporate customers, has 1 million paid users. Then there are startups like$1.9 billion Writer AI, which makes AI services to automate menial business tasks, and$1.3 billion Clay, makers of AI spreadsheet tools for companies to organize and suss out sales leads.\n\nDatabricks, valued at $62 billion, makes money by renting out tools to other companies for storing, collecting and governing data. The company—backed by Nvidia, Capital One and Andreessen Horowitz—was founded in 2013, but has flown high during the current frenzy over generative AI. Last year, the companylaunched its ownopen source AI model, called DBRX, aimed at letting companies build and deploy their own AI agents. Other models available on Databricks’ platform include Meta’s Llama and Mistral’s open source models.\n\nAs part of the partnership, Krieger and Rao said Anthropic and Databricks may develop new features together. They could also conduct joint research around new ways to deploy and use frontier models. For example, the two companies could figure out ways to make the models better in areas that need extreme accuracy, like accounting or legal services, Rao said.\n\nFor Anthropic, the deal will allow the company to get better at deploying agents because it will have a direct channel of feedback from Databricks customers using the models every day. “That’s an area where the rubber hits the road,” Krieger said.",
    "extraction_status": "success"
  },
  "https://www.technologyreview.com/2025/03/27/1113916/anthropic-can-now-track-the-bizarre-inner-workings-of-a-large-language-model/_Anthropic can now track the bizarre inner workings of a large language model": {
    "company": "Anthropic",
    "title": "Anthropic can now track the bizarre inner workings of a large language model",
    "url": "https://www.technologyreview.com/2025/03/27/1113916/anthropic-can-now-track-the-bizarre-inner-workings-of-a-large-language-model/",
    "source": "MIT Technology Review",
    "body": "The AI firm Anthropic has developed a way to peer inside a large language model and watch what it does as it comes up with a response, revealing key new insights into how the technology works. The takeaway: LLMs are even stranger than we thought.",
    "date": "2025-03-28T12:20:00+00:00",
    "full_content": "The AI firm Anthropic has developed a way topeer inside a large language modeland watch what it does as it comes up with a response, revealing key new insights into how the technology works. The takeaway: LLMs are even stranger than we thought.\n\nThe Anthropic team was surprised by some of the counterintuitive workarounds that large language models appear to use to complete sentences, solve simple math problems, suppress hallucinations, and more, says Joshua Batson, a research scientist at the company.\n\nIt’s no secret that large language modelswork in mysterious ways. Few—if any—mass-market technologies have ever beenso little understood. That makes figuring out what makes them tick one of the biggest open challenges in science.\n\nBut it’s not just about curiosity. Shedding some light on how these models work exposes their weaknesses, revealing why theymake stuff upand why they can betricked into going off the rails. It helps resolvedeep disputes about exactly what these models can and can’t do. And it shows how trustworthy (or not) they really are.\n\nBatson and his colleagues describe their new work in two reports published today. The first presents Anthropic’s use of a technique called circuit tracing, which lets researchers track the decision-making processes inside a large language model step by step. Anthropic used circuit tracing to watch its LLM Claude 3.5 Haiku carry out various tasks. The second (titled “On the Biology of a Large Language Model”) details what the team discovered when it looked at 10 tasks in particular.\n\n“I think this is really cool work,” says Jack Merullo, who studies large language models at Brown University in Providence, Rhode Island, and was not involved in the research. “It’s a really nice step forward in terms of methods.”\n\nCircuit tracing is not itself new. Last year Merullo and his colleaguesanalyzed a specific circuit in a version of OpenAI’s GPT-2, an older large language model that OpenAI released in 2019. But Anthropic has now analyzed a number of different circuits inside a far larger and far more complex model as it carries out multiple tasks. “Anthropic is very capable at applying scale to a problem,” says Merullo.\n\nEden Biran, who studies large language models at Tel Aviv University, agrees. “Finding circuits in a large state-of-the-art model such as Claude is a nontrivial engineering feat,” he says. “And it shows that circuits scale up and might be a good way forward for interpreting language models.”\n\nCircuits chain together different parts—or components—of a model. Last year, Anthropicidentified certain components inside Claudethat correspond to real-world concepts. Some were specific, such as “Michael Jordan” or “greenness”; others were more vague, such as “conflict between individuals.” One component appeared to represent the Golden Gate Bridge. Anthropic researchers found that if they turned up the dial on this component, Claude could be made to self-identify not as a large language model but as the physical bridge itself.\n\nThe latest work builds on that research and the work of others,including Google DeepMind, to reveal some of the connections between individual components. Chains of components are the pathways between the words put into Claude and the words that come out.\n\n“It’s tip-of-the-iceberg stuff. Maybe we’re looking at a few percent of what’s going on,” says Batson. “But that’s already enough to see incredible structure.”\n\nResearchers at Anthropic and elsewhere are studying large language models as if they were natural phenomena rather than human-built software. That’s because the models are trained, not programmed.\n\n“They almost grow organically,” says Batson. “They start out totally random. Then you train them on all this data and they go from producing gibberish to being able to speak different languages and write software and fold proteins. There are insane things that these models learn to do, but we don’t know how that happened because we didn’t go in there and set the knobs.”\n\nSure, it’s all math. But it’s not math that we can follow. “Open up a large language model and all you will see is billions of numbers—the parameters,” says Batson. “It’s not illuminating.”\n\nAnthropic says it was inspired by brain-scan techniques used in neuroscience to build what the firm describes as a kind of microscope that can be pointed at different parts of a model while it runs. The technique highlights components that are active at different times. Researchers can then zoom in on different components and record when they are and are not active.\n\nTake the component that corresponds to the Golden Gate Bridge. It turns on when Claude is shown text that names or describes the bridge or even text related to the bridge, such as “San Francisco” or “Alcatraz.” It’s off otherwise.\n\nYet another component might correspond to the idea of “smallness”: “We look through tens of millions of texts and see it’s on for the word ‘small,’ it’s on for the word ‘tiny,’ it’s on for the French word ‘petit,’ it’s on for words related to smallness, things that are itty-bitty, like thimbles—you know, just small stuff,” says Batson.\n\nHaving identified individual components, Anthropic then follows the trail inside the model as different components get chained together. The researchers start at the end, with the component or components that led to the final response Claude gives to a query. Batson and his team then trace that chain backwards.\n\nSo: What did they find? Anthropic looked at 10 different behaviors in Claude. One involved the use of different languages. Does Claude have a part that speaks French and another part that speaks Chinese, and so on?\n\nThe team found that Claude used components independent of any language to answer a question or solve a problem and then picked a specific language when it replied. Ask it “What is the opposite of small?” in English, French, and Chinese and Claude will first use the language-neutral components related to “smallness” and “opposites”to come up with an answer. Only then will it pick a specific language in which to reply. This suggests that large language models can learn things in one language and apply them in other languages.\n\nAnthropic also looked at how Claude solved simple math problems. The team found that the model seems to have developed its own internal strategies that are unlike those it will have seen in its training data. Ask Claude to add 36 and 59 and the model will go through a series of odd steps, including first adding a selection of approximate values (add 40ish and 60ish, add 57ish and 36ish). Towards the end of its process, it comes up with the value 92ish. Meanwhile, another sequence of steps focuses on the last digits, 6 and 9, and determines that the answer must end in a 5. Putting that together with 92ish gives the correct answer of 95.\n\nAnd yet if you then ask Claude how it worked that out, it will say something like: “I added the ones (6+9=15), carried the 1, then added the 10s (3+5+1=9), resulting in 95.” In other words, it gives you a common approach found everywhere online rather than what it actually did. Yep! LLMs are weird. (And not to be trusted.)\n\nThis is clear evidence that large language models will give reasons for what they do that do not necessarily reflect what they actually did. But this is true for people too, says Batson: “You ask somebody, ‘Why did you do that?’ And they’re like, ‘Um, I guess it’s because I was— .’ You know, maybe not. Maybe they were just hungry and that’s why they did it.”\n\nBiran thinks this finding is especially interesting. Many researchers study the behavior of large language models by asking them to explain their actions. But that might be a risky approach, he says: “As models continue getting stronger, they must be equipped with better guardrails. I believe—and this work also shows—that relying only on model outputs is not enough.”\n\nA third task that Anthropic studied was writing poems. The researchers wanted to know if the model really did just wing it, predicting one word at a time. Instead they found that Claude somehow looked ahead, picking the word at the end of the next line several words in advance.\n\nFor example, when Claude was given the prompt “A rhyming couplet: He saw a carrot and had to grab it,” the model responded, “His hunger was like a starving rabbit.” But using their microscope, they saw that Claude had already hit upon the word “rabbit” when it was processing “grab it.” It then seemed to write the next line with that ending already in place.\n\nThis might sound like a tiny detail. But it goes against the common assumption that large language models always work by picking one word at a time in sequence. “The planning thing in poems blew me away,” says Batson. “Instead of at the very last minute trying to make the rhyme make sense, it knows where it’s going.”\n\n“I thought that was cool,” says Merullo. “One of the joys of working in the field is moments like that. There’s been maybe small bits of evidence pointing toward the ability of models to plan ahead, but it’s been a big open question to what extent they do.”\n\nAnthropic then confirmed its observation by turning off the placeholder component for “rabbitness.” Claude responded with “His hunger was a powerful habit.” And when the team replaced “rabbitness” with “greenness,”Claude responded with “freeing it from the garden’s green.”\n\nAnthropic also explored why Claude sometimes made stuff up, a phenomenon known as hallucination. “Hallucination is the most natural thing in the world for these models, given how they’re just trained to give possible completions,” says Batson. “The real question is, ‘How in God’s name could you ever make it not do that?’”\n\nThe latest generation of large language models, like Claude 3.5 and Gemini and GPT-4o, hallucinate far less than previous versions, thanks to extensive post-training (the steps that take an LLM trained on text scraped from most of the internet and turn it into a usable chatbot). But Batson’s team was surprised to find that this post-training seems to have made Claude refuse to speculate as a default behavior. When it did respond with false information, it was because some other component had overridden the “don’t speculate” component.\n\nThis seemed to happen most often when the speculation involved a celebrity or other well-known entity. It’s as if the amount of information available on a subject pushed the speculation through, despite the default setting. When Anthropic overrode the “don’t speculate” component to test this, Claude produced lots of false statements about individuals, including claiming that Batson was famous for inventing the Batson principle (he isn’t).\n\nBecause we know so little about large language models, any new insight is a big step forward. “A deep understanding of how these models work under the hood would allow us to design and train models that are much better and stronger,” says Biran.\n\nBut Batson notes there are still serious limitations. “It’s a misconception that we’ve found all the components of the model or, like, a God’s-eye view,” he says. “Some things are in focus, but other things are still unclear—a distortion of the microscope.”\n\nAnd it takes several hours for a human researcher to trace the responses to even very short prompts. What’s more, these models can do a remarkable number of different things, and Anthropic has so far looked at only 10 of them.\n\nBatson also says there are big questions that this approach won’t answer. Circuit tracing can be used to peer at the structures inside a large language model, but it won’t tell you how or why those structures formed during training. “That’s a profound question that we don’t address at all in this work,” he says.\n\nBut Batson does see this as the start of a new era in which it is possible, at last, to find real evidence for how these models work: “We don’t have to be, like: ‘Are they thinking? Are they reasoning? Are they dreaming? Are they memorizing?’ Those are all analogies. But if we can literally see step by step what a model is doing, maybe now we don’t need analogies.”\n\nThe new general AI agent from China had some system crashes and server overload—but it’s highly intuitive and shows real promise for the future of AI helpers.\n\nThese newer models appear more likely to indulge in rule-bending behaviors than previous generations—and there’s no way to stop them.\n\nWe’re starting to get a better sense of how chatbots are affecting us—but there’s still a lot we don’t know.\n\nThe country poured billions into AI infrastructure, but the data center gold rush is unraveling as speculative investments collide with weak demand and DeepSeek shifts AI trends.\n\nDiscover special offers, top stories,\n            upcoming events, and more.",
    "extraction_status": "success"
  },
  "https://techcrunch.com/2025/03/29/week-in-review-elon-musks-xai-buys-x/_Week in Review: Elon Musk's xAI buys X": {
    "company": "xAI",
    "title": "Week in Review: Elon Musk's xAI buys X",
    "url": "https://techcrunch.com/2025/03/29/week-in-review-elon-musks-xai-buys-x/",
    "source": "TechCrunch",
    "body": "Welcome back to Week in Review! Elon Musk says that xAI bought X in an all-stock deal; a16z-backed 11x faked some customers; the Lumon Terminal Pro pops",
    "date": "2025-03-31T16:37:00+00:00",
    "full_content": "Welcome back to Week in Review! Elon Musk says that xAI bought X in an all-stock deal; a16z-backed 11x faked some customers; the Lumon Terminal Pro pops up on Apple’s website; and much more. Let’s dig in!\n\nxAI buys X:X owner Elon Musk announced on X on Friday thatxAI acquired X in an all-stock transaction. This combination values xAI at $80 billion and X at $33 billion. “Today, we officially take the step to combine the data, models, compute, distribution and talent,” Musk said.\n\nFudging the numbers:More than 20 sources — including investors and current and former employees — told TechCrunch that a16z- and Benchmark-backed 11xhas experienced financial struggles, largely of its own making. “They absolutely massaged the numbers internally when it came to growth and churn,” a former employee said.\n\nBlock layoffs:A leaked message by Block CEO Jack Dorsey reviewed by TechCrunch revealed that the company — which owns Cash App and Square —was laying off 931 people, or 8% of the company, as part of an “org restructuring.”Dorsey’s email denies that the layoffs are for financial reasons or to replace workers with AI.\n\nThis is TechCrunch’s Week in Review, where we recap the week’s biggest news. Want this delivered as a newsletter to your inbox every Saturday?Sign up here.\n\n“What, me do fraud?”The White House confirmed to TechCrunch on Friday thatPresident Trump pardoned Trevor Milton, the founder of bankrupt hydrogen trucking startup Nikola who was convicted of fraud. The pardon comes just a few weeks after Nikola filed for Chapter 11 bankruptcy.\n\nSpeaking of leaks:A leaked database seen by TechCrunch shows that China has developed anAI system that supercharges its already formidable censorship machine, extending far beyond traditional taboos like the Tiananmen Square massacre.\n\nSkunkworks spins out:Rivian’s skunkworks project wasspun out of the companywith a new name and $105 million in funding from Eclipse Ventures. The startup, called Also, will exist as a stand-alone company from Rivian.\n\nGet your computers ready:Apple announced thatWorldwide Developers Conference 2025 will begin June 9. Reports have indicated that Apple has prepared dramatic software overhauls for the iPhone, iPad, and Mac. We also expect iOS 19, which, according to Bloomberg, will be “the biggest revamp since iOS 7.”\n\nDNA debacle:DNA testing company23andMe filed for bankruptcythis week. The company’s co-founder and CEO, Anne Wojcicki, separately said she is leaving to become an independent bidder for the company.Your data might not be safe, sohere are some ways to delete it.\n\nAn act of Congress:Kat Abughazaleh, the 26-year-old who was among the people laid off from Media Matters after Elon Musk sued the company,announced this week that she’s running for Congress. “I’m trying to be really transparent about how to run for office, because I feel like it’s kind of this black hole that seems a lot more difficult than it should be,” she told TechCrunch.\n\nA slice of “Severance”:I haven’t watched any seasons of “Severance,” and based on seemingly everyone in the world, I’m absolutely missing out. My colleague Sarah is among those people, and she spotted aLumon Terminal Pro (the machine they use in the show) on Apple’s website.\n\nBackdoor to China:SpaceX, a defense contractor for the Pentagon, reportedlyallowed Chinese investors to buy shares, as long as the funds are routed through the Cayman Islands or other offshore hubs.\n\nThe Switch 2 is coming!And at Nintendo Direct, the company announced that it’s working onVirtual Game Cards that allow players to take their downloaded gameswith them to use on other devices.\n\nChatGPT’s new image generator launched this week, and with it came a flood of images based on art by Studio Ghibli being posted online. While the debate over whether this is horrifying (Studio Ghibli co-founder Hayao Miyazaki once said that “AI is an insult to life itself”) or cool, it does highlight one thing:Copyrights are still a concernwhen it comes to AI-generated anything. Although copying the art style isn’t necessarily unlawful, OpenAI training its models on Studio Ghibli’s art operates in a legal “gray area.”\n\n“I think this raises the same question that we’ve been asking ourselves for a couple years now,” Evan Brown, an intellectual property lawyer, told TechCrunch. “What are the copyright infringement implications of going out, crawling the web, and copying into these databases?”\n\nTopics\n\nDeputy Managing Editor\n\nKaryne Levy is the deputy managing editor of TechCrunch. Before joining TC, Karyne was deputy managing editor at Protocol, helping manage a newsroom of more than 40 people. Prior to that she was a senior producer at Scribd, an assigning editor at NerdWallet, a senior tech editor at Business Insider, and assistant managing editor at CNET, where she also hosted Rumor Has It for CNET TV. She lives outside San Francisco.\n\nAmazon unveils Nova Act, an AI agent that can control a web browser\n\n“This isn’t ‘The Matrix'”\n\nPerplexity CEO denies having financial issues, says no IPO before 2028\n\nChina Miéville says we shouldn’t blame science fiction for its bad readers\n\nThe hottest AI models, what they do, and how to use them\n\nAmazon shakes up streaming leadership team\n\n‘It was weird, man’: Zuckerberg took Facebook employees to see ‘The Social Network’ when it came out",
    "extraction_status": "success"
  },
  "https://finance.yahoo.com/news/tesla-shares-fall-musk-merges-173555108.html_Tesla Shares Fall After Musk Merges xAI and X in All-Stock Deal Valued at $113 Billion": {
    "company": "xAI",
    "title": "Tesla Shares Fall After Musk Merges xAI and X in All-Stock Deal Valued at $113 Billion",
    "url": "https://finance.yahoo.com/news/tesla-shares-fall-musk-merges-173555108.html",
    "source": "Yahoo Finance",
    "body": "Tesla Inc. (TSLA, Financials) shares fell 3.5% Friday and extended losses by another 6% in premarket trading Monday after CEO Elon Musk said his artificial intelligence company xAI acquired social media platform X in an all-stock transaction.",
    "date": "2025-03-31T17:35:00+00:00",
    "full_content": "Tesla Inc. (TSLA,Financials) shares fell 3.5% Friday and extended losses by another 6% in premarket trading Monday after CEO Elon Musk said his artificial intelligence companyxAI acquired social media platform Xin an all-stock transaction.\n\nMusk said the deal assigns xAI a valuation of $80 billion and X $33 billion, based on $45 billion in equity minus $12 billion in debt. He posted the announcement on X, formerly known as Twitter, which he acquired in October 2022 for $44 billion.\n\nThe acquisition formalizes ongoing integration between the two companies. xAI's Grok chatbot, trained on user content from X, already operates on the platform and became available as a standalone iOS app in January 2025.\n\nMusk said the deal will consolidate both firms' data, compute infrastructure, model development, user reach and personnel. He described the merger as a step toward delivering more intelligent user experiences and promoting xAI's broader mission to seek truth and advance knowledge.\n\nFounded in 2023, xAI raised $5 billion in recent funding, which valued the company at $50 billion. Musk previously said he would bring a proposal to Tesla's board of directors for a $5 billion investment in xAI following a favorable result from an online poll. Tesla has not issued a statement on the proposal.\n\nX had reportedly been seeking to raise capital at a $44 billion valuation prior to the acquisition. Musk did not say how the transaction might affect that effort.\n\nThis article first appeared onGuruFocus.",
    "extraction_status": "success"
  },
  "https://extra.ie/2025/03/31/news/courts/women-avoid-jail-revolut-scam_Two women avoid jail for their role in Revolut scam that saw doctor lose €11,000": {
    "company": "Revolut",
    "title": "Two women avoid jail for their role in Revolut scam that saw doctor lose €11,000",
    "url": "https://extra.ie/2025/03/31/news/courts/women-avoid-jail-revolut-scam",
    "source": "Extra.ie",
    "body": "Two women in their 20s have been given suspended sentences for their part in a Revolut scam, which saw a doctor lose €11,000.",
    "date": "2025-03-31T17:46:00+00:00",
    "full_content": "Two women in their 20s have been given suspended sentences for their part in a Revolut scam, which saw a doctor lose €11,000.\n\nCourtney Fitzpatrick (26) of Yeats Avenue, Kincora Park in Limerick, and Leah York (22) of Ashfield, Mullingar, Co. Westmeath, were beforeDublin Circuit Criminal Court,where they pleaded guilty to money laundering on September 3, 2023, by possessing the proceeds of crime.\n\nDetective Garda John Sheedy told the court that a doctor received a call that afternoon from an unknown person purporting to be an agent fromRevolut.\n\nThe caller told her that her account had been compromised, and requested access to her app. He told her that her account and card had been frozen.\n\nA number of transactions were then carried out on her account, with €5,500 being transferred to York’s account and €5,500 to Fitzpatrick’s account. The money was subsequently transferred into a cryptocurrency account.\n\nThe women were identified and interviewed by gardaí. Neither wished to name the man who was using their account numbers, and Gda Sheedy accepted that this was due to fear. He also said the women had co-operated with the investigation.\n\nFitzpatrick’s counsel said that she had not had an easy life, and would present as vulnerable and naive.\n\n“I think you’d want to be very, very naive to allow your account to be used by a third party and not know there was something illicit going on,” remarked the judge.\n\n“These two young ladies co-operated with somebody who has made a lot of money,” he said. “What these criminals needed were bank accounts to launder the money.”\n\nHe said they had given their details and allowed these people to get away Scot-free.\n\n“It’s rather tiring dealing with stupid young people,” he said. “They were stupid. To some degree, they were used.”\n\nHowever, he said that they knew what was happening was criminal.\n\nHe imposed a one-year sentence on each woman, but suspended their sentences on condition that each offers €1,500 to the injured party within nine months.\n\n“This is to punish these two young ladies somewhat, and to remind them not to be stupid and so gullible,” he said.\n\n“The doctor has lost €11,000, and I’ve no doubt that doctor worked very hard for that money,” he added.\n\nBoth women wiped their eyes as they entered their bonds.",
    "extraction_status": "success"
  },
  "https://www.analyticsinsight.net/tech-news/canva-pro-review-an-intuitive-solution-for-free-version-limitations_Canva Pro Review: An Intuitive Solution for Free Version Limitations": {
    "company": "Canva",
    "title": "Canva Pro Review: An Intuitive Solution for Free Version Limitations",
    "url": "https://www.analyticsinsight.net/tech-news/canva-pro-review-an-intuitive-solution-for-free-version-limitations",
    "source": "Analytics Insight",
    "body": "For the time being, when everything seems to be reliant on visuals, Canva has become a common go-to geographically, nationally, and internationally by small bus",
    "date": "2025-03-31T14:14:00+00:00",
    "full_content": "For the time being, when everything seems to be reliant on visuals, Canva has become a common go-to geographically, nationally, and internationally by small businesses, content creators, or even just hobbyists. With its extremely useful drag-and-drop features and wide template bank, it turns out to be an easy-to-access platform for anyone to create graphics that would look professionally made. While the free plan works perfectly well for some rather simple designs, most users soon tend to hit upon walls, as is the case with most free plan users. Using Canva Pro is the next most obvious step because it unlocks an array of powerful tools aimed at boosting productivity, making work easier, and resulting in better creative output.\n\nThe free version of Canva offers a good starting point, but it comes with plenty of limitations that would disappoint someone looking for a more professional creative tool. Premium content access is restricted, the free edition has very few templates, stock images, or design elements, which can be extremely limiting for those who need business-quality images made without looking for alternatives.\n\nFree membership storage limitations:Free members have a quota of only 5GB for cloud storage, which can make managing lots of projects or high-resolution materials quite impractical very quickly.\n\nBasic design tools:Important features likeBackground Removerand Magical Resize have been excluded from the free package, leaving users without the ability to quickly and easily set up a time-efficient workflow across different materials.\n\nThe upgrade to Canva Pro allows the user to access and enjoy many features that could help in enhancing creativity and making work more efficient by saving time.Large content collection:Offersunlimited accessto over 100 million well-stocked photos, videos, audio tracks, and graphics for better creative possibilities.Advanced editing options:The capability to remove the background through AI and theMagic Resize optionmakes them easily adjusted to different platforms.Brand kit management:Up to 1,000 brand kit designs available to pro members for maintaining brand consistency using logos, fonts, and colours.Improved storage and organisation:1 terabyte of cloud storage organises sophisticated design assets and allows users to keep projects organised.Cooperative features:The real-time collaboration makes work easy within teams and much simpler to manage workflow reducing stress at times of collaboration.\n\nFor those who want more from their freeCanva subscription, Canva Pro is unquestionably a fantastic choice. The extra features it offers would make the designing process easy and professional. The Payoff is Pronto for individuals and teams looking for crisp work to have this resource. The payoff is even much more worth it for businesses and content creators wanting formalised and consistent branding or visual excellence-more so the access to a content library of incredible size, complex design capabilities, andstreamlined collaboration features.",
    "extraction_status": "success"
  },
  "https://www.geeky-gadgets.com/adobe-creative-cloud-alternatives/_Adobe Alternatives That Could Save You Money and Time": {
    "company": "Canva",
    "title": "Adobe Alternatives That Could Save You Money and Time",
    "url": "https://www.geeky-gadgets.com/adobe-creative-cloud-alternatives/",
    "source": "Geeky Gadgets",
    "body": "Is Adobe still the king of design? Compare top alternatives like Canva, Figma, and Affinity to find the best tool for your creative needs.",
    "date": "2025-03-31T19:15:00+00:00",
    "full_content": "Adobe has long been regarded as the leader in design software, largely due to its powerful Creative Cloud suite. Its dominance is rooted in its advanced features, seamless integration across tools, and widespread adoption by professionals in various industries. However, the design landscape is evolving. Competitors such as Canva, Affinity Suite, CorelDRAW, and Figma are challenging Adobe’s supremacy by offering specialized, cost-effective solutions tailored to specific needs. This guide by Bring Your Own Laptop examines Adobe’s position in the market and evaluates how these alternatives stack up, helping you determine which tool aligns best with your creative goals.\n\nTL;DR Key Takeaways :\n\nAdobe Photoshop has become synonymous with professional photo editing, offering robust tools for compositing, retouching, and AI-powered enhancements. Its versatility and depth make it indispensable for photographers, graphic designers, and digital artists. However, emerging competitors like Canva and Affinity Photo are carving out niches by addressing specific user needs.\n\nVerdict:Photoshop remains the top choice for professionals who require advanced tools and precision. Canva and Affinity Photo, on the other hand, are excellent alternatives for casual users or those working on less complex projects.\n\nAdobe Illustrator is widely recognized as the industry standard for vector graphics and typography. Its precision tools and prepress capabilities make it indispensable for creating logos, illustrations, and print-ready designs. However, alternatives like Affinity Designer, CorelDRAW, and Figma offer compelling options for specific use cases.\n\nVerdict:Illustrator remains unmatched for intricate vector work and professional-grade typography. Affinity Designer and CorelDRAW are strong alternatives for specific needs, while Figma excels in UX/UI design.\n\nWatch this video on YouTube.\n\nBelow are more guides on AI images from our extensive range of articles.\n\nAdobe InDesign continues to dominate the desktop publishing space, offering advanced tools for typography, automation, and handling large documents. Its ability to manage complex layouts and integrate seamlessly with other Adobe tools makes it the preferred choice for professional publishers. However, alternatives like Affinity Publisher and QuarkXPress cater to niche audiences and provide viable options for simpler projects.\n\nVerdict:InDesign remains the gold standard for professional publishing, particularly for large-scale and complex projects. Affinity Publisher is a cost-effective alternative for simpler tasks, while QuarkXPress struggles to maintain relevance.\n\nAdobe Express and Canva are both designed for casual creators, offering easy-to-use tools for creating social media graphics, quick designs, and other lightweight projects. These platforms prioritize accessibility and affordability, making them popular choices for non-professional users.\n\nVerdict:Canva remains the preferred choice for most casual users due to its ease of use and popularity. Adobe Express is a strong alternative for those already invested in Adobe’s ecosystem or seeking additional AI-driven features.\n\nFigma’s superior collaboration features and intuitive interface have made it the go-to tool for UX/UI designers.\n\nVerdict:With Adobe stepping back from the UX/UI market, Figma stands unchallenged as the leader in this space.\n\nAdobe Creative Cloud offers a comprehensive suite of professional-grade tools, making it a versatile choice for designers across industries. Its seamless interoperability allows users to transition between applications effortlessly, enhancing productivity and workflow efficiency. However, its subscription-based pricing model can be a significant barrier for casual users or small businesses.\n\nVerdict:Creative Cloud is invaluable for professionals managing diverse, complex projects. For casual users or those with simpler needs, more affordable and straightforward solutions may be a better fit.\n\nMedia Credit:Bring Your Own Laptop\n\nLatest Geeky Gadgets DealsDisclosure:Some of our articles include affiliate links. If you buy something through one of these links, Geeky Gadgets may earn an affiliate commission. Learn about ourDisclosure Policy.",
    "extraction_status": "success"
  },
  "https://www.consumeraffairs.com/medical-alert-systems/unaliwear-kanega-watch.html_UnaliWear Kanega Watch Reviews": {
    "company": "Unaliwear",
    "title": "UnaliWear Kanega Watch Reviews",
    "url": "https://www.consumeraffairs.com/medical-alert-systems/unaliwear-kanega-watch.html",
    "source": "ConsumerAffairs",
    "body": "If any issues come up, UnaliWear will replace the watch for free. The company also covers replacement and shipping at no cost the first time you break the watch. Be aware that UnaliWear does not ...",
    "date": "2025-03-24T00:01:00+00:00",
    "full_content": "Content extraction failed: 403 Client Error: Forbidden for url: https://www.consumeraffairs.com/medical-alert-systems/unaliwear-kanega-watch.html",
    "extraction_status": "success"
  },
  "https://www.marketwatch.com/story/groupe-dynamite-shares-rise-on-4q-beat-rosy-outlook-3d5ac9e1_Groupe Dynamite Shares Rise on 4Q Beat, Rosy Outlook": {
    "company": "Rosy",
    "title": "Groupe Dynamite Shares Rise on 4Q Beat, Rosy Outlook",
    "url": "https://www.marketwatch.com/story/groupe-dynamite-shares-rise-on-4q-beat-rosy-outlook-3d5ac9e1",
    "source": "MarketWatch",
    "body": "Groupe Dynamite shares rose after the company reported better-than-expected revenue and profit in the fourth quarter of what it called a breakthrough year. Shares traded 4.7% higher at 12.12 Canadian dollars ($8.73).",
    "date": "2025-04-15T14:26:00+00:00",
    "full_content": "Content extraction failed: 401 Client Error: HTTP Forbidden for url: https://www.marketwatch.com/story/groupe-dynamite-shares-rise-on-4q-beat-rosy-outlook-3d5ac9e1",
    "extraction_status": "success"
  },
  "https://www.mobihealthnews.com/tag/fort-health_Fort Health": {
    "company": "Fort Health",
    "title": "Fort Health",
    "url": "https://www.mobihealthnews.com/tag/fort-health",
    "source": "MobiHealthNews",
    "body": "New York-based pediatric mental health platform Fort Health announced it is partnering with AI-powered ... the round alongwith new investor Longitude Capital. The Chicago-based company provides video-...",
    "date": "2023-02-08T00:00:00+00:00",
    "full_content": "Content extraction failed: 403 Client Error: Forbidden for url: https://www.mobihealthnews.com/tag/fort-health",
    "extraction_status": "success"
  },
  "https://finance.yahoo.com/news/fort-health-partners-colleva-train-130000158.html_Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care": {
    "company": "Fort Health",
    "title": "Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care",
    "url": "https://finance.yahoo.com/news/fort-health-partners-colleva-train-130000158.html",
    "source": "Yahoo Finance",
    "body": "How it Works Using Fort Health's agentic AI training platform - which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers ...",
    "date": "2025-03-18T09:00:00+00:00",
    "full_content": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\n\nAgentic AI Custom Training Scenarios Result in 83% of Clinicians Feeling More Prepared and 95% Able to Apply What They Have Learned\n\nNEW YORK,March 18, 2025/PRNewswire/ -- The high stakes nature of youth mental health therapy requires thorough preparation and applied evidence-based skills. Today,Fort Health, a specialty outpatient pediatric mental health provider, announced that it has partnered withCollevato train its therapists with AI avatar-led, face-to-face simulations. By providing highly relevant and engaging customized scenarios, Fort Health is able to rapidly upskill its therapists using evidence-based therapeutic protocols, ultimately leading to improved client care and operational efficiency. The initial series of custom training scenarios resulted in 83% of clinicians feeling more prepared and 95% able to apply what they have learned.\n\nAbody of researchfrom the National Institute of Medicine shows that current efforts to train clinicians in empirically-based treatments (EBTs) face significant challenges, as they typically provide only didactic training with no examination of applied skills, follow-up support, or implementation feedback. Studies emphasize the importance of role-play skill practice and ongoing expert guidance to ensure clinicians maintain high fidelity to EBT protocols and deliver effective interventions to patients. Compounded by thebehavioral health care workforce shortage,these limitations underscore the need for innovative training approaches to address challenges in a cost-effective and scalable manner.\n\n\"AI-powered avatar simulations are revolutionizing therapist training by enabling immersive, risk-free practice of critical decision-making and patient interactions,\" saidNatalie Schneider, founding CEO of Fort Health. \"Colleva's AI coaching platform empowers us to design tailored, dynamic scenarios that mirror real-world challenges, providing therapists with hands-on experience in applying evidence-based treatment protocols. By leveraging AI patient avatars, we are transforming mental health training—making it more proactive, personalized, and scalable to meet the growing demand for high-quality care.\"\n\nHow it Works\n\nUsing Fort Health's agentic AI training platform – which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers – therapists conduct realistic role plays with custom avatars and receive personalized feedback to identify areas for improvement and highlight strengths. The series of interactive scenarios are a safe space to practice and develop therapeutic techniques. To help therapists build and demonstrate their proficiency, there are three scenarios representative of the patient population that Fort Health treats. Each of the scenario's avatars have six personalities to choose from, allowing for more realistic and varied practice. Each custom simulation uses generative AI to analyze both content and delivery. Personalized feedback is based on specific EBT objectives and CBT competency frameworks. Therapists are also provided instant feedback on soft skill competencies important to successful therapy outcomes.\n\n\"We are harnessing AI not to replace human therapists, but to make them more effective,\" saidMichael Palys, co-founder and president of Colleva. \"It's been wonderful working in partnership with the Fort Health team as they share our collective vision of using AI role plays and simulations to enhance human skills in areas like mental health where these skills are so critically important to successful patient outcomes. The ability to offer personalized 1:1 feedback at scale is a game changer. My father's own career in psychiatry has made this particular project very special to me, and it's been wonderful to see the excitement among practitioners.\"\n\n\"As a therapist, I know how challenging it can be to translate the professional training we receive into real life interactions with children and families. I also know how uncomfortable and anxiety provoking it can be for a therapist to participate in role plays or live observations. Having a private, safe space to fumble and trip as you sharpen your skill set is a game changer for most therapists,\" saidLindsay Henderson, PsyD, founding clinical director, Fort Health. \"Utilizing AI simulations as a training platform to increase therapist's ability to deliver EBT at a higher fidelity will be key to solving for our nation's youth mental health needs.\"\n\n\"What a unique training opportunity! It allows me to practice and improve my clinical skills in a way I've never before experienced. I love getting immediate feedback which I can implement in real time,\" said Licensed Professional Counselor Catherine Murray.\n\nAbout Fort Health\n\nFounded in 2022, Fort Health is a specialty outpatient pediatric mental health provider. Fort Health transforms how children and adolescents, ages 4-24, receive mental health care by seamlessly partnering with pediatricians to provide evidence-based therapy, psychiatry, and parent coaching – all covered by insurance. Fort Health was built in partnership with the Child Mind Institute, an independent non-profit dedicated to transforming the lives of children and families struggling with mental health, mental illness and learning disorders. The company operates inNew Jersey,New York,Pennsylvania, andTexasandIllinois. VisitFort Healthon our website and onLinkedIn.\n\nAbout Colleva\n\nFounded in 2023, Colleva is an AI-powered enterprise talent platform that can help professionals enhance both hard and soft skills through personalized, scalable 1:1 feedback. Using AI avatars to provide AI roleplay and simulation-based training, Colleva provides immersive practice environments where professionals master critical interactions with immediate feedback. Colleva offers solutions across talent acquisition, onboarding, learning & development, performance management, and employee insights for organizations within healthcare, financial services, as well as other sectors. Headquartered inGreenwich, Connecticut, Colleva is transforming workforces through innovative AI solutions. Visit Colleva on our website and on LinkedIn.\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role-playing-practice-and-scalable-client-care-302402020.html\n\nSOURCE Fort Health",
    "extraction_status": "success"
  },
  "https://www.essence.com/news/doulas-postpartum-black-maternal-health-week/_A Black Doula Shares Her Story Of Founding BelliBind, A Company That Helps New Moms In Their Fourth Trimester": {
    "company": "Partum Health",
    "title": "A Black Doula Shares Her Story Of Founding BelliBind, A Company That Helps New Moms In Their Fourth Trimester",
    "url": "https://www.essence.com/news/doulas-postpartum-black-maternal-health-week/",
    "source": "Essence",
    "body": "This Black Maternal Health Week, the founder spoke with ESSENCE to discuss everything postpartum so that we can ensure that Black moms stay safe and healthy after giving birth. \"The statistics ...",
    "date": "2025-04-12T00:00:00+00:00",
    "full_content": "Did you know that after giving birth, many “women are sent home and not seen by their care provider again until six weeks”later? But the reality is,maternal caredoesn’t end withchildbirth—and this is why the concept of the “fourth trimester” was devised.\n\nFor Black women, this time period is especially critical. As Blacknurse-midwifeKaren Sheffield-Abdullah PhD, RN, CNM notes, “We are so baby-focused…Once the baby is here, it’s almost like the mother is discarded. Like a Reese’s Peanut Butter Cup. The mom is the wrapper, and the baby is the candy. Once you remove the wrapper, you just discard the wrapper. And what we really need to be thinking about is that fourth trimester, that time after the baby is born.”\n\nOne Black woman is trying to ensure that the mother isn’t discarded during this process. Princess Estocia McKinney-Kirk has over a decade of experience as adoula, and unfortunately experienced this firsthand. When she gave birth to her first baby, McKinney-Kirk discovered that “her own needs were not met during…postpartum recovery.” As sheexplained, “there was no one I could hire to provide such care for me (not without having to hire three separate people at least),” and thus BelliBind was born.\n\nMcKinney-Kirk saysBelliBind“was created to fill the void in current post birth recovery support.” BelliBind offers this type of “specialized postpartum care of traditional Bengkung belly binding coupled with body rubs, meditations & fitness guidance,” recovery planning,coaching, and stress relief. This Black Maternal Health Week, the founder spoke with ESSENCE to discuss everything postpartum so that we can ensure that Black moms stay safe and healthy after giving birth.\n\n“The statistics on Black maternal health post-birth are stark: Black mothers experience significantly higher rates of postpartum complications and maternal mortality compared to their white counterparts,” McKinney-Kirk told ESSENCE.\n\nAccording to data from theCenters for Disease Control and Prevention(CDC), “a staggering 84% of pregnancy-related deaths were deemed preventable.” Alarmingly, “53% of the deaths occurred well after women left the hospital, between seven days and a year after delivery.”\n\nBut “Black maternal health is more than just a statistic—it’s a call to action for comprehensive postpartum support,” continued McKinney-Kirk. “The fourth trimester is a critical chapter often overlooked. Let’s rewrite this narrative by offering Black mothers the support they deserve—nurturing their bodies, uplifting their spirits, and safeguarding their well-being. Together, we can redefine postpartum care as a beacon of empowerment and resilience.”\n\n“In the face of this crisis, it’s imperative to prioritize accessible, individualized care solutions for Black mothers during the fourth trimester. Bellibind, as a Black mom-owned brand, is making a meaningful difference by addressing these disparities head-on,” McKinney-Kirk added. “By providing accessible, personalized postpartum support, Bellibind is working towards a future where every Black mother receives the care and resources necessary to navigate the postpartum period with dignity and resilience.”\n\n“Through our approach, we’re ensuring that every Black mother emerges from the postpartum period feeling empowered, supported, and cherished,” McKinney-Kirk emphasized. “It’s time for Black mothers to receive the care they need to thrive postpartum. Let’s stand together to ensure every Black mother emerges from this journey with strength, dignity, and optimal well-being.”",
    "extraction_status": "success"
  },
  "https://www.sciencedaily.com/releases/2025/04/250404201325.htm_Best methods for growing Atlantic sea scallops": {
    "company": "Atlantic Sea Farms",
    "title": "Best methods for growing Atlantic sea scallops",
    "url": "https://www.sciencedaily.com/releases/2025/04/250404201325.htm",
    "source": "Science Daily",
    "body": "A new study compares two scallop farming methods, ear-hanging and lantern net culture, over a complete grow-out cycle to determine which approach yields the best results for commercial growers. The study found that scallops grown with ear-hanging culture had slightly larger shell heights,",
    "date": "2025-04-05T02:32:00+00:00",
    "full_content": "A new study from the University of Maine's Aquaculture Research Institute (ARI) and Darling Marine Center is helping to refine best practices for growing Atlantic sea scallops (Placopecten magellanicus), a species of increasing interest to Maine's aquaculture sector.\n\nPublished in the academic journalAquaculture, the research compares two scallop farming methods, ear-hanging and lantern net culture, over a complete grow-out cycle to determine which approach yields the best results for commercial growers. The study, led by UMaine postdoctoral researcher Christopher Noren, provides new insights into how each method influences scallop size and adductor muscle weight, a key factor in market value.\n\nEvaluating Two Common Farming Methods\n\nMaine's scallop aquaculture industry is still in its early stages, and growers are looking for efficient ways to scale up production. Suspended culture is the most common approach, with farmers typically using multi-tiered lantern nets to grow scallops to a harvestable size. However, this method requires frequent maintenance to manage biofouling -- an unwanted accumulation of microorganisms, plants and animals -- and to optimize growth conditions.\n\nEar-hanging, a technique adapted from Japanese scallop farming, offers a potential alternative. This method involves drilling a small hole in the scallop's shell and suspending it on a line, allowing for better water flow and potentially reducing maintenance needs.\n\nTo evaluate the effectiveness of each method, researchers partnered with two commercial scallop farms in Maine's Penobscot Bay and Frenchman Bay. Over four years, they measured scallop growth and the weight of their adductor muscles, the primary product from scallops that are sold in U.S. seafood markets.\n\nFindings to inform Maine's aquaculture industry\n\nThe study found that scallops grown with ear-hanging culture had slightly larger shell heights, about 1-4% greater than those in lantern nets. More significantly, ear-hanging scallops had up to 12% more adductor muscle weight, which is the primary product sold in U.S. seafood markets and commands a higher price per pound when larger. This suggests a potential advantage for growers aiming to maximize profitability within that market.\n\n\"We wanted to provide growers with data they could actually use on the water,\" said Christopher Noren, doctoral researcher at UMaine and lead author of the study. \"By comparing these two methods across a full grow-out cycle, we were able to identify where the biological advantages lie and how they might translate to better yields and more efficient operations.\"\n\nThe results also highlight the role of temperature in scallop growth. Ear-hanging scallops grew more quickly in optimal conditions, which are between 50 and 59 degrees Farhenheit, but were more affected by colder winter temperatures than those in lantern nets.\n\n\"These findings give scallop farmers a clearer picture of how different methods impact growth and harvest timing. Understanding the trade-offs between techniques will help inform decisions about production strategies.\" says co-author Damian Brady, a professor of oceanography at UMaine.\n\nSupporting a sustainable, domestic seafood supply\n\nThe U.S. imports the majority of its seafood, including scallops, from foreign markets. As interest in domestic scallop aquaculture grows, studies like this can help Maine farmers refine their operations and improve profitability.\n\n\"This research gives us real-world numbers to work with,\" said Andrew Peters, owner of Vertical Bay LLC and co-author on the study. \"Understanding how small changes in gear choice impact growth and market value helps us make smarter decisions as we scale up scallop farming in Maine.\"\n\nBy identifying methods that balance growth efficiency with labor demands, UMaine researchers are contributing to the development of a sustainable scallop aquaculture industry in the Gulf of Maine.\n\nStory Source:\n\nMaterialsprovided byUniversity of Maine.Note: Content may be edited for style and length.\n\nJournal Reference:\n\nCite This Page:",
    "extraction_status": "success"
  },
  "https://www.victoriaadvocate.com/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role/article_1aabcc2c-daf6-58b1-a558-b960053187f5.html_Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care": {
    "company": "Fort Health",
    "title": "Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care",
    "url": "https://www.victoriaadvocate.com/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role/article_1aabcc2c-daf6-58b1-a558-b960053187f5.html",
    "source": "The Victoria Advocate",
    "body": "co-founder and president of Colleva. \"It's been wonderful working in partnership with the Fort Health team as they share our collective vision of using AI role plays and simulations to enhance ...",
    "date": "2025-03-18T00:00:00+00:00",
    "full_content": "Opening more paths to better care for more families and their children (PRNewsfoto/Fort Health)\n\nAgentic AI Custom Training Scenarios Result in 83% of Clinicians Feeling More Prepared and 95% Able to Apply What They Have Learned\n\nNEW YORK,March 18, 2025/PRNewswire/ -- The high stakes nature of youth mental health therapy requires thorough preparation and applied evidence-based skills. Today,Fort Health, a specialty outpatient pediatric mental health provider, announced that it has partnered withCollevato train its therapists with AI avatar-led, face-to-face simulations. By providing highly relevant and engaging customized scenarios, Fort Health is able to rapidly upskill its therapists using evidence-based therapeutic protocols, ultimately leading to improved client care and operational efficiency. The initial series of custom training scenarios resulted in 83% of clinicians feeling more prepared and 95% able to apply what they have learned.\n\nAbody of researchfrom the National Institute of Medicine shows that current efforts to train clinicians in empirically-based treatments (EBTs) face significant challenges, as they typically provide only didactic training with no examination of applied skills, follow-up support, or implementation feedback. Studies emphasize the importance of role-play skill practice and ongoing expert guidance to ensure clinicians maintain high fidelity to EBT protocols and deliver effective interventions to patients. Compounded by thebehavioral health care workforce shortage,these limitations underscore the need for innovative training approaches to address challenges in a cost-effective and scalable manner.\n\n\"AI-powered avatar simulations are revolutionizing therapist training by enabling immersive, risk-free practice of critical decision-making and patient interactions,\" saidNatalie Schneider, founding CEO of Fort Health. \"Colleva's AI coaching platform empowers us to design tailored, dynamic scenarios that mirror real-world challenges, providing therapists with hands-on experience in applying evidence-based treatment protocols. By leveraging AI patient avatars, we are transforming mental health training—making it more proactive, personalized, and scalable to meet the growing demand for high-quality care.\"\n\nHow it Works\n\nUsing Fort Health's agentic AI training platform – which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers – therapists conduct realistic role plays with custom avatars and receive personalized feedback to identify areas for improvement and highlight strengths. The series of interactive scenarios are a safe space to practice and develop therapeutic techniques. To help therapists build and demonstrate their proficiency, there are three scenarios representative of the patient population that Fort Health treats. Each of the scenario's avatars have six personalities to choose from, allowing for more realistic and varied practice. Each custom simulation uses generative AI to analyze both content and delivery. Personalized feedback is based on specific EBT objectives and CBT competency frameworks. Therapists are also provided instant feedback on soft skill competencies important to successful therapy outcomes.\n\n\"We are harnessing AI not to replace human therapists, but to make them more effective,\" saidMichael Palys, co-founder and president of Colleva. \"It's been wonderful working in partnership with the Fort Health team as they share our collective vision of using AI role plays and simulations to enhance human skills in areas like mental health where these skills are so critically important to successful patient outcomes. The ability to offer personalized 1:1 feedback at scale is a game changer. My father's own career in psychiatry has made this particular project very special to me, and it's been wonderful to see the excitement among practitioners.\"\n\n\"As a therapist, I know how challenging it can be to translate the professional training we receive into real life interactions with children and families. I also know how uncomfortable and anxiety provoking it can be for a therapist to participate in role plays or live observations. Having a private, safe space to fumble and trip as you sharpen your skill set is a game changer for most therapists,\" saidLindsay Henderson, PsyD, founding clinical director, Fort Health. \"Utilizing AI simulations as a training platform to increase therapist's ability to deliver EBT at a higher fidelity will be key to solving for our nation's youth mental health needs.\"\n\n\"What a unique training opportunity! It allows me to practice and improve my clinical skills in a way I've never before experienced. I love getting immediate feedback which I can implement in real time,\" said Licensed Professional Counselor Catherine Murray.\n\nAbout Fort Health\n\nFounded in 2022, Fort Health is a specialty outpatient pediatric mental health provider. Fort Health transforms how children and adolescents, ages 4-24, receive mental health care by seamlessly partnering with pediatricians to provide evidence-based therapy, psychiatry, and parent coaching – all covered by insurance. Fort Health was built in partnership with the Child Mind Institute, an independent non-profit dedicated to transforming the lives of children and families struggling with mental health, mental illness and learning disorders. The company operates inNew Jersey,New York,Pennsylvania, andTexasandIllinois. VisitFort Healthon our website and onLinkedIn.\n\nAbout Colleva\n\nFounded in 2023, Colleva is an AI-powered enterprise talent platform that can help professionals enhance both hard and soft skills through personalized, scalable 1:1 feedback. Using AI avatars to provide AI roleplay and simulation-based training, Colleva provides immersive practice environments where professionals master critical interactions with immediate feedback. Colleva offers solutions across talent acquisition, onboarding, learning & development, performance management, and employee insights for organizations within healthcare, financial services, as well as other sectors. Headquartered inGreenwich, Connecticut, Colleva is transforming workforces through innovative AI solutions. Visit Colleva on our website and on LinkedIn.\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role-playing-practice-and-scalable-client-care-302402020.html\n\nSOURCE Fort Health\n\nOriginally published on theBLOX Digital Content Exchange.",
    "extraction_status": "success"
  },
  "https://finance.yahoo.com/news/hc1-unveils-hercare-safeguard-maternal-120000536.html_hc1 Unveils HerCare to Safeguard Maternal Health": {
    "company": "Partum Health",
    "title": "hc1 Unveils HerCare to Safeguard Maternal Health",
    "url": "https://finance.yahoo.com/news/hc1-unveils-hercare-safeguard-maternal-120000536.html",
    "source": "Yahoo Finance",
    "body": "INDIANAPOLIS, April 15, 2025--hc1 today announced the launch of HerCare, an industry-first module within its MyBloodHealth platform designed to safeguard maternal health by identifying and addressing health risks associated with anemia in pregnancy.",
    "date": "2025-04-15T12:01:00+00:00",
    "full_content": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\n\nNew MyBloodHealth module provides real-time insights to prevent severe complications during pregnancy and improve maternal care outcomes\n\nINDIANAPOLIS, April 15, 2025--(BUSINESS WIRE)--hc1today announced the launch of HerCare, an industry-first module within its MyBloodHealth platform designed to safeguard maternal health by identifying and addressing health risks associated with anemia in pregnancy. HerCare reflects the company’s commitment to technology that reveals vital health insights hidden in lab data, including those to enhance women's health and beyond.\n\nAnemia in pregnancy is a common, yet preventable risk factor that is associated with complications such as post-partum depression, preeclampsia, and pre-term birth. Severe cases can lead to severe bleeding and high blood pressure disorders that pose significant risks during childbirth. Through hc1’s HerCare, obstetrics teams can analyze lab biomarkers and clinical data in real time to provide clinicians with actionable insights that prevent serious anemia issues before they become critical.\n\n\"At hc1, we are committed to improving women’s care, and our team created HerCare to prevent complications during and after pregnancy,\" said hc1 CEO, Founder, and Chairman Bradley Bostic. \"HerCare identifies insights in lab data to proactively treat expectant mothers who have anemia, a critical risk factor in pregnancy. By leveraging our MyBloodHealth platform, hc1 is collaborating with leading healthcare organizations to close this critical gap in obstetric care by giving clinicians the tools they need to make informed, often life-saving decisions.\"\n\nhc1 is rolling out HerCare to current MyBloodHealth customers on a limited basis. The company will offer HerCare more widely to hospital systems and obstetrics practices in late 2025.\n\nHerCare aims to reduce preventable complications by:\n\nEarly Risk Detection:Identifying patients at risk through real-time monitoring of lab results and clinical data.\n\nPersonalized Care:Offering tailored insights to guide decisions that enhance patient safety.\n\nClinical Decision Support:Assisting healthcare providers with data-driven recommendations for timely interventions.\n\nFor more information about HerCare and MyBloodHealth, visitwww.hc1.com.\n\nAbout hc1\n\nhc1 unlocks the vast potential of actionable lab data to improve patient care and boost the financial performance of the healthcare system. By partnering with hc1, health systems gain profitable new growth and improve patient outcomes. Our solutions use advanced data management, analytics, and workflow automation powered by AI to uncover actionable insights and hidden risk signals, delivering innovation, operational and clinical excellence, and revenue growth across the entire care continuum. With over a decade of experience and thousands of health systems and labs leveraging our technology and consultative services to care for nearly 100 million patients, we provide the expertise needed to unlock the strategic value of your lab data, improving patient outcomes and boosting financial performance. Healthcare Progress Starts Here.™ With hc1. Learn more about our proven approach atwww.hc1.com\n\nView source version on businesswire.com:https://www.businesswire.com/news/home/20250415962181/en/\n\nContacts\n\nFor media inquiries, please contact:Alexis FeinbergVice President, ICR HealthcareAlexis.feinberg@icrhealthcare.com",
    "extraction_status": "success"
  },
  "https://www.healthline.com/nutrition/needed-reviews_Needed Reviews: Are these Pre and Postnatal Supplements Effective?": {
    "company": "Partum Health",
    "title": "Needed Reviews: Are these Pre and Postnatal Supplements Effective?",
    "url": "https://www.healthline.com/nutrition/needed-reviews",
    "source": "Healthline",
    "body": "Needed provides supplements to support fertility, pregnancy, and postpartum health. Find out about the ... doesn't regulate supplements, the company states that it manufactures its products ...",
    "date": "2025-03-28T00:00:00+00:00",
    "full_content": "Needed provides supplements to support fertility, pregnancy, and postpartum health. Find out about the brand and what our editors thought of Needed supplements.\n\nIt’s no secret that fertility, pregnancy, and postpartum come with a lot of physical, emotional, and hormonal changes. Pregnant people and those trying for a baby may have to adapt their nutrition intake to support a healthy pregnancy. Good nutrition is essential for feeling your best during these life stages and ensures you and your baby get everything you need.\n\nA2021 reviewstates that most women in the United States don’t meet the current recommendations for good nutrition before and during pregnancy. This is where Needed may support with supplements focused on improving nutrition for better fertility, a healthy pregnancy, and a balanced postpartum experience.\n\nNeeded is asupplementsbrand that works to improve nutrition before, during, and after pregnancy.\n\nWhile the Food and Drug Administration (FDA) doesn’t regulate supplements, the company states that it manufactures its products in accordance with the FDA’s current Good Manufacturing Practices (CGMPs) to help ensure the quality and safety of its supplements.\n\nNeeded aims to provide high quality nutrition options to support women and families. According to the company, it has a group of over 6,000 practitioners, such as OB-GYNs, dietitians, and more, who help inform their efforts and formulate the ingredients.\n\nThe brand offers a hugerange of nutritionsupplements, from prenatal probiotics to egg quality support, collagen, and more. It also has set bundles to target specific issues, such as:\n\nNeeded says that it will provide subscribers with direct access to a nutritionist.\n\nThe company states that it’s also a certified B Corp and Certified Climate Neutral to minimize the impact on the planet.\n\nCustomer reviews are mostly positive for Needed. People often praise clean ingredients and how the products are gentle on their stomachs.\n\nWhile the brand offers some multi-nutrient options, it mostly provides several individual supplements to reach your nutrition goals. For some people, this might make Needed more expensive than brands that sell a multivitamin. However, Needed suggests that taking some nutrients separately can be more effective.\n\nNeeded may be a suitable option for people looking for nutrition support for fertility, pregnancy, and beyond. The company third-party tests all its products and claims that these tests look at:\n\nNeeded may be a suitable option for people looking for nutrition support for fertility, pregnancy, and beyond. The company third-party tests all its products and claims that these tests look at:\n\nNeeded and Ritual are both popular supplement brands. Needed products are designed specifically for fertility, pregnancy, and postpartum. Ritual offers a variety of supplements for pregnancy, gut health, brain health, and more. The best brand may depend on your unique situation, including which nutrients you need.\n\nNeeded and Ritual are both popular supplement brands. Needed products are designed specifically for fertility, pregnancy, and postpartum. Ritual offers a variety of supplements for pregnancy, gut health, brain health, and more. The best brand may depend on your unique situation, including which nutrients you need.\n\nYes, all of Needed’s supplements are third-party tested.\n\nYes, all of Needed’s supplements are third-party tested.\n\nNeeded is a supplement brand that provides nutrition support before, during, and after pregnancy. Their focus is on creating products with clean ingredients that absorb well together.\n\nThe brand offers a wide variety of supplements to suit individual needs. It also offers bundles to get people started.\n\nIt’s always best to consult a medical professional before introducing new supplements to your nutrition regimen, as everyone has different nutritional needs.",
    "extraction_status": "success"
  }
}