{
  "https://www.consumeraffairs.com/medical-alert-systems/unaliwear-kanega-watch.html_UnaliWear Kanega Watch Reviews": {
    "company": "Unaliwear",
    "title": "UnaliWear Kanega Watch Reviews",
    "url": "https://www.consumeraffairs.com/medical-alert-systems/unaliwear-kanega-watch.html",
    "source": "ConsumerAffairs",
    "body": "If any issues come up, UnaliWear will replace the watch for free. The company also covers replacement and shipping at no cost the first time you break the watch. Be aware that UnaliWear does not ...",
    "date": "2025-03-24",
    "full_content": "Our Buyers Guide Top Picks\n\nThe UnaliWear Kanega Watch is a more discreet alternative to traditional medical alert devices. The watch weighs 49 grams (about 1.7 ounces). It’s 1.6 inches in diameter and 0.5 inches thick. It comes with a patented quick-swap battery, so you never have to take it off to charge.\n\nThe UnaliWear Kanega Watch is a stand-alone personal emergency response device, so you don’t need a landline or cellphone to make it work. Instead, it relies on Verizon’s nationwide cellular network. The watch connects to your home Wi-Fi but automatically switches to Verizon’s network when you leave your home.\n\nYou can call for help in multiple ways. If you press and hold the button on the right side of the watch (called the crown button) for a couple of seconds, you’ll be connected to the monitoring center. These trained professionals have your contact information and the names of your caregivers and know exactly whom to notify and where to dispatch help.\n\nYou can also use voice commands through the watch’s built-in microphone. Finally, if you fall, the watch automatically detects the unusual movement and notifies the monitors.\n\nUnaliWear offers two different pricing structures for the Kanega Watch. You can make an upfront payment for the whole year, or you can pay monthly from the start. No matter how you pay, you have a one-time setup fee.\n\nAs of publishing, if you choose to pay monthly from the start, your one-time setup fee is $299. Then, you’ll pay $69.95 a month for monitoring services.\n\nThere’s no contract with either payment structure, so you can cancel the service anytime. But note that the watch and the accessories aren’t yours to keep. You have to return everything in good condition if you cancel the monitoring service.\n\nDesigned with an older user in mind, the UnaliWear Kanega Watch has many features to help improve independence, including:\n\nCompare UnaliWear with othermedical alert companies.\n\nThe company name comes from the Cherokee words “Unalii,” which means friend, and “Kanega,” which means speak. When you put them together, you have a friend who speaks to you.\n\nUnaliWear covers defects in materials and workmanship for as long as you have it, as long as you are current on your service payments. If any issues come up, UnaliWear will replace the watch for free.\n\nThe company also covers replacement and shipping at no cost the first time you break the watch. Be aware that UnaliWear does not cover replacement of a watch in all circumstances.\n\nAfter 30 days, you can cancel the service at any time as long as you return all equipment. You’ll get a refund (minus a $75 restocking fee) if all equipment is returned in good condition. Annual plans will be issued a prorated refund based on the nondiscounted monthly rate of $69.95.\n\nTo cancel your monitoring service through UnaliWear, you need to call the company’s customer support team. As a part of the cancellation, you must send the equipment back in good condition. A lost or damaged watch results in a fee of up to $650.\n\nThe company’s headquarters is in Austin, Texas.\n\nUnaliWear helps vulnerable people enjoy more independence through its medical alert technology. The stylish Kanega Watch includes 24/7 U.S.-based monitoring, fall detection, medication reminders and a 30-day money-back guarantee. Since the watch uses Wi-Fi and LTE technologies, wearers don’t need a landline to access help. In addition, UnaliWear doesn’t require a long-term contract.\n\nShop with confidence\n\nCompare with top companies\n\nFilter by Rating\n\nPopular Mentions\n\nA link has directed you to this review. Its location on this page may change next time you visit.\n\nReviewed Sept. 17, 2024\n\nThe Kanega Watch has been a lifesaver for my grandma (and mom!). My grandma lives independently and is able to continue to do so because the Kanega provides round the clock coverage in the case of an emergency. And even better, my mom can rest easy, knowing she's safe. We chose the Kanega because the 24/7 monitoring service already knows who she is when an alert comes from the watch. After doing so much research online, we found that the Kanega's coverage and service was far superior to others on the market. Totally worth the price!\n\nReviewed March 12, 2024\n\nI bought this watch for my mother in December 2023. Two months later the screen went blank and it was not usable. I made several calls and wrote emails to the company's customer service department. The calls repeatedly were answered by the \"overflow\" service department, which was not qualified to actually troubleshoot problems. After a week of no response on how to fix the watch, I returned it. If you want a watch that detects falls and will notify emergency services, I would suggest an Apple Watch. The Apple Watch does everything the Kanega does and more, and it costs less.\n\nThanks for subscribing.\n\nYou have successfully subscribed to our newsletter! Enjoy reading our tips and recommendations.\n\nReviewed Feb. 17, 2024\n\nThe watch band was too large even though the wrist measured within the range for small. And the watch was heavy, too heavy for a small person to sleep when wearing. This may work better for larger folks, but if you're small, I would not recommend it. The $75 return fee is very steep and you need to go through customer service, which tries and tries to change your mind, to return it.\n\nReviewed Nov. 15, 2023\n\nWe got the Kanega Watch for my father several years ago. He loves it and he wears it all the time, which is the total point. The fall detection has worked as advertised, and he enjoys asking his watch for the time and date. Tremendous peace of mind for him and our whole family. I highly recommend!\n\nReviewed Oct. 22, 2023\n\nI purchased the watch on 9/6/2023, I received it around 9/11/2023. I lost a battery out of it on 10/2/2023, I had no idea how I lost it. Now on 10/22/2023 the watch band has broken where it attaches with the battery to watch. Very unhappy with the construction as I bought a battery for about $36 plus shipping about 3 weeks after purchase and now about 6 weeks later it is broken. I am emailing the company today to see what they will do about this situation. I paid $918.40. I would expect a better quality.\n\nReviewed Sept. 16, 2023\n\nThe service is great. There is very little set up and it is very easy to do. Once we received the watch there were 3 very short videos to watch and then you call the center and they do a test call with you. My Aunt loves the device because it isn't a pendant that gets in the way, flops around or looks out of place when she dresses up and goes out. She also likes the fact that she never has to take it off and can wear it in the shower.\n\nOur only complaint is that after only 3 months the first watch band broke where the battery goes in. We didn't realize it cracked and one battery was lost and then the band broke all together. I believe that a more rubberized battery chamber would be a better housing for the battery. The other disappointment was we had to pay $50 for shipping for a new watch. This seems a bit steep. We haven't found anything better at this time but the shipping cost did cause the luster of this product to dull somewhat.\n\nCheck out our buyers guide top picks\n\nOur Buyers Guide Top Picks:",
    "extraction_status": "success"
  },
  "https://finance.yahoo.com/news/fort-health-partners-colleva-train-130000158.html_Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care": {
    "company": "Fort Health",
    "title": "Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care",
    "url": "https://finance.yahoo.com/news/fort-health-partners-colleva-train-130000158.html",
    "source": "Yahoo Finance",
    "body": "How it Works Using Fort Health's agentic AI training platform - which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers ...",
    "date": "2025-03-18",
    "full_content": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\n\nAgentic AI Custom Training Scenarios Result in 83% of Clinicians Feeling More Prepared and 95% Able to Apply What They Have Learned\n\nNEW YORK,March 18, 2025/PRNewswire/ -- The high stakes nature of youth mental health therapy requires thorough preparation and applied evidence-based skills. Today,Fort Health, a specialty outpatient pediatric mental health provider, announced that it has partnered withCollevato train its therapists with AI avatar-led, face-to-face simulations. By providing highly relevant and engaging customized scenarios, Fort Health is able to rapidly upskill its therapists using evidence-based therapeutic protocols, ultimately leading to improved client care and operational efficiency. The initial series of custom training scenarios resulted in 83% of clinicians feeling more prepared and 95% able to apply what they have learned.\n\nAbody of researchfrom the National Institute of Medicine shows that current efforts to train clinicians in empirically-based treatments (EBTs) face significant challenges, as they typically provide only didactic training with no examination of applied skills, follow-up support, or implementation feedback. Studies emphasize the importance of role-play skill practice and ongoing expert guidance to ensure clinicians maintain high fidelity to EBT protocols and deliver effective interventions to patients. Compounded by thebehavioral health care workforce shortage,these limitations underscore the need for innovative training approaches to address challenges in a cost-effective and scalable manner.\n\n\"AI-powered avatar simulations are revolutionizing therapist training by enabling immersive, risk-free practice of critical decision-making and patient interactions,\" saidNatalie Schneider, founding CEO of Fort Health. \"Colleva's AI coaching platform empowers us to design tailored, dynamic scenarios that mirror real-world challenges, providing therapists with hands-on experience in applying evidence-based treatment protocols. By leveraging AI patient avatars, we are transforming mental health training—making it more proactive, personalized, and scalable to meet the growing demand for high-quality care.\"\n\nHow it Works\n\nUsing Fort Health's agentic AI training platform – which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers – therapists conduct realistic role plays with custom avatars and receive personalized feedback to identify areas for improvement and highlight strengths. The series of interactive scenarios are a safe space to practice and develop therapeutic techniques. To help therapists build and demonstrate their proficiency, there are three scenarios representative of the patient population that Fort Health treats. Each of the scenario's avatars have six personalities to choose from, allowing for more realistic and varied practice. Each custom simulation uses generative AI to analyze both content and delivery. Personalized feedback is based on specific EBT objectives and CBT competency frameworks. Therapists are also provided instant feedback on soft skill competencies important to successful therapy outcomes.\n\n\"We are harnessing AI not to replace human therapists, but to make them more effective,\" saidMichael Palys, co-founder and president of Colleva. \"It's been wonderful working in partnership with the Fort Health team as they share our collective vision of using AI role plays and simulations to enhance human skills in areas like mental health where these skills are so critically important to successful patient outcomes. The ability to offer personalized 1:1 feedback at scale is a game changer. My father's own career in psychiatry has made this particular project very special to me, and it's been wonderful to see the excitement among practitioners.\"\n\n\"As a therapist, I know how challenging it can be to translate the professional training we receive into real life interactions with children and families. I also know how uncomfortable and anxiety provoking it can be for a therapist to participate in role plays or live observations. Having a private, safe space to fumble and trip as you sharpen your skill set is a game changer for most therapists,\" saidLindsay Henderson, PsyD, founding clinical director, Fort Health. \"Utilizing AI simulations as a training platform to increase therapist's ability to deliver EBT at a higher fidelity will be key to solving for our nation's youth mental health needs.\"\n\n\"What a unique training opportunity! It allows me to practice and improve my clinical skills in a way I've never before experienced. I love getting immediate feedback which I can implement in real time,\" said Licensed Professional Counselor Catherine Murray.\n\nAbout Fort Health\n\nFounded in 2022, Fort Health is a specialty outpatient pediatric mental health provider. Fort Health transforms how children and adolescents, ages 4-24, receive mental health care by seamlessly partnering with pediatricians to provide evidence-based therapy, psychiatry, and parent coaching – all covered by insurance. Fort Health was built in partnership with the Child Mind Institute, an independent non-profit dedicated to transforming the lives of children and families struggling with mental health, mental illness and learning disorders. The company operates inNew Jersey,New York,Pennsylvania, andTexasandIllinois. VisitFort Healthon our website and onLinkedIn.\n\nAbout Colleva\n\nFounded in 2023, Colleva is an AI-powered enterprise talent platform that can help professionals enhance both hard and soft skills through personalized, scalable 1:1 feedback. Using AI avatars to provide AI roleplay and simulation-based training, Colleva provides immersive practice environments where professionals master critical interactions with immediate feedback. Colleva offers solutions across talent acquisition, onboarding, learning & development, performance management, and employee insights for organizations within healthcare, financial services, as well as other sectors. Headquartered inGreenwich, Connecticut, Colleva is transforming workforces through innovative AI solutions. Visit Colleva on our website and on LinkedIn.\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role-playing-practice-and-scalable-client-care-302402020.html\n\nSOURCE Fort Health",
    "extraction_status": "success"
  },
  "https://pharmaphorum.com/news/healthee-heads-latest-crop-digital-health-financings_Healthee heads latest crop of digital health financings": {
    "company": "BrainCheck",
    "title": "Healthee heads latest crop of digital health financings",
    "url": "https://pharmaphorum.com/news/healthee-heads-latest-crop-digital-health-financings",
    "source": "pharmaphorum",
    "body": "BrainCheck has raised $15 million that will ... according to the Austin, Texas-based company, which said it would help accelerate the rollout of the new version. Finally, analytics company Redi ...",
    "date": "2025-03-26",
    "full_content": "Our latest round-up of funding rounds in the digital health category features updates from Healthee, Aktiia, Moxe Health, Eleanor Health, Tava Health, BrainCheck, and Redi Health.\n\nHealtheehas raised $32 million in a Series A that will be used to scale up its operations, which are focused on a platform that provides a digital conduit between employees and their health plans. It answers questions about coverage, treatment, and benefits, provides advice on preventative care, and helps employers with the enrolment process.\n\nThe round was co-led by Fin Capital, Glilot Capital Partners, and Group11, with strategic partner TriNet also taking part. It will also be used for product development, according to the Israeli company, which was formed in 2018.\n\nSwitzerland’sAktiiahas raised CHF 27 million ($30 million) from investors including Redalpine and Khosla Ventures for the rollout and development of its wearable wristband device, which uses photoplethysmography technology to provide continuous blood pressure monitoring over a 24-hour period by detecting blood volume changes in small blood vessels.\n\nThe device is already approved in 44 countries and available in Switzerland, Germany, France, Austria, Italy, the UK, and the Republic of Ireland, and have been used in more than 60,000 patients. Aktiia will use the new funding in part to fund an expansion into the US market.\n\nHealthcare data exchange specialistMoxe Healthhas raised $25 million from investor Trinity Capital to support the development of its technology platform, used for the secure exchange of clinical and other sensitive data between healthcare payers and providers.\n\nIt is designed to provide a solution to the current problem of health data being in different formats and silos, with the aim of reducing administrative waste, relieving pressure on healthcare staff, eliminating duplicative efforts, and ultimately lowering costs. The latest cash infusion follows a $30 million second round in 2022 and a $5.5 million Series A for the Madison, Wisconsin-based company.\n\nEleanor Health, a company providing digital and face-to-face support for people struggling with substance use disorders (SUDs) and their families, has raised $22 million in an equity raise, according to a filing with the Securities and Exchange Commission (SEC).\n\nThe Massachusetts-based start-up – which recently saw founding CEO Corbin Petro step down and be replaced by William McKinney – offers personalised addiction treatment either virtually or in person through a series of clinics in six US states. The latest round comes after it raised $50 million in Series C funding in 2022 and takes the total raised to date above the $100 million mark.\n\nNew York-basedTava Healthhas closed a $20 million Series B led by Catalyst Investors and featuring existing investors Peterson Partners, Toba Capital, and SpringTide, along with new backer Blue Heron Capital.\n\nThe company provides a telemedicine platform focused on mental health, connecting patients to therapists and supporting healthcare providers with practice management software, electronic medical records, and interactions with employers and health insurance companies. It said the new money would be used for product development, expansion of its provider network, and fostering new agreements with payers.\n\nBrainCheckhas raised $15 million that will be used to fuel the expansion and take-up of a recently launched update to its BrainCheck Screen digital cognitive assessment and care planning software for people with dementia. The app allows testing to be carried out on any internet-connect device and delivers an initial assessment in three minutes.\n\nThe financing round was led by Next Coast Ventures, S3 Ventures, and UPMC Enterprises, according to the Austin, Texas-based company, which said it would help accelerate the rollout of the new version.\n\nFinally, analytics companyRedi Healthhas closed a $14 million second round led by Blue Heron Capital that will be used to develop and expand its digital patient support programme (PSP) for people suffering from chronic health conditions.\n\nThe Columbus, Ohio start-up provides a number of services to its customers, including an app that tracks medications, symptoms, diet, and weight, and allows them to communicate and share progress with healthcare providers and link to other pertinent organisations, like drugmakers, pharmacies, and payers. It was founded in 2022, raising just under $4 million in a first round in 2022.",
    "extraction_status": "success"
  },
  "https://www.victoriaadvocate.com/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role/article_1aabcc2c-daf6-58b1-a558-b960053187f5.html_Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care": {
    "company": "Fort Health",
    "title": "Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care",
    "url": "https://www.victoriaadvocate.com/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role/article_1aabcc2c-daf6-58b1-a558-b960053187f5.html",
    "source": "The Victoria Advocate",
    "body": "Using Fort Health's agentic AI training platform - which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers - therapists ...",
    "date": "2025-03-18",
    "full_content": "Opening more paths to better care for more families and their children (PRNewsfoto/Fort Health)\n\nAgentic AI Custom Training Scenarios Result in 83% of Clinicians Feeling More Prepared and 95% Able to Apply What They Have Learned\n\nNEW YORK,March 18, 2025/PRNewswire/ -- The high stakes nature of youth mental health therapy requires thorough preparation and applied evidence-based skills. Today,Fort Health, a specialty outpatient pediatric mental health provider, announced that it has partnered withCollevato train its therapists with AI avatar-led, face-to-face simulations. By providing highly relevant and engaging customized scenarios, Fort Health is able to rapidly upskill its therapists using evidence-based therapeutic protocols, ultimately leading to improved client care and operational efficiency. The initial series of custom training scenarios resulted in 83% of clinicians feeling more prepared and 95% able to apply what they have learned.\n\nAbody of researchfrom the National Institute of Medicine shows that current efforts to train clinicians in empirically-based treatments (EBTs) face significant challenges, as they typically provide only didactic training with no examination of applied skills, follow-up support, or implementation feedback. Studies emphasize the importance of role-play skill practice and ongoing expert guidance to ensure clinicians maintain high fidelity to EBT protocols and deliver effective interventions to patients. Compounded by thebehavioral health care workforce shortage,these limitations underscore the need for innovative training approaches to address challenges in a cost-effective and scalable manner.\n\n\"AI-powered avatar simulations are revolutionizing therapist training by enabling immersive, risk-free practice of critical decision-making and patient interactions,\" saidNatalie Schneider, founding CEO of Fort Health. \"Colleva's AI coaching platform empowers us to design tailored, dynamic scenarios that mirror real-world challenges, providing therapists with hands-on experience in applying evidence-based treatment protocols. By leveraging AI patient avatars, we are transforming mental health training—making it more proactive, personalized, and scalable to meet the growing demand for high-quality care.\"\n\nHow it Works\n\nUsing Fort Health's agentic AI training platform – which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers – therapists conduct realistic role plays with custom avatars and receive personalized feedback to identify areas for improvement and highlight strengths. The series of interactive scenarios are a safe space to practice and develop therapeutic techniques. To help therapists build and demonstrate their proficiency, there are three scenarios representative of the patient population that Fort Health treats. Each of the scenario's avatars have six personalities to choose from, allowing for more realistic and varied practice. Each custom simulation uses generative AI to analyze both content and delivery. Personalized feedback is based on specific EBT objectives and CBT competency frameworks. Therapists are also provided instant feedback on soft skill competencies important to successful therapy outcomes.\n\n\"We are harnessing AI not to replace human therapists, but to make them more effective,\" saidMichael Palys, co-founder and president of Colleva. \"It's been wonderful working in partnership with the Fort Health team as they share our collective vision of using AI role plays and simulations to enhance human skills in areas like mental health where these skills are so critically important to successful patient outcomes. The ability to offer personalized 1:1 feedback at scale is a game changer. My father's own career in psychiatry has made this particular project very special to me, and it's been wonderful to see the excitement among practitioners.\"\n\n\"As a therapist, I know how challenging it can be to translate the professional training we receive into real life interactions with children and families. I also know how uncomfortable and anxiety provoking it can be for a therapist to participate in role plays or live observations. Having a private, safe space to fumble and trip as you sharpen your skill set is a game changer for most therapists,\" saidLindsay Henderson, PsyD, founding clinical director, Fort Health. \"Utilizing AI simulations as a training platform to increase therapist's ability to deliver EBT at a higher fidelity will be key to solving for our nation's youth mental health needs.\"\n\n\"What a unique training opportunity! It allows me to practice and improve my clinical skills in a way I've never before experienced. I love getting immediate feedback which I can implement in real time,\" said Licensed Professional Counselor Catherine Murray.\n\nAbout Fort Health\n\nFounded in 2022, Fort Health is a specialty outpatient pediatric mental health provider. Fort Health transforms how children and adolescents, ages 4-24, receive mental health care by seamlessly partnering with pediatricians to provide evidence-based therapy, psychiatry, and parent coaching – all covered by insurance. Fort Health was built in partnership with the Child Mind Institute, an independent non-profit dedicated to transforming the lives of children and families struggling with mental health, mental illness and learning disorders. The company operates inNew Jersey,New York,Pennsylvania, andTexasandIllinois. VisitFort Healthon our website and onLinkedIn.\n\nAbout Colleva\n\nFounded in 2023, Colleva is an AI-powered enterprise talent platform that can help professionals enhance both hard and soft skills through personalized, scalable 1:1 feedback. Using AI avatars to provide AI roleplay and simulation-based training, Colleva provides immersive practice environments where professionals master critical interactions with immediate feedback. Colleva offers solutions across talent acquisition, onboarding, learning & development, performance management, and employee insights for organizations within healthcare, financial services, as well as other sectors. Headquartered inGreenwich, Connecticut, Colleva is transforming workforces through innovative AI solutions. Visit Colleva on our website and on LinkedIn.\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role-playing-practice-and-scalable-client-care-302402020.html\n\nSOURCE Fort Health\n\nOriginally published on theBLOX Digital Content Exchange.",
    "extraction_status": "success"
  },
  "https://www.businessinsider.com/artificial-intelligence-technology-sustainable-textile-recycling-solutions-2024-6_'What are your clothes made of?' is a deceptively difficult question. AI can help answer it.": {
    "company": "Refiberd",
    "title": "'What are your clothes made of?' is a deceptively difficult question. AI can help answer it.",
    "url": "https://www.businessinsider.com/artificial-intelligence-technology-sustainable-textile-recycling-solutions-2024-6",
    "source": "Business Insider",
    "body": "AI can help enhance garment-sorting accuracy in the fashion industry. The company Refiberd uses AI and sensors to identify recyclable textiles that can be repurposed. This article is part of ...",
    "date": "2024-06-03",
    "full_content": "For decades, thefashion industry has had an unlimited-growth mindset, fueled by cheap production and opacity. Even a seemingly simple question like \"What are your clothes made of?\" can flummox brands because fashion supply chains are so lengthy and far-flung.\n\nIt doesn't have to be this way, and AI could become a major force for a more sustainable industry.\n\nIn the past few years, brands have been accused of mislabeling their garments'fabric compositionandcountry of origin. A study conducted in the Netherlands involving about 7,000 garments found that41% of the garmentshad been mislabeled. Mislabeling poses an issue not just for curious consumers but for textile recyclers, who need to know exactly which fabrics they're dealing with in order to process them effectively.\n\nRecycling technologieshave improved over the past few decades, but vast piles of clothes need to be sorted first. This can be hard for workers to do accurately, and errors can be costly.\n\nWith their backgrounds intextile engineeringand AI, Sarika Bajaj and Tushita Gupta, the cofounders of Refiberd, spotted this accuracy problem in the late 2010s and understood that AI could help solve it.\n\nTo identify textiles, Refiberd uses AI and a sensor called a hyperspectral camera. \"It's almost like a video camera which pulls out near-infrared data,\" Bajaj told Business Insider. \"Light gets reflected onto our sensor, and that tells us what materials we're dealing with. What you end up with are spectra, graphs that tell you there's an extra 1% here of elastane or an extra 2% there of cotton.\"\n\nRefiberd tech uses a regression-based model, which estimates fabric composition and is more precise than a classification model that sorts materials into broad categories.\n\nBajaj said the regression-based model works with the help of a materials library made up of \"thousands upon thousands of samples,\" allowing Refiberd to \"detect textile material composition within 2% of the actual material composition.\"\n\nTo understand how we got here, it's worth breaking down exactly how fast fashion — the leading cause of the industry'stextile-waste problem— is made. Bajaj described the bulk of consumer-bought clothes as a \"notorious mix of blends and contaminants\" often manufactured in various factories worldwide.\n\n\"What we have found is that there's variability at every stage of the process,\" she said.\n\n\"We might see a garment made of organic cotton and think, 'Organic, amazing,'\" Bajaj added. \"Yet the process of dying organic, virgin cotton at a certain level just makes it a plastic.\"\n\nSynthetic dyesin garments require enormous amounts of water and contain contaminants. \"At what point do we still call this pure?\" Bajaj said. \"Then that garment might be sent off to a different factory for cut and sew, but those workers added polyester thread everywhere, and none of that has been accounted for on the label.\"\n\nA lack of regulation in the fashion industry meanscreative solutions are neededto tackle the problem. Leading in this field is the Hong Kong Research Institute of Textiles and Apparel, or HKRITA, known for its sustainability-focused tech.\n\nIn addition to asmart garment-sorting system— which also uses hyperspectral cameras — HKRITA has several innovations designed to address what its CEO, Edwin Keh, sees as a deeper-rooted issue in the fashion industry: a refusal to consider product lifespan.\n\n\"There's a lack of thoughtfulness about reuse and second use,\" Keh said.\n\nHe said that whilealuminum beverage cans' high recycling ratescould be attributed partly to their use of a single material, the fashion industry's reliance on material blending to cut costs had complicated recycling. \"We use all sorts of blends and coatings,\" Keh said, \"because we just didn't think about second use.\"\n\nKeh described garment sorting as the \"big bottleneck,\" given how manual it is. But there are other remedies. HKRITA's projects include an AI-powered mechanical recycling system designed to identify reusable indigo-dyed warp yarns in denim and separate them from nonrecyclable synthetic yarns.\n\nBoth Refiberd and HKRITA have received cash awards from the H&M Foundation, a nonprofit funded by the founders of the H&M Group. The foundation, which says it aims to create a more \"socially inclusive and planet positive textile industry,\" has partnered with HKRITA on a program calledPlanet First.\n\nThe novelty of such innovations means securing investment can be a challenge. \"As a philanthropic organization, we can support these ideas when they're at a very critical stage and need funding to further develop, but they're too early for many investors,\" Anna Gedda, the global manager of the H&M Foundation, told BI. \"We can absorb that risk and support them to develop and scale.\"\n\nThe necessity of these solutions can't be underestimated.Tons of unwanted clothesare sent to landfills daily, and tons more are sold to traders who sort through clothes to find items of value and discard the rest. Rejected items aredumped out of sight, often in countries like Ghana, whose secondhand-clothes dealers havetaken a stand against this practice, or in remote locations like Chile's Atacama Desert, recently dubbedfast fashion's great garbage patch.",
    "extraction_status": "success"
  },
  "https://www.wbbjtv.com/2025/04/30/inventor-author-and-entrepreneur-dr-cori-lathan-visits-ut-martin/_Inventor, author, and entrepreneur Dr. Cori Lathan visits UT Martin": {
    "company": "De Oro Devices",
    "title": "Inventor, author, and entrepreneur Dr. Cori Lathan visits UT Martin",
    "url": "https://www.wbbjtv.com/2025/04/30/inventor-author-and-entrepreneur-dr-cori-lathan-visits-ut-martin/",
    "source": "WBBJ-TV",
    "body": "Dr. Cori Lathan, the chief executive officer of De Oro Devices and co-founder of AnthroTronix Inc., was the guest speaker at a College of Engineering and Natural Sciences STEMinar held April 22.",
    "date": "2025-04-30",
    "full_content": "MARTIN, Tenn. – Dr. Cori Lathan, the chief executive officer of De Oro Devices and co-founder of AnthroTronix Inc., was the guest speaker at a College of Engineering and Natural Sciences STEMinar held April 22.\n\nLathan has a Ph.D. in neuroscience from the Massachusetts Institute of Technology, along with degrees in aeronautics, astronautics, biopsychology and mathematics.\n\nHer work has been featured in Forbes, Time, The New Yorker and TEDx. She has been named Maryland’s Top Innovator of the Year, one of MIT Technology Review’s “Top 100 World Innovators.” The STEMinar featured a Q&amp;A session with Lathan that included students of Dr. Ashley Owens, assistant professor of engineering, and Women in STEM students and faculty.\n\nLathan also spent the morning touring the campus and its science facilities, laboratories and classrooms.\n\nThe term “STEM” – short for “Science, Technology, Engineering and Mathematics” – encompasses a broad range of academic disciplines and career pathways in those fields.\n\nIn introducing Lathan to the audience, UT Martin Provost and Senior Vice Chancellor for Academic Affairs Dr. Philip Cavalier – who attended Swarthmore College with Lathan – told students that she is not focused in just one area.\n\n“I think that’s important,” he said. “I know all of you are learning specific areas of your major, and that’s important and fantastic. But, to get to the point where you’re an innovator and the CEO of a company and a faculty member and highly recognized, a big part of that is because Cori is interested in a wide range of things, curious about the world.”\n\nLathan founded a research and development company, AnthroTronix, which she ran for 20 years and still serves as a board member.\n\n“Biomedical engineering didn’t exist as a degree going through college,” she said. “That’s probably what I would have majored in now, but instead, I took lots of math and neuroscience and psychology and aerospace engineering.”\n\nLathan’s work has ranged from developing robots that assist children with disabilities to creating virtual reality environments for astronauts aboard the space station.\n\nLathan has also contributed to the development of wearable sensor technology and mobile medical applications for military personnel and clinicians.\n\nHer latest book, “Inventing the Future: Stories from a Techno-Optimist,” chronicles her decades- long journey in leveraging technology to improve the world.\n\nDr. Lily Pharris, assistant professor of computer science, was among the UT Martin faculty members to host Lathan on her visit to campus.\n\n“Having Dr. Cori Lathan visit UT Martin was an inspiring experience, especially for students pursuing careers in STEM fields,” she said. “Not too long ago, Dr. Lathan was sitting in a seat just like theirs — full of ambition, ideas and a desire to make a difference. Today, she stands as a powerful example of where following your passions, dreams and heart can lead.\n\n“Through her work as an inventor, entrepreneur and advocate for inclusive technology, Dr. Lathan showed our students that innovation isn’t just about building the future; it’s about shaping it with empathy, creativity and perseverance. I hope her story leaves a lasting impression, inspiring students to see themselves as the next generation ready to take up the torch and lead us toward an optimistic future.”\n\nMore information about Dr. Cori Lathan can be found at her website, inventthefuture.tech.\n\nFor more local news,click here.",
    "extraction_status": "success"
  },
  "https://markets.businessinsider.com/news/stocks/ebay-invests-300-000-into-refiberd-1034567148_eBay invests $300,000 into Refiberd": {
    "company": "Refiberd",
    "title": "eBay invests $300,000 into Refiberd",
    "url": "https://markets.businessinsider.com/news/stocks/ebay-invests-300-000-into-refiberd-1034567148",
    "source": "Business Insider",
    "body": "eBay (EBAY) investing $300,000 into Refiberd in its ongoing efforts to support fashion startups to scale circular solutions through its global Circular Fashion Fund program. This funding is aimed ...",
    "date": "2025-04-09",
    "full_content": "eBay (EBAY) investing $300,000 into Refiberd in its ongoing efforts to support fashion startups to scale circular solutions through its global Circular Fashion Fund program. This funding is aimed to scale the impact of Refiberd’s cutting-edgeAIsystem that can discern exactly what different fabrics are made of, allowing them to be accurately sorted and recycled. Their technology can be integrated into existing recycling infrastructures to sort materials and ensure they’re processed using the right methods-helping recyclers turn textile waste into new, usable fibers. By enabling more efficient recycling, Refiberd aims to tackle the industry’s waste-sorting dilemma and drive true circularity in fashion.\n\nPublished first onTheFly– the ultimate source for real-time, market-moving breaking financial news.Try Now>>\n\nSee the top stocks recommended by analysts >>\n\nRead More on EBAY:\n\nDisclaimer & DisclosureReport an Issue",
    "extraction_status": "success"
  },
  "https://www.undercurrentnews.com/2025/05/01/mikel-durham-out-as-interim-ceo-as-us-kelp-farmer-atlantic-sea-farms-downsizes/_Mikel Durham out as interim CEO as US kelp farmer Atlantic Sea Farms downsizes": {
    "company": "Atlantic Sea Farms",
    "title": "Mikel Durham out as interim CEO as US kelp farmer Atlantic Sea Farms downsizes",
    "url": "https://www.undercurrentnews.com/2025/05/01/mikel-durham-out-as-interim-ceo-as-us-kelp-farmer-atlantic-sea-farms-downsizes/",
    "source": "Undercurrent News",
    "body": "Kiera Foti, a brand manager with Atlantic Sea Farms, announced on LinkedIn that she was laid off as the Maine-based kelp producer is 'scaling back and restructuring'",
    "date": "2025-05-01",
    "full_content": "Kiera Foti, a brand manager with Atlantic Sea Farms, announced on LinkedIn that she was laid off as the Maine-based kelp producer is 'scaling back and restructuring'\n\nMikel Durham, a board member of US kelp producer Atlantic Sea Farms and its recently appointed interim CEO, is no longer with the company as it undergoes downsizing [...]\n\nSign up for a trial to have access to our articles!\n\nWe’ve sent a link toto change your password.\n\nPlease check your inbox to reset your password securely and easily.\n\nContact the author[email protected]\n\nGet recommendations, data, editor’s picks, and the latest news from around the seafood world straight to your inbox.\n\nWill be used in accordance with ourPrivacy Policy",
    "extraction_status": "success"
  },
  "https://www.yahoo.com/lifestyle/ebay-circular-fashion-fund-crowns-142425945.html_EBay's Circular Fashion Fund Crowns Refiberd Its First Circular Fashion Innovator of the Year": {
    "company": "Refiberd",
    "title": "EBay's Circular Fashion Fund Crowns Refiberd Its First Circular Fashion Innovator of the Year",
    "url": "https://www.yahoo.com/lifestyle/ebay-circular-fashion-fund-crowns-142425945.html",
    "source": "Yahoo",
    "body": "EBay's Circular Fashion Fund has officially announced Refiberd as its Circular Fashion Innovator of the Year awarding the company with an investment of $300,000. The company's discerning AI ...",
    "date": "2025-04-09",
    "full_content": "EBay’s Circular Fashion Fund has officially announced Refiberd as its Circular Fashion Innovator of the Year awarding the company with an investment of $300,000. The company’s discerning AI solution aims to tackle the fashion industry’s waste problem head-on by making it easier than ever to reuse fibers.\n\nWhile Refiberd represents the first to win the award, the program stems from a larger mission to invest in tools andtechnologythat fuel the circular economy and help drive the fashion industry to a more sustainable future. As a leader in the secondary marketplace, eBay partnered with the British Fashion Council, Council of Fashion Designers of America, Fashion Council Germany and Australia Fashion Council to recognize the innovators driving this sustainable change to provide not only capital but access and visibility to propel growth.\n\nMore from WWD\n\nFaherty Expands 'Second Wave' Resale Program With Mail-in Option\n\nHow Tapestry Drives Adaptable Digital Journeys With Technology\n\nEXCLUSIVE: Salma Hayek Pinault Is Merz Aesthetics' First Global Ambassador for Ultrasound Treatment Ultherapy Prime\n\n“As the pioneering secondary marketplace,eBayhas been driving circularity in fashion since its inception 30 years ago,” saidAlexis Hoopes, vice president, and global head of fashion at eBay. “It’s a critical time for the fashion industry, and eBay’s Circular Fashion Fund — and the eBay platform at large — are propelling the industry forward, enabling innovative ideas to help shape brand and consumer behaviors.”\n\nDesigned to support start-ups to scale circular solutions from production to end of life, the Circular Fashion Fund’s search for Innovator of the Year looked across the U.K., U.S., Germany and Australia, shortlisting 12 companies that were recognized as pioneers in circular fashion. These finalists were chosen by a judging panel of industry experts within the fields of fashion, academia andsustainability.\n\nAs this year’s winner, Refiberd will use the funding to scale the impact of its intelligent sorting solution for textile-to-textile recycling AI system. The company’s mission tackles the industry’s waste-sorting problem to drive true circularity in fashion.\n\nAccording to the company, the technology “can be integrated into existing recycling infrastructures to sort materials and ensure they’re processed using the right methods.” In practice, this will help recyclers turn textile waste into new, usable fibers.\n\n“The investment from eBay Ventures will help us close a significant round of fundraising for the business, allowing us to expand our technology to new recycling partners, strengthen our AI capabilities and move faster toward our mission of enabling true textile-to-textile recycling,” said Sarika Bajaj, cofounder and chief executive officer of Refiberd. “The journey for a startup is tough, so having the mentorship and access to eBay and the CFDA’s networks has already proven invaluable. With this added support we can accelerate our impact and help build a future where circular fashion is the norm — not the exception.”\n\nEBay continues to champion re-commerce through its Circular Fashion Fund and champion the increased appetite for circular fashion. Notably, the company’s research revealed that 66 percent of Gen Z say that purchasing pre-loved fashion has grown in personal importance.\n\nSince its launch in 2022, the fund has supported 27 businesses and provided more than 200 hours of mentoring and upskilling from industry experts with a total investment of $1.2 million.\n\nBest of WWD\n\nThe Definitive Timeline for Sean 'Diddy' Combs' Sean John Fashion Brand: Lawsuits, Runway Shows and Who Owns It Now\n\nWhat the Highest-paid CEOs at U.S. Fashion and Retail Companies Make\n\nConfidence Holds Up, But How Much Can Consumers Take?\n\nSign up forWWD's Newsletter. For the latest news, follow us onFacebook,Twitter, andInstagram.",
    "extraction_status": "success"
  },
  "https://specialtyfabricsreview.com/2025/05/13/refiberd/_eBay invests $300k in Refiberd to drive circular fashion solutions": {
    "company": "Refiberd",
    "title": "eBay invests $300k in Refiberd to drive circular fashion solutions",
    "url": "https://specialtyfabricsreview.com/2025/05/13/refiberd/",
    "source": "Specialty Fabrics Review",
    "body": "Bay is investing $300,000 into Refiberd in its ongoing efforts to support fashion startups through its global Circular Fashion Fund program.",
    "date": "2025-05-13",
    "full_content": "Company News,News| May 13, 2025 | By:ATA\n\neBay announced that the company is investing $300,000 intoRefiberdin its ongoing efforts to support fashion startups to scale circular solutions through its global Circular Fashion Fund program.\n\nRefiberd was announced the winner of eBay’s Circular Fashion Innovator of the Year Award, which saw 12 shortlisted businesses across the U.K., U.S., Germany and Australia rewarded for their work in pioneering a more circular fashion industry.\n\nThis funding is aimed to scale the impact of Refiberd’s cutting-edge artificial intelligence (AI) system that can discern exactly what different fabrics are made of, allowing them to be accurately sorted and recycled. Their technology can be integrated into existing recycling infrastructures to sort materials and ensure they’re processed using the right methods, helping recyclers turn textile waste into new, usable fibers.\n\nSince the Circular Fashion Fund’s launch in 2022, it has supported 27 businesses and by the end of 2025 will have invested a total of $1.2 million alongside over 200 hours of mentoring from industry experts. In partnership with the fashion industry’s foremost councils—BFC, CFDA, FCG and AFC—eBay gives recipients access and visibility into the industry.\n\n“We’re honored to win eBay’s first Circular Fashion Innovator of the Year Award. The investment from eBay Ventures will help us close a significant round of fundraising for the business, allowing us to expand our technology to new recycling partners, strengthen our AI capabilities, and move faster toward our mission of enabling true textile-to-textile recycling. The journey for a startup is tough, so having the mentorship and access to eBay and the CFDA’s networks has already proven invaluable. With this added support we can accelerate our impact and help build a future where circular fashion is the norm—not the exception,” says Sarika Bajaj, co-founder and CEO of Refiberd.\n\n“As the pioneering secondary marketplace, eBay has been driving circularity in fashion since its inception 30 years ago,” says Alexis Hoopes, vice president and global head of fashion at eBay.“It’s a critical time for the fashion industry, and eBay’s Circular Fashion Fund—and the eBay platform at large—are propelling the industry forward, enabling innovative ideas to help shape brand and consumer behaviors.”\n\nCountry finalists includedSOJOin the U.K., which makes repairs easy with door-to-door service to keep clothes in use longer;MOOT(Made Out of Trash) in Germany, which offers a comprehensive upcycling plug-in to enable brands to seamlessly integrate scalable upcycling solutions; andShopfrontin Australia, which uses AI to streamline the fashion resale process across multiple marketplaces simplifying the clothing resale process. Finalists each received grants starting at $50,000 in their respective local currencies.\n\nThe winners were chosen by a judging panel of industry experts across fashion, academia and sustainability.\n\nEach of the four country finalists went on to a judging process with eBay’s venture capital arm, eBay Ventures, which saw Refiberd crowned as the overall Circular Fashion Innovator of the Year, winning the $300,000 investment prize.\n\nShare this Story\n\nEPA extends reporting period for PFAS manufacturers\n\nU.S. and U.K. announce trade deal, modifying tariffs\n\nU.S. and China agree to lower tariffs on imports for 90 days\n\nOEKO-TEX® MADE IN GREEN marks a decade as a global sustainability label\n\nKBR partners with Samsara Eco to design new enzymatic recycling plant\n\nKimberly-Clark investing $200 million, adding 150+ jobs in S.C. expansion",
    "extraction_status": "success"
  },
  "https://markets.businessinsider.com/news/stocks/braincheck-raises-another-1-5-million-to-bring-artificial-intelligence-to-dementia-care-1027831188_Braincheck Raises Another $1.5 Million to Bring Artificial Intelligence to Dementia Care": {
    "company": "BrainCheck",
    "title": "Braincheck Raises Another $1.5 Million to Bring Artificial Intelligence to Dementia Care",
    "url": "https://markets.businessinsider.com/news/stocks/braincheck-raises-another-1-5-million-to-bring-artificial-intelligence-to-dementia-care-1027831188",
    "source": "Business Insider",
    "body": "HOUSTON, Jan. 03, 2019 /PRNewswire-PRWeb/ -- BrainCheck, a Texas-based digital neurocognitive testing platform, has raised $1.5 million in additional capital to bring AI and personalized medicine ...",
    "date": "2018-12-24",
    "full_content": "HOUSTON,Jan. 03, 2019/PRNewswire-PRWeb/ --BrainCheck, aTexas-based digital neurocognitive testing platform, has raised$1.5 millionin additional capital to bring AI and personalized medicine to dementia care through its cognitive care management technology, BrainCheck Care, which launched inJuly 2018. Funding, led byTrue Wealth Ventures, with participation fromTensility Venture Partners,XFactor Ventures,S3 Venturesand angel investors, brings the total funding to$6 millionto date.\n\nBorn at the Eagleman Neuroscience Laboratory atBaylor College of Medicine(now atStanford), BrainCheck enables physicians to rapidly and accurately assess cognitive function and deliver cognitive care at scale. The platform is currently used by hundreds of clinical practices and over 40,000 individuals and is growing rapidly. As first to market with an end-to-end cognitive health solution, BrainCheck is well-positioned to change millions of lives by providing a much-needed and promising solution to the \"silver tsunami.\"\n\nThere are5.7 million people suffering with dementiain the U.S. today, according to the Alzheimer's Association. The cost to healthcare organizations is 50 percent greater than cancer or heart disease. But new research from The Lancet Commission shows that one-third of dementia is preventable, and disease progression can be slowed through effective detection and addressing modifiable risk factors. As digital medicine continues to transform patient care, BrainCheck occupies a unique position to meet the needs of the dementia market.\n\nThrough a combination of assessments, screeners, workflows and clinical decision support algorithms, BrainCheck Care enables physicians to provide a detailed, personalized care plan to the patient and caregiver at the point of care.\n\n\"BrainCheck's rich and robust dataset on cognitive health, paired with other health and biometric data, enable us to personalize dementia care at scale,\" saidDr.Yael Katz, co-founder and CEO of BrainCheck. \"For the first time, clinicians and caregivers can observe whether interventions are working by tracing cognitive change to a patient's medications, chronic diseases, or lifestyle, and iterate on these interventions to optimize outcomes.\"\n\nChicago-based Tensility Venture Partners focuses its investments on enterprise AI companies. \"We saw a great opportunity with BrainCheck,\" saidArmando Pauker, managing director and co-founder at Tensility Venture Partners. \"They're sitting on a treasure trove of difficult-to-obtain data and are addressing a large market opportunity. They bring the power and benefits of AI into clinical care to make cognitive testing easily available to all.\"\n\n\"The research is clear and it has now been clinically proven that patients can delay the onset of dementia,\" saidCharlie Plauche, partner at S3 Ventures. \"By helping physicians detect this debilitating disease early, BrainCheck's platform technology will improve the lives of millions in the coming years.\"\n\nHeadquartered at the Texas Medical Center Innovation Institute, TMCx, BrainCheck has recently opened a second office inAustin, Texas. The funding will be used to expand the company's R&D and enhance its offering that is truly moving the needle in the dementia space. The company is also investing in sales and marketing talent to accelerate deployment in clinical practice.\n\nAbout BrainCheckBrainCheck provides rapid, mobile cognitive assessment and decision support technology to physicians, empowering them to deliver high-quality, personalized cognitive health care to patients everywhere and get reimbursed. This helps patients live better and safer lives at home, decreases caregiver frustration, and saves health systems trillions. Founded in 2015 by neuroscientists and technologistsDr.David Eagleman(Baylor College of Medicine/Stanford) andDr.Yael Katz, BrainCheck helps lessen the human and economic toll of cognitive impairment and dementia through its interactive cognitive assessment and care management technology. BrainCheck is used around the world to detect cognitive changes early and enable patients, caregivers, and clinicians to work together to implement personalized recommendations to preserve brain health and functional independence. BrainCheck enables physicians to get paid for cognitive care management (via Medicare reimbursement) and simultaneously reduces healthcare costs by keeping patients healthy, safe, and out of the hospital.\n\nTo learn more, please visithttp://www.braincheck.com.\n\nSOURCE  BrainCheck",
    "extraction_status": "success"
  },
  "https://techcrunch.com/2021/11/03/braincheck-brings-in-another-10m-to-detect-manage-cognitive-impairment/_BrainCheck brings in another $10M to detect, manage cognitive impairment": {
    "company": "BrainCheck",
    "title": "BrainCheck brings in another $10M to detect, manage cognitive impairment",
    "url": "https://techcrunch.com/2021/11/03/braincheck-brings-in-another-10m-to-detect-manage-cognitive-impairment/",
    "source": "TechCrunch",
    "body": "BrainCheck, a Houston- and Austin-based company developing cognitive healthcare software to aid physicians in detecting and managing this type of care, raised $10 million in Series B funding to ...",
    "date": "2021-11-03",
    "full_content": "As the world’s population ages, more is being learned about brain health as startups leverage technology to find a way to slow down cognitive impairment.\n\nBrainCheck, a Houston- and Austin-based company developing cognitive healthcare software to aid physicians in detecting and managing this type of care, raised $10 million in Series B funding to expand its R&D and go-to-market capabilities as it works on new digital therapeutics for Alzheimer’s and related dementias.\n\nThe round was led by Next Coast Ventures and S3 Ventures, which were joined by Nueterra Capital, Tensility Ventures and True Wealth Ventures. In addition, UPMC Enterprises and SelectQuote came on as strategic investors. The latest funding gives the company roughly $21 million in total funding raised to date, which includes a$3 million seed roundin 2016 and$8 million in Series A fundingfrom 2019.\n\nThis startup just raised $8 million to help busy doctors assess the cognitive health of 50 million seniors\n\nBrainCheck’s technology acts as a bridge between patients and the limited number of neurologists, about 12,000, in the U.S. Through 10- to 15-minute tests, performed in-person or remote (via a smartphone, tablet or computer), cognitive function can be detected early and more accurately.\n\nBased on the test, patients are assigned a Cognitive Quotient (CQ) score, which is then used to produce a personalized cognitive care plan within minutes. Over 400 neurology, primary care and geriatrics practices use the technology currently, including Mount Sinai clinicians, which are using it to track and manage cognitive impairment resulting from COVID-19.\n\nThe pandemic has changed everything across the healthcare ecosystem, Yael Katz, PhD, co-founder and CEO of BrainCheck, told TechCrunch via email.\n\nThe company always had it in mind to raise another round two years after its Series A, but Katz said the global pandemic gave them pause to see how it would impact that decision. However, due to COVID shining a light on how people perceive healthcare and became more comfortable with remote care, they saw an opportunity to continue.\n\nThe new funding will enable the company to continue to grow its team and invest in R&D. It already has several new initiatives in the works to close the loop with the patient journey that will be brought to market soon, she added.\n\nOver the last year, BrainCheck experienced year over year revenue growth increase three times, and Katz expects the same trajectory for next year. With the Series B, the goal remains the same as it was two years ago — double down on growth.\n\n“From the shift to remote work and an increased prioritization of mental health, to investing in preventive medicine and supporting the aging population, all of these factors have come together to make the case that what we’re doing matters, and will continue to matter,” she said. “It’s never been more important for physicians to invest in a tool like BrainCheck and improve treatment across the patient journey.”\n\nThe next healthcare revolution will have AI at its center\n\nTopics\n\nSenior Reporter\n\nChristine Hall wrote about enterprise/B2B, e-commerce, and foodtech for TechCrunch, and venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an undergraduate journalism degree from Murray State University and a graduate degree from The Ohio State University.\n\nLIMITED TIME: Save $300+ on your ticket, plus an additional 50% on a second for a full immersive day of AI! Hear from AI pioneers from Google DeepMind, OpenAI, Anthropic, and more on the main stage and in breakouts, and network like never before.\n\nAnthropic launches a voice mode for Claude\n\nOpenAI may soon let you ‘sign in with ChatGPT’ for other apps\n\nRead-it-later app Pocket is shutting down — here are the best alternatives\n\nTexas signs into law online safety bill reportedly opposed by Apple’s Tim Cook\n\nRivr’s dog-like robots join Veho vans to solve ‘last-100-yards’ parcel delivery in Austin\n\nMeta reportedly splits its AI team to build products faster\n\nAI may already be shrinking entry-level jobs in tech, new research suggests",
    "extraction_status": "success"
  },
  "https://markets.businessinsider.com/news/stocks/dermala-a-consumer-dermatology-company-announces-several-additions-to-a-successful-acne-product-range-1030858579_DERMALA, A Consumer Dermatology Company, Announces Several Additions to a Successful Acne Product Range": {
    "company": "Dermala",
    "title": "DERMALA, A Consumer Dermatology Company, Announces Several Additions to a Successful Acne Product Range",
    "url": "https://markets.businessinsider.com/news/stocks/dermala-a-consumer-dermatology-company-announces-several-additions-to-a-successful-acne-product-range-1030858579",
    "source": "Business Insider",
    "body": "SAN DIEGO, Oct. 12, 2021 /PRNewswire/ -- DERMALA, the only personalized, clinically proven treatment for acne powered by the human microbiome extends its product line-up with the addition of six ...",
    "date": "2021-10-12",
    "full_content": "SAN DIEGO,Oct. 12, 2021/PRNewswire/ -- DERMALA, the only personalized, clinically proven treatment for acne powered by the human microbiome extends its product line-up with the addition of six new products. The line extension includes Best CLEANSE Forever™Hydrating Cleanser for Sensitive/Normal Skin, SUPPLEMEANT to Be®Daily Pre + Probiotic Skin Mix, SUPPLEMEANT to Be®Daily Vitamin Skin Mix, and PATCH Me (If You Can)®Targeted Pimple Patches in small (S), medium (M), and extra-large (XL) sizes.\n\nEach new product is an extension of the core line, targeting consumers' specific needs. The Best CLEANSE Forever is an expansion on the original CLEANSE with Benefits AM/PM Cleanser for Normal/Combination Skin. It balances the skin's microbiome and fights acne-causing bacteria without overdrying the skin. The Best CLEANSE Forever is formulated with powerful, patented SE Microbiome®and SE Sugar™Complexes, hyaluronic acid, niacinamide, ceramides, Aloe vera, and botanical extracts that hydrate, soothe and protect blemish-prone, sensitive skin.\n\nThe brand's best-selling SUPPLEMEANT to Be®Daily Pre + Probiotic + Vitamin Skin Mix is now available in two new formulations, based on strong customer demand for solutions that support skin health from the inside out. SUPPLEMEANT to Be®Daily Pre + Probiotic Skin Mix is formulated with unique, blemish-fighting probiotics and prebiotics with a boost from a spinach leaf-based blend of antioxidants, vitamins, and minerals. SUPPLEMEANT to Be®Daily Vitamin Skin Mix enhances skin health with a unique blend of zinc, chromium, vitamins, hyaluronic acid, and green tea & spinach leaf extracts that support a balanced microbiome and glowing skin.\n\nThe product extensions are completed by the launch of 40% thinner PATCH Me (If You Can)®Targeted Pimple Patches in three sizes and a variety of formats –S/M, XL, andS/M/XL variety pack. Similar to the original PATCH ME (If You Can)®, the hydrocolloid pimple patches reduce the size and severity of acne lesions, speed up healing, protect the skin from the spread of acne-causing bacteria, and prevent dark spots and scars.\n\n\"We are dedicated to producing innovative, science-based acne-fighting treatments and products that work from the inside out and outside in,\" said Lada Rasochova, PhD MBA, Founder & CEO of DERMALA. \"Our team is actively developing new products that combine human microbiome science with skincare and data analytics. We are very confident in the results our customers will see with our new product launches.\"\n\nAll DERMALA products are based on cutting-edge human microbiome science. They are formulated with patented microbiome-derived prebiotics, probiotics, and postbiotics that improve skin health naturally by balancing both the skin and gut microbiome. Visitwww.dermala.comto learn more.\n\nAbout DERMALADERMALA, Inc. is aSan Diego-based consumer dermatology company leveraging a scientific understanding of the human microbiome and data analytics to develop novel solutions for acne and other skin conditions. DERMALA delivers a microbiome-powered solution by combining patented topical acne treatments, oral supplements, and the DERMALA Acne Tracker App.\n\nPress Contact:Erica@LazarusPR.com\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/dermala-a-consumer-dermatology-company-announces-several-additions-to-a-successful-acne-product-range-301397098.html\n\nSOURCE  DERMALA",
    "extraction_status": "success"
  },
  "https://ktla.com/business/press-releases/cision/20220607FL79869/dermala-a-consumer-dermatology-company-launches-at-home-personalized-skin-tests/_DERMALA, A CONSUMER DERMATOLOGY COMPANY, LAUNCHES AT-HOME, PERSONALIZED SKIN TESTS": {
    "company": "Dermala",
    "title": "DERMALA, A CONSUMER DERMATOLOGY COMPANY, LAUNCHES AT-HOME, PERSONALIZED SKIN TESTS",
    "url": "https://ktla.com/business/press-releases/cision/20220607FL79869/dermala-a-consumer-dermatology-company-launches-at-home-personalized-skin-tests/",
    "source": "KTLA",
    "body": "June 7, 2022 /PRNewswire/ -- DERMALA, a consumer dermatology company leveraging a scientific understanding of the human microbiome to develop the next generation of products for chronic skin ...",
    "date": "2022-06-07",
    "full_content": "News provided by\n\nJun 07, 2022, 7:00 AM\t\t\t\t\t\tET\n\n,June 7, 2022/PRNewswire/ -- DERMALA, a consumer dermatology company leveraging a scientific understanding of the human microbiome to develop the next generation of products for chronic skin conditions, introduces DERMALA Skin Tests, an at-home, personalized skin testing kit. DERMALA Skin Tests measure the oil level and pH of the skin to track how the customer's skin and microbiome change while using DERMALA's acne treatment.\n\nThe DERMALA Skin Test Kit contains two tests, a Skin Oiliness Test and a Skin pH Test. The Skin Oiliness Test measures levels of sebum (oil) production, which can be associated with clogged pores, overgrowth ofC. acnes, the acne-causing bacteria, and acne breakouts. The Skin pH Test measures the pH of the skin, which corresponds to skin barrier health and microbiome health. DERMALA recommends that tests are taken once a month to accurately track skin changes during acne treatment.\n\nThe launch of the at-home Skin Test Kit is an additional component of the personalization and monthly treatment optimization that the DERMALA brand is known for. As customers take the tests, a QR code is available to access a personalized Digital Skin Report Card that allows customers to monitor their skin health during the treatment, get their product formulation and assortment optimized based on results, and make skincare regimen adjustments as needed.\n\n\"It can be hard to understand whether or not your acne products are improving your overall skin health during your treatment journey,\" said Lada Rasochova, Ph.D. MBA, Founder & CEO of DERMALA. \"Good acne treatments will help reduce skin oiliness and improve the skin barrier and microbiome health. The DERMALA Skin Tests will help our customers track the improvements of their skin health throughout their treatment journey.\"\n\nThe DERMALA Skin Tests are available atwww.dermala.com. All DERMALA products are based on cutting-edge human microbiome science. They are formulated with patented, natural microbiome-derived prebiotics, probiotics, and postbiotics that balance the skin and gut microbiomes and improve skin health naturally.\n\nAbout DERMALADERMALA, Inc. is aSan Diego-based consumer dermatology company leveraging a scientific understanding of the human microbiome and data analytics to develop the next generation of personalized, microbiome-powered solutions for chronic skin conditions including acne and eczema, and skin wellness. Visitwww.dermala.comto learn more.\n\nPress Contact:Erica@LazarusPR.com\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/dermala-a-consumer-dermatology-company-launches-at-home-personalized-skin-tests-301562098.html\n\nSOURCE  DERMALA\n\nNOTE: This content is not written by or endorsed by \"KTLA\", its advertisers, or Nexstar Media Inc.",
    "extraction_status": "success"
  },
  "https://gigazine.net/gsc_news/en/20210702-flowly_'Flowly' that scientifically reduces pain and anxiety with VR and smartphones": {
    "company": "Flowly",
    "title": "'Flowly' that scientifically reduces pain and anxiety with VR and smartphones",
    "url": "https://gigazine.net/gsc_news/en/20210702-flowly",
    "source": "GIGAZINE",
    "body": "Flowly ' is a VR system that can distract you from pain and anxiety by medical methods. Flowly was created with the ease of use at home and scientific backing in mind, and at the time of ...",
    "date": "2021-07-02",
    "full_content": "'Flowly' is a VR system that can distract you from pain and anxiety by medical methods. Flowly was created with the ease of use at home and scientific backing in mind, and at the time of announcement, developers are working to make it covered by insurance.Flowly: your app for pain and anxiety\n\nIt is also possible to stay on the shore of a lake where flowers are in full bloom.\n\nVital signs such as heart rate and respiration rate during use can be aggregated using a smartphone or a dedicated biosensor to measure efficacy. Please note that headsets are limited to VR headsets that are compatible with iOS apps.\n\nAccording to Celine Tien, who developed Flowly, he witnessed that the physical pain caused by serious illnesses such as cancer affects not only the physical body but also the psychology and society, so pain is painful without relying on drugs. He said he wanted to invent a device that could reduce the amount of pain. In each Flowly session, by controlling the nervous system that is greatly involved in pain, you can learn how to shift from a state where sympathetic nerves are activated such as\n\nIn addition, progress data analysis is possible.\n\nJul 02, 2021  23:00:00inSoftware,Hardware,  Posted by darkhorse_log",
    "extraction_status": "success"
  },
  "https://www.bollywoodhungama.com/news/features/sunny-leone-makes-statement-strapless-flowly-gown-kerala/_Sunny Leone makes a statement in strapless flowly gown in Kerala": {
    "company": "Flowly",
    "title": "Sunny Leone makes a statement in strapless flowly gown in Kerala",
    "url": "https://www.bollywoodhungama.com/news/features/sunny-leone-makes-statement-strapless-flowly-gown-kerala/",
    "source": "Bollywood Hungama",
    "body": "The actress looked ethereal in a beige and gold gown. The beige chiffon gown with a golden sparkly corset with a tube sweetheart neckline. She kept her makeup dewy and fresh with her hair in a ...",
    "date": "2021-03-23",
    "full_content": "Sunny Leone, who is currently in Kerala for the shooting schedule of MTV Splitsvilla 13, lit up Instagram on Monday.\n\nThe actress looked ethereal in a beige and gold gown. The beige chiffon gown with a golden sparkly corset with a tube sweetheart neckline. She kept her makeup dewy and fresh with her hair in a high baby doll ponytail. She kept her accessories simple with pearly heart earrings. She looked right out of a barbie doll movie!\n\nIn May last year, Sunny Leone and Daniel Weber moved to Los Angeles from Mumbai for the safety of their kids amid the coronavirus pandemic. She turned to India after a few months.\n\nSunny Leone currently appears as a co-host on MTV Splitsvilla, which she has been hosting since season 7. The show is currently in its 13th season now.\n\nA post shared by Sunny Leone (@sunnyleone)\n\nAlso Read:Sunny Leone looks alluring in tube-neck gown for Splitsvilla 13\n\nCatch us for latestBollywood News,New Bollywood Moviesupdate,Box office collection,New Movies Release,Bollywood News Hindi,Entertainment News,Bollywood Live News Today&Upcoming Movies 2025and stay updated with latest hindi movies only on Bollywood Hungama.",
    "extraction_status": "success"
  },
  "https://kfor.com/business/press-releases/globenewswire/9156554/levlane-advertising-and-rosy-wellness-release-womens-health-white-paper-the-women-are-not-alright/_LevLane Advertising and Rosy Wellness Release Women's Health White Paper: \"The Women Are Not Alright\"": {
    "company": "Rosy Wellness",
    "title": "LevLane Advertising and Rosy Wellness Release Women's Health White Paper: \"The Women Are Not Alright\"",
    "url": "https://kfor.com/business/press-releases/globenewswire/9156554/levlane-advertising-and-rosy-wellness-release-womens-health-white-paper-the-women-are-not-alright/",
    "source": "Oklahoma's News",
    "body": "PHILADELPHIA, June 20, 2024 (GLOBE NEWSWIRE) -- LevLane Advertising, one of Philadelphia's oldest independent, full-service advertising agencies, and Rosy Wellness, the Webby Award-winning app ...",
    "date": "2024-06-20",
    "full_content": "News provided by\n\nJun 20, 2024, 10:00 AM\t\t\t\t\t\tET\n\nPHILADELPHIA, June  20, 2024  (GLOBE NEWSWIRE) -- LevLane Advertising, one of Philadelphia's oldest independent, full-service advertising agencies, and Rosy Wellness, the Webby Award-winning app-based platform that addresses common health concerns for women throughout their lifespans, have jointly released a white paper titled \"The Women Are Not Alright,\" which addresses critical issues in women's health.\n\nIn the white paper, the teams uncover a crucial link between mental and sexual health and the barriers to comprehensive care that women face. The report highlights significant healthcare disparities in women’s health, and the urgent need for better solutions, and provides actionable recommendations to improve women's health outcomes.\n\n\"We're excited to share this white paper, which dives into the real challenges women face with their mental and sexual health,\" said Liz Weir, Chief Marketing Officer of LevLane and co-author of the study. \"As an agency, our mission is to uncover insights that spark meaningful conversations and positive changes. We hope this research not only highlights these critical issues but also inspires better ideas and solutions for our clients and the wider market to truly support women's well-being.\"\n\nData from the research reveals that women experiencing sexual problems are 30% more likely to have poor health and 15% more likely to report low sex satisfaction.\n\nAdditionally, nearly 50% of women cite some type of mental health concern as their top health priority, with issues like depression and anxiety significantly impacting sexual well-being.\n\nLyndsey Harper, MD, CEO of Rosy Wellness, and co-author of the white paper, said, \"This research is incredibly important when it comes to understanding how critical the need for comprehensive and expert-led solutions in women’s health is. We must change the way we talk about and treat women’s health issues to ensure we can provide patients with evidence-based answers and the empowerment they need to improve their overall quality of life.”\n\nThe authors argue that fostering more robust and accessible educational programs, incentivizing holistic care through payer commitments, calling for renewed action from the investment community on focused funding for women’s health, and advancing research on the connection between mental health and sexual wellness can lead to practical solutions and destigmatization.\n\n\"We are advocating for a more comprehensive approach to addressing the needs of women, ensuring that both mental and sexual health are given equal priority and attention,\" said co-author Karla Loken, DO; OBGYN; FACOG; Vice President of Medical Affairs and Clinical Operations, HerMD; and Strategic Advisor, FEMSelect.\n\nIn conjunction with the release of the white paper, its findings and recommendations were discussed duringKisaco Research'sJune Women's Health Innovation Seriestitled \"Empowering Women Through Collaboration: Bridging the Gap Between Mental and Sexual Health.\"\n\nSpeakers from the webinar included:\n\nTo download a copy of the white paper, visit:https://go.levlane.com/the-women-are-not-alright_2024\n\nAbout LevLaneLevLane Advertising is a full-service independent advertising agency headquartered in Philadelphia that has been building brands people love for nearly 40 years. The award-winning agency integrates traditional creative expertise with cutting-edge digital capabilities in its menu of services, including search engine optimization (SEO), search engine marketing (SEM), programmatic media, strategy, creative and branding, media and analytics, social media, content marketing, and public relations.\n\nFor more information about LevLane and its capabilities, connect with us onLinkedIn,Instagram, andFacebook.\n\nAbout RosyRosy is a first-of-its-kind platform that offers personalized and holistic solutions for women's wellness. Originally focused on sexual health, the app has expanded into other underserved aspects of women's health, including endometriosis, fibroids, menopause, migraine, and more. Offerings include customized Wellness Plans, individual and group health coaching, audio and written erotica, educational videos, supportive online community, and much more. Rosy is the first physician-founded platform supporting women throughout their lifetime.\n\nIn 2022, Rosy won the UCSF Digital Health Rising Star Award in the Consumer Wellness Category, as well as the Webby Award for Best Visual Design - Aesthetic in the Apps and Software Category, and in 2023, Lyndsey Harper, MD, and Rosy were awarded the Women's Health Innovation Summit (WHIS) Judge's Choice Award.\n\nWebsite:https://meetrosy.com/Instagram:@meet_rosyLinkedIn:https://www.linkedin.com/company/meet_rosy/The Rosy App:https://meetrosy.app.link/h1yxnl3eknb\n\nMedia Contact:Lauren StraloPR Directorlstralo@levlane.com484-747-0172\n\nA photo accompanying this announcement is available at:https://www.globenewswire.com/NewsRoom/AttachmentNg/2a31cc8e-cc6e-42f2-8a93-d42efafb98f7\n\nNOTE: This content is not written by or endorsed by \"KFOR\", its advertisers, or Nexstar Media Inc.",
    "extraction_status": "success"
  },
  "https://finance.yahoo.com/news/oro-devices-names-cori-lathan-220500791.html_De Oro Devices Names Cori Lathan, PhD, as New CEO": {
    "company": "De Oro Devices",
    "title": "De Oro Devices Names Cori Lathan, PhD, as New CEO",
    "url": "https://finance.yahoo.com/news/oro-devices-names-cori-lathan-220500791.html",
    "source": "Yahoo Finance",
    "body": "Dr. Lathan joins De Oro Devices from her previous role as CEO at AnthroTronix, where she successfully invented, developed, and commercialized medical technology for over 20 years before leading ...",
    "date": "2024-01-18",
    "full_content": "Dr. Lathan brings two decades of medical technology with her to drive the health tech startup forward\n\nSAN LUIS OBISPO, CA / ACCESSWIRE / January 18, 2024 /De Oro Devices, a leading innovator in medical technology for the aging and mobility-impaired population, is pleased to announce the appointment of Dr. Cori Lathan as its new Chief Executive Officer (CEO). In her new role, Lathan will focus on continuing the rapid growth De Oro Devices has seen by exploring new partnerships across the healthcare industry and working to advance its innovative technology.\n\nDr. Lathan joins De Oro Devices from her previous role as CEO at AnthroTronix, where she successfully invented, developed, and commercialized medical technology for over 20 years before leading the company through a successful exit. She has been recognized by the World Economic Forum as a Technology Pioneer and Young Global Leader and is the founding co-chair of their Global Futures Council on Human Augmentation and Longevity. Her expertise in brain health and age tech as well as mobility products positions her as a visionary leader capable of driving De Oro Devices to new heights.\n\n\"We are thrilled to welcome Dr. Cori Lathan as our new CEO,\" said Sidney Collin, Board Member, Co-founder, President and CTO at De Oro Devices. \"Her exceptional leadership, deep industry knowledge, and commitment to innovation align perfectly with our mission. As we continue to improve the lives of the mobility-impaired, I know Dr. Lathan is the right leader to take De Oro Devices forward.\"\n\n\"I am honored and excited to lead De Oro Devices into its next chapter of growth and innovation,\" said Dr. Cori Lathan. \"The team's dedication to changing lives through developing transformational medical technologies is inspiring, and I look forward to building on the company's successes to make a meaningful impact on technology for the aging population globally.\"\n\nDe Oro Devices is at the forefront of medical technology, known for creating the first non-invasive cueing technology that can be used with any mobility aid to improve mobility and decrease falls for people with mobility impairments. Learn more at www.getnexstride.com.\n\nAbout De Oro Devices\n\nDe Oro Devices is an award-winning tech startup that's restoring mobility, independence, and a higher quality of life to individuals with mobility challenges and/or heightened fall risk. De Oro's flagship product, NexStride, is a small, unobtrusive device that can attach to any assisted walking tool (i.e., cane, walker, or rollator), which leverages visual and auditory cueing technology to reduce fall risk and improve mobility. Learn more atwww.getnexstride.com.\n\nContact Information\n\nWilliam Thompsonpr@deorodevices.com\n\nSOURCE:De Oro Devices\n\nView the originalpress releaseon newswire.com.",
    "extraction_status": "success"
  },
  "https://abc30.com/parkinsons-disease-nexstride-device-de-oro-devices-clovis-veteran-able-to-walk/12728394/_New device helps Clovis veteran with Parkinson's walk again": {
    "company": "De Oro Devices",
    "title": "New device helps Clovis veteran with Parkinson's walk again",
    "url": "https://abc30.com/parkinsons-disease-nexstride-device-de-oro-devices-clovis-veteran-able-to-walk/12728394/",
    "source": "ABC30 Action News",
    "body": "CLOVIS, Calif. (KFSN) -- The simple act of walking can be challenging for those living with Parkinson's disease, which affects movement. However, a Clovis veteran is now on the move with the help ...",
    "date": "2023-01-25",
    "full_content": "The device essentially uses the same visual and auditory signals or cues used in physical therapy.\n\nCLOVIS, Calif. (KFSN) --The simple act of walking can be challenging for those living with Parkinson's disease, which affects movement.\n\nHowever, a Clovis veteran is now on the move with the help of a newly-invented device.\n\n\"It feels like your feet are stuck in cement,\" explained Patrick Hallmark. \"A lot of people who have Parkinson's, you'd be going through a doorway or whatever, and your feet -- you just cannot move your feet.\"\n\nThe 63-year-old has a condition called \"Freezing of Gait,\" which can come with Parkinson's.\n\nIt can lead to falls and hospitalizations.\n\nFor Hallmark, it also came with a loss of independence.\n\n\"If I didn't have my wife or daughter with me, I would really have a hard time out going to stores and everything,\" he said.\n\nThat's all changed with a device as small as his palm.\n\n\"This has done wonders,\" Hallmark said, as he shows his NexStride device.\n\nThrough a Parkinson's support group, Hallmark learned about NexStride and immediately bought the device.\n\nNow he's walking, despite his condition.\n\nSidney Collin, CEO of De Oro Devices, explained why walking can be hard for people with Freezing of Gait.\n\n\"There's a disconnect between the brain and the body, and it makes it so that when the brain is sending that signal to initiate movement, it doesn't get to the motor neurons that are activating the muscles,\" she said.\n\nCollin, a biomedical engineer, created NexStride for a veteran while she was in college.\n\nThe device essentially uses the same visual and auditory signals or cues used in physical therapy.\n\n\"The visual cue that we use is a green laser line projected onto the floor in front of you. The auditory cue is a metronome,\" she explained. \"So you visualize yourself stepping over that green laser line, stepping to the beat of the metronome. Just by changing the intention behind the movement, by setting that goal, we're changing the part of the brain that's been activated, that allows someone to be able to restore mobility.\"\n\nCollin is happy to see NexStride restoring mobility for people like Hallmark.\n\n\"I am able to walk or take my dog for walks,\" Hallmark said. \"I'm able to get out and go shopping, grocery shopping for my wife -- just do different things like that.\"\n\nThe device is $499 and it's 100% covered for veterans through Veterans Affairs, as well as the Parkinson's Wellness Fund organization.",
    "extraction_status": "success"
  },
  "https://www.eurekalert.org/news-releases/1051592_Automated appointment scheduling and reminder messages may improve post-partum health and well-being for those with chronic health conditions": {
    "company": "Partum Health",
    "title": "Automated appointment scheduling and reminder messages may improve post-partum health and well-being for those with chronic health conditions",
    "url": "https://www.eurekalert.org/news-releases/1051592",
    "source": "EurekAlert!",
    "body": "A new study in JAMA Network Open found that an intervention involving automated appointment scheduling and reminder messages may improve post-partum health and well-being for these individuals.",
    "date": "2024-07-16",
    "full_content": "Key Takeaways\n\nMany pregnant people have chronic medical conditions, and although they are usually closely monitored during pregnancy, they often face barriers when transitioning to primary care following delivery.\n\nA new study inJAMA Network Openfound that an intervention involving automated appointment scheduling and reminder messages may improve post-partum health and well-being for these individuals.\n\nThe research was led by investigators at Massachusetts General Hospital, a founding member of the Mass General Brigham healthcare.\n\n“Individuals with chronic and mental health conditions typically have frequent contact with obstetrical care providers while pregnant but often are largely left to navigate ongoing care needs on their own after delivery—referred to as the ‘postpartum cliff’,” explained lead authorMark Clapp, MD, MPH, a maternal-fetal medicine specialist in the Department of Obstetrics and Gynecology at Massachusetts General Hospital and an assistant professor of Obstetrics, Gynecology, and Reproductive Biology at Harvard Medical School. “Among other factors, this ‘cliff’ is caused by administrative burdens, such as appointment scheduling and navigating insurance, which make it difficult for individuals to seek care.”\n\nTo address this problem, Clapp and his colleagues evaluated the potential of auto scheduling appointments, along with tailored messages and nudge reminders, to improve primary care engagement within four months after delivery for postpartum individuals with diabetes, hypertension, mental illness, or obesity.\n\nIn the randomized clinical trial of 360 patients, those who received the intervention were more likely to have a primary care visit than those who did not, highlighting the potential of this low-cost intervention to transition ongoing care needs after pregnancy to primary care clinicians.\n\nSpecifically, the intervention increased postpartum primary care visits by 19 percentage points. It also resulted in more individuals receiving important screening tests and services, including blood pressure screening (42.8% versus 28.3%), weight assessment (42.8% versus 27.7%), and depression screening (32.8% versus 16.8%).\n\n“Our findings indicate that a multifaceted and relatively low-resource behavioral economic intervention may improve postpartum health and well-being,” said Clapp.\"As a primary care physician, I have frequently observed how care is improved for individual patients by a careful transition between obstetrics and primary care,\" saysAlaka Ray, MD, a Mass General primary care physician and an author of the study. \"It is wonderful that this study has now demonstrated the importance of that connection in the form of significant benefits for postpartum patients with high-risk conditions.\"\"I would also note that this study population is comprised of patients who already had an established primary care physician. We all know, however, that many others cannot find a primary care physician,\" says Ray. \"It is my hope that this study will add further urgency to the call to address our worsening primary care shortage so that evidence-based interventions like this can be broadly implemented for all of our patients.\"\n\nAuthorship:Mark A. Clapp, Alaka Ray, Pichliya Liang, Kaitlyn E. James, Ishani Ganguli, and Jessica L. Cohen.\n\nDisclosures:Disclosure forms provided by the authors are available with the full text of this article.\n\nFunding:This work was supported by the National Institute on Aging and the National Academy of Medicine.\n\nAbout Massachusetts General Hospital\n\nMassachusetts General Hospital, founded in 1811, is the original and largest teaching hospital of Harvard Medical School. The Mass General Research Institute conducts the largest hospital-based research program in the nation, with annual research operations of more than $1 billion and comprises more than 9,500 researchers working across more than 30 institutes, centers and departments. MGH is a founding member of the Mass General Brigham healthcare system.\n\nJAMA Network Open\n\n10.1001/jamanetworkopen.2024.22500\n\nExperimental study\n\nPeople\n\nPostpartum Primary Care Engagement Using Default Scheduling and Tailored Messaging\n\n16-Jul-2024\n\nDisclaimer:AAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert system.",
    "extraction_status": "success"
  },
  "https://www.woodtv.com/business/press-releases/cision/20250318NY41483/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role-playing-practice-and-scalable-client-care/_Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care": {
    "company": "Fort Health",
    "title": "Fort Health Partners with Colleva to Train its Therapists with AI Patient Avatars for Role-Playing Practice and Scalable Client Care",
    "url": "https://www.woodtv.com/business/press-releases/cision/20250318NY41483/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role-playing-practice-and-scalable-client-care/",
    "source": "WOOD-TV",
    "body": "Using Fort Health's agentic AI training platform - which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers - therapists ...",
    "date": "2025-03-18",
    "full_content": "News provided by\n\nMar 18, 2025, 9:00 AM\t\t\t\t\t\tET\n\nAgentic AI Custom Training Scenarios Result in 83% of Clinicians Feeling More Prepared and 95% Able to Apply What They Have Learned\n\nNEW YORK,March 18, 2025/PRNewswire/ -- The high stakes nature of youth mental health therapy requires thorough preparation and applied evidence-based skills. Today,Fort Health, a specialty outpatient pediatric mental health provider, announced that it has partnered withCollevato train its therapists with AI avatar-led, face-to-face simulations. By providing highly relevant and engaging customized scenarios, Fort Health is able to rapidly upskill its therapists using evidence-based therapeutic protocols, ultimately leading to improved client care and operational efficiency. The initial series of custom training scenarios resulted in 83% of clinicians feeling more prepared and 95% able to apply what they have learned.\n\nAbody of researchfrom the National Institute of Medicine shows that current efforts to train clinicians in empirically-based treatments (EBTs) face significant challenges, as they typically provide only didactic training with no examination of applied skills, follow-up support, or implementation feedback. Studies emphasize the importance of role-play skill practice and ongoing expert guidance to ensure clinicians maintain high fidelity to EBT protocols and deliver effective interventions to patients. Compounded by thebehavioral health care workforce shortage,these limitations underscore the need for innovative training approaches to address challenges in a cost-effective and scalable manner.\n\n\"AI-powered avatar simulations are revolutionizing therapist training by enabling immersive, risk-free practice of critical decision-making and patient interactions,\" saidNatalie Schneider, founding CEO of Fort Health. \"Colleva's AI coaching platform empowers us to design tailored, dynamic scenarios that mirror real-world challenges, providing therapists with hands-on experience in applying evidence-based treatment protocols. By leveraging AI patient avatars, we are transforming mental health training—making it more proactive, personalized, and scalable to meet the growing demand for high-quality care.\"\n\nHow it Works\n\nUsing Fort Health's agentic AI training platform – which is modeled on the evidence-based treatment protocol, the Unified Protocol for children, adolescents, and caregivers – therapists conduct realistic role plays with custom avatars and receive personalized feedback to identify areas for improvement and highlight strengths. The series of interactive scenarios are a safe space to practice and develop therapeutic techniques. To help therapists build and demonstrate their proficiency, there are three scenarios representative of the patient population that Fort Health treats. Each of the scenario's avatars have six personalities to choose from, allowing for more realistic and varied practice. Each custom simulation uses generative AI to analyze both content and delivery. Personalized feedback is based on specific EBT objectives and CBT competency frameworks. Therapists are also provided instant feedback on soft skill competencies important to successful therapy outcomes.\n\n\"We are harnessing AI not to replace human therapists, but to make them more effective,\" saidMichael Palys, co-founder and president of Colleva. \"It's been wonderful working in partnership with the Fort Health team as they share our collective vision of using AI role plays and simulations to enhance human skills in areas like mental health where these skills are so critically important to successful patient outcomes. The ability to offer personalized 1:1 feedback at scale is a game changer. My father's own career in psychiatry has made this particular project very special to me, and it's been wonderful to see the excitement among practitioners.\"\n\n\"As a therapist, I know how challenging it can be to translate the professional training we receive into real life interactions with children and families. I also know how uncomfortable and anxiety provoking it can be for a therapist to participate in role plays or live observations. Having a private, safe space to fumble and trip as you sharpen your skill set is a game changer for most therapists,\" saidLindsay Henderson, PsyD, founding clinical director, Fort Health. \"Utilizing AI simulations as a training platform to increase therapist's ability to deliver EBT at a higher fidelity will be key to solving for our nation's youth mental health needs.\"\n\n\"What a unique training opportunity! It allows me to practice and improve my clinical skills in a way I've never before experienced. I love getting immediate feedback which I can implement in real time,\" said Licensed Professional Counselor Catherine Murray.\n\nAbout Fort Health\n\nFounded in 2022, Fort Health is a specialty outpatient pediatric mental health provider. Fort Health transforms how children and adolescents, ages 4-24, receive mental health care by seamlessly partnering with pediatricians to provide evidence-based therapy, psychiatry, and parent coaching – all covered by insurance. Fort Health was built in partnership with the Child Mind Institute, an independent non-profit dedicated to transforming the lives of children and families struggling with mental health, mental illness and learning disorders. The company operates inNew Jersey,New York,Pennsylvania, andTexasandIllinois. VisitFort Healthon our website and onLinkedIn.\n\nAbout Colleva\n\nFounded in 2023, Colleva is an AI-powered enterprise talent platform that can help professionals enhance both hard and soft skills through personalized, scalable 1:1 feedback. Using AI avatars to provide AI roleplay and simulation-based training, Colleva provides immersive practice environments where professionals master critical interactions with immediate feedback. Colleva offers solutions across talent acquisition, onboarding, learning & development, performance management, and employee insights for organizations within healthcare, financial services, as well as other sectors. Headquartered inGreenwich, Connecticut, Colleva is transforming workforces through innovative AI solutions. Visit Colleva on our website and on LinkedIn.\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/fort-health-partners-with-colleva-to-train-its-therapists-with-ai-patient-avatars-for-role-playing-practice-and-scalable-client-care-302402020.html\n\nSOURCE  Fort Health\n\nNOTE: This content is not written by or endorsed by \"WOOD\", its advertisers, or Nexstar Media Inc.",
    "extraction_status": "success"
  },
  "https://www.mainebiz.biz/article/with-new-retail-products-atlantic-sea-farms-seeks-to-expand-kelp-market_With new retail products, Atlantic Sea Farms seeks to expand kelp market": {
    "company": "Atlantic Sea Farms",
    "title": "With new retail products, Atlantic Sea Farms seeks to expand kelp market",
    "url": "https://www.mainebiz.biz/article/with-new-retail-products-atlantic-sea-farms-seeks-to-expand-kelp-market",
    "source": "Mainebiz",
    "body": "Atlantic Sea Farms A kelp farm can produce three to seven pounds per foot of line. With up to 18,000 feet of line in the water, \"that's a lot of kelp,\" said Atlantic Sea Farms CEO Briana Warner.",
    "date": "2019-04-17",
    "full_content": "From left, Atlantic Sea Farms supply chain manager James Crimp, CEO Briana Warner and sales and marketing manager Jesse Baines.",
    "extraction_status": "success"
  }
}